// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/SerLib1C/
// ----------------------------------------------------------

// BSLLS:CreateQueryInCycle-off
// BSLLS:DeprecatedCurrentDate-off
// BSLLS:DeprecatedMessage-off
// BSLLS:UsingExternalCodeTools-off
// BSLLS:MissingParameterDescription-off
// BSLLS:NestedFunctionInParameters-off

// sonar:CreateQueryInCycle-off
// sonar:DeprecatedCurrentDate-off
// sonar:DeprecatedMessage-off
// sonar:UsingExternalCodeTools-off
// sonar:MissingParameterDescription-off
// sonar:NestedFunctionInParameters-off

// @skip-check query-in-loop
// @skip-check doc-comment-field-in-description-suggestion
// @skip-check module-self-reference
// @skip-check use-non-recommended-method

#Область ОписаниеПеременных

&НаСервере
Перем Библиотека;    // - ВнешняяОбработка    - обработка-библиотека преобразования данных

#КонецОбласти // ОписаниеПеременных

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы
//
//@skip-check bsl-legacy-check-if-preprocessor-part-environments
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Для Каждого ТекОтчет Из Метаданные.Отчеты Цикл
		ТестируемыеОтчеты.Добавить(ВРег(ТекОтчет.Имя), ТекОтчет.Представление());
	КонецЦикла;
	ТестируемыеОтчеты.СортироватьПоПредставлению();

КонецПроцедуры // ПриСозданииНаСервере()

// Процедура - обработчик события "ПриОткрытии" формы
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПрочитатьНастройки();
	
	Элементы.ВерсияБиблиотеки.Заголовок = СтрШаблон("Библиотека преобразования данных v. %1", ВерсияБиблиотеки());

КонецПроцедуры // ПриОткрытии()

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработка начала выбора каталога
//
&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = "Каталог результатов теста СКД";

	ЗавершениеВыбораКаталога = Новый ОписаниеОповещения("КаталогВыгрузкиНачалоВыбораЗавершение", ЭтотОбъект);

	Диалог.Показать(ЗавершениеВыбораКаталога);

КонецПроцедуры // КаталогВыгрузкиНачалоВыбора()

// Процедура - обработка изменения каталога
//
&НаКлиенте
Процедура КаталогВыгрузкиПриИзменении(Элемент)

	ЭтотОбъект.ВыгрузитьРезультатыТеста = ЗначениеЗаполнено(ЭтотОбъект.КаталогВыгрузки);

КонецПроцедуры // КаталогВыгрузкиПриИзменении()

#КонецОбласти // ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "Тест" формы
//
&НаКлиенте
Процедура Тест(Команда)

	Если ВыгрузитьРезультатыТеста Тогда
		ОбеспечитьКаталог(КаталогВыгрузки + "\orig");
		ОбеспечитьКаталог(КаталогВыгрузки + "\test");
	КонецЕсли;

	ТестируемыеОбъекты = Новый Массив();
	
	Если ТестироватьОбъекты Тогда
		ДобавитьОбъектыДляТестирования(ТестируемыеОбъекты);
	КонецЕсли;
	Если ТестироватьРегистры Тогда
		ДобавитьРегистрыДляТестирования(ТестируемыеОбъекты);
	КонецЕсли;
	Если ТестироватьКоллекции Тогда
		ДобавитьКоллекцииДляТестирования(ТестируемыеОбъекты);
	КонецЕсли;
	ДобавитьОтчетыДляТестирования(ТестируемыеОбъекты);
	
	НачВремя = ТекущаяДата();
	
	Ошибки = Новый Соответствие();

	ПорцияДляТестирования = Новый Массив();

	Для й = 0 По ТестируемыеОбъекты.ВГраница() Цикл
		
		ПорцияДляТестирования.Добавить(ТестируемыеОбъекты[й]);
		
		Если ПорцияДляТестирования.Количество() < РазмерПорции
		   И й < ТестируемыеОбъекты.ВГраница()
		 ИЛИ ПорцияДляТестирования.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
			
		АдресТестовыхДанных = ПоместитьВоВременноеХранилище(ПорцияДляТестирования, ЭтотОбъект.УникальныйИдентификатор);

		АдресаФайлов = Новый Соответствие();
		
		ТестНаСервере(АдресТестовыхДанных, АдресаФайлов, Ошибки);

		ПорцияДляТестирования.Очистить();

		Если НЕ ВыгрузитьРезультатыТеста Тогда
			Продолжить;
		КонецЕсли;

		Для Каждого ТекРезультат Из АдресаФайлов Цикл
			ВремФайл = Новый ТекстовыйДокумент();
			ВремФайл.УстановитьТекст(ПолучитьИзВременногоХранилища(ТекРезультат.Значение.Первый));
			ВремФайл.Записать(КаталогВыгрузки + "\orig\" + ТекРезультат.Ключ + ".json");
				
			ВремФайл = Новый ТекстовыйДокумент();
			ВремФайл.УстановитьТекст(ПолучитьИзВременногоХранилища(ТекРезультат.Значение.Второй));
			ВремФайл.Записать(КаталогВыгрузки + "\test\" + ТекРезультат.Ключ + ".json");
		КонецЦикла;
		
	КонецЦикла;
	
	КонВремя = ТекущаяДата();
	
	Для Каждого ТекОшибка Из Ошибки Цикл
		ПоказатьСообщение(ТекОшибка.Значение);
	КонецЦикла;
	
	ФорматЧисла = "ЧН=; ЧГ=";
	
	ПоказатьСообщение("Всего объектов: "       + Формат(ТестируемыеОбъекты.Количество(), ФорматЧисла));
	ПоказатьСообщение("Ошибок: "               + Формат(Ошибки.Количество(), ФорматЧисла));
	ПоказатьСообщение("Начало выполнения: "    + Формат(НачВремя, ФорматЧисла));
	ПоказатьСообщение("Окончание выполнения: " + Формат(КонВремя, ФорматЧисла));
	ПоказатьСообщение("Время выполнения: "     + Формат(КонВремя - НачВремя, ФорматЧисла) + " с.");
	ПоказатьСообщение("Скорость всего: "
	                + Формат(ТестируемыеОбъекты.Количество() / (КонВремя - НачВремя), ФорматЧисла) + " об./с.");

КонецПроцедуры // Тест()

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

// Процедура - продолжение обработки выбора каталога
//
// Параметры:
//  ВыбранныеФайлы             - Массив из Строка     - выбранные каталоги
//  ДополнительныеПараметры    - Структура            - доп. параметры обработки
//
&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		// BSLLS:UnusedLocalVariable-off
		// sonar:UnusedLocalVariable-off
		КаталогВыгрузки = ВыбранныеФайлы[0];
		// BSLLS:UnusedLocalVariable-on
		// sonar:UnusedLocalVariable-on

		КаталогВыгрузкиПриИзменении(Элементы.КаталогВыгрузки);
	КонецЕсли;

КонецПроцедуры // КаталогВыгрузкиНачалоВыбораЗавершение()

// Процедура - выполняет тесты сериализации/десериализации данных
//
// Параметры:
//  АдресТестовыхДанных    - Строка                   - адрес хранилища данных для тестирования
//  АдресаФайлов           - Соответствие из Строка   - список файлов-результатов для сохранения
//  Ошибки                 - Соответствие из Строка   - список ошибок сериализации/десериализации
//
&НаСервере
Процедура ТестНаСервере(Знач АдресТестовыхДанных, АдресаФайлов = Неопределено, Ошибки = Неопределено)
	
	Если НЕ ТипЗнч(АдресаФайлов) = Тип("Соответствие") Тогда
		АдресаФайлов = Новый Соответствие();
	КонецЕсли;
	
	Если НЕ ТипЗнч(Ошибки) = Тип("Соответствие") Тогда
		Ошибки = Новый Соответствие();
	КонецЕсли;
	
	ТестируемыеОбъекты = ПолучитьИзВременногоХранилища(АдресТестовыхДанных);
	
	Для Каждого ТекТестируемыйОбъект Из ТестируемыеОбъекты Цикл
		
		Если ТекТестируемыйОбъект.Тип = ТипыТестируемыхОбъектов().Объект Тогда
			ТестОбъекта(ТекТестируемыйОбъект, АдресаФайлов, Ошибки);
		ИначеЕсли ТекТестируемыйОбъект.Тип = ТипыТестируемыхОбъектов().Регистр Тогда
			ТестРегистра(ТекТестируемыйОбъект, АдресаФайлов, Ошибки);
		ИначеЕсли ТекТестируемыйОбъект.Тип = ТипыТестируемыхОбъектов().Коллекция Тогда
			ТестКоллекции(ТекТестируемыйОбъект, АдресаФайлов, Ошибки);
		ИначеЕсли ТекТестируемыйОбъект.Тип = ТипыТестируемыхОбъектов().СКД Тогда
			ТестСКД(ТекТестируемыйОбъект, АдресаФайлов, Ошибки);
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ТестНаСервере()

// Функция - возвращает список типов тестируемых объектов
//
// Возвращаемое значение:
//  ФиксированнаяСтруктура из Строка    - типы тестируемых объектов
//    *Объект       - Строка              - ссылочный объект (Справочники, Документы и т.п.)
//    *Регистр      - Строка              - набор записей регистра (РегистрСведений, РегистрНакопления и т.п.)
//    *Коллекция    - Строка              - стандартная коллекция (Массив, Структура, ТаблицаЗначений и т.п.)
//    *СКД          - Строка              - схема компоновки данных
//
&НаКлиентеНаСервереБезКонтекста
Функция ТипыТестируемыхОбъектов()
	
	ТипыОбъектов = Новый Структура();
	ТипыОбъектов.Вставить("Объект"   , "ОБЪЕКТ");
	ТипыОбъектов.Вставить("Регистр"  , "РЕГИСТР");
	ТипыОбъектов.Вставить("Коллекция", "КОЛЛЕКЦИЯ");
	ТипыОбъектов.Вставить("СКД"      , "СКД");
	
	Возврат Новый ФиксированнаяСтруктура(ТипыОбъектов);

КонецФункции // ТипыТестируемыхОбъектов()

// Процедура - добавляет ссылочные объекты в список для тестирования
//
// Параметры:
//  ТестируемыеОбъекты    - Массив из Структура    - (возвр.) описание объекта для тестирования
//                                                   (см. ОписаниеТестируемогоОбъекта())
//
&НаСервере
Процедура ДобавитьОбъектыДляТестирования(ТестируемыеОбъекты)
	
	Если ТипЗнч(ТестируемыеОбъекты) = Тип("Массив") Тогда
		ТестируемыеОбъекты = Новый Массив();
	КонецЕсли;
	
	Первые = ?(КоличествоВВыборке > 0, " ПЕРВЫЕ " + Формат(КоличествоВВыборке, "ЧГ=;"), "");
	УсловиеЭлементы = "ГДЕ НЕ ТекТаб.ЭтоГруппа";
	УсловиеГруппы = "ГДЕ ТекТаб.ЭтоГруппа";
	ШаблонЗапроса = "ВЫБРАТЬ %1
	                |	ТекТаб.Ссылка КАК Ссылка
	                |ИЗ
	                |	%2.%3 КАК ТекТаб
	                |%4";
	Запрос = Новый Запрос();

	Вид = "Справочник";

	Для Каждого ТекМетаОбъект Из Метаданные.Справочники Цикл

		ПравилоВыгрузки = Новый Структура("ТипИсточника, ФункцияДополнения");
		ПравилоВыгрузки.ТипИсточника      = ТекМетаОбъект.ПолноеИмя();
		ПравилоВыгрузки.ФункцияДополнения = "ДобавитьНаименованиеОбъекта";

		Если ТекМетаОбъект.Иерархический
		   И ТекМетаОбъект.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
			Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Вид, ТекМетаОбъект.Имя, УсловиеГруппы);
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл

				ОписаниеСсылки = ОписаниеСсылки(Выборка.Ссылка, Новый Массив());
				ОписаниеСсылки.ПравилаВыгрузки.Добавить(ПравилоВыгрузки);
				
				ИмяОбъекта = СтрШаблон("%1.%2", ПравилоВыгрузки.ТипИсточника, Выборка.Ссылка.УникальныйИдентификатор());
				ОписаниеОбъекта = ОписаниеТестируемогоОбъекта(ТипыТестируемыхОбъектов().Объект,
				                                              ИмяОбъекта,
				                                              ОписаниеСсылки);

				ТестируемыеОбъекты.Добавить(ОписаниеОбъекта);
			КонецЦикла;
			Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Вид, ТекМетаОбъект.Имя, УсловиеЭлементы);
		Иначе
			Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Вид, ТекМетаОбъект.Имя, "");
		КонецЕсли;
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл

			ОписаниеСсылки = ОписаниеСсылки(Выборка.Ссылка, Новый Массив());
			ОписаниеСсылки.ПравилаВыгрузки.Добавить(ПравилоВыгрузки);
			
			ИмяОбъекта = СтрШаблон("%1.%2", ПравилоВыгрузки.ТипИсточника, Выборка.Ссылка.УникальныйИдентификатор());
			ОписаниеОбъекта = ОписаниеТестируемогоОбъекта(ТипыТестируемыхОбъектов().Объект, ИмяОбъекта, ОписаниеСсылки);
			
			ТестируемыеОбъекты.Добавить(ОписаниеОбъекта);
		КонецЦикла;
	КонецЦикла;
	
	Вид = "ПланВидовХарактеристик";
	Для Каждого ТекМетаОбъект Из Метаданные.ПланыВидовХарактеристик Цикл
		Если ТекМетаОбъект.Иерархический Тогда
			Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Вид, ТекМетаОбъект.Имя, УсловиеГруппы);
			ДобавитьТестируемыеОбъектыИзЗапроса(ТестируемыеОбъекты, Запрос, ТекМетаОбъект.ПолноеИмя());
			Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Вид, ТекМетаОбъект.Имя, УсловиеЭлементы);
		Иначе
			Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Вид, ТекМетаОбъект.Имя, "");
		КонецЕсли;
		ДобавитьТестируемыеОбъектыИзЗапроса(ТестируемыеОбъекты, Запрос, ТекМетаОбъект.ПолноеИмя());
	КонецЦикла;
	
	Вид = "ПланВидовРасчета";
	Для Каждого ТекМетаОбъект Из Метаданные.ПланыВидовРасчета Цикл
		Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Вид, ТекМетаОбъект.Имя, "");
		ДобавитьТестируемыеОбъектыИзЗапроса(ТестируемыеОбъекты, Запрос, ТекМетаОбъект.ПолноеИмя());
	КонецЦикла;
	
	Вид = "ПланСчетов";
	Для Каждого ТекМетаОбъект Из Метаданные.ПланыСчетов Цикл
		Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Вид, ТекМетаОбъект.Имя, "");
		ДобавитьТестируемыеОбъектыИзЗапроса(ТестируемыеОбъекты, Запрос, ТекМетаОбъект.ПолноеИмя());
	КонецЦикла;
	
	Вид = "ПланОбмена";
	Для Каждого ТекМетаОбъект Из Метаданные.ПланыОбмена Цикл
		Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Вид, ТекМетаОбъект.Имя, "");
		ДобавитьТестируемыеОбъектыИзЗапроса(ТестируемыеОбъекты, Запрос, ТекМетаОбъект.ПолноеИмя());
	КонецЦикла;
	
	Вид = "Документ";
	Для Каждого ТекМетаОбъект Из Метаданные.Документы Цикл
		Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Вид, ТекМетаОбъект.Имя, "");
		ДобавитьТестируемыеОбъектыИзЗапроса(ТестируемыеОбъекты, Запрос, ТекМетаОбъект.ПолноеИмя());
	КонецЦикла;
	
КонецПроцедуры // ДобавитьОбъектыДляТестирования()

// Процедура - выполняет запрос и добавляет ссылочные объекты в список для тестирования
//
// Параметры:
//  ТестируемыеОбъекты    - Массив из Структура    - (возвр.) описание объекта для тестирования
//                                                   (см. ОписаниеТестируемогоОбъекта())
//  Запрос                - Запрос                 - запрос получения списка объектов
//  ИмяОбъекта            - Строка                 - строковое имя тестируемого объекта
//
&НаСервере
Процедура ДобавитьТестируемыеОбъектыИзЗапроса(ТестируемыеОбъекты, Запрос, Знач ИмяОбъекта)

	Если НЕ ТипЗнч(ТестируемыеОбъекты) = Тип("Массив") Тогда
		ТестируемыеОбъекты = Новый Массив();
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОписаниеСсылки = ОписаниеСсылки(Выборка.Ссылка, Новый Массив());

		ИмяОбъекта = СтрШаблон("%1.%2", ИмяОбъекта, Выборка.Ссылка.УникальныйИдентификатор());
		ОписаниеОбъекта = ОписаниеТестируемогоОбъекта(ТипыТестируемыхОбъектов().Объект, ИмяОбъекта, ОписаниеСсылки);

		ТестируемыеОбъекты.Добавить(ОписаниеОбъекта);
	КонецЦикла;

КонецПроцедуры // ДобавитьТестируемыеОбъектыИзЗапроса()

// Процедура - добавляет описания наборов записей регистров для тестирования
//
// Параметры:
//  ТестируемыеОбъекты    - Массив из Структура    - (возвр.) описание наборов записей регистров для тестирования
//                                                   (см. ОписаниеТестируемогоОбъекта())
//
&НаСервере
Процедура ДобавитьРегистрыДляТестирования(ТестируемыеОбъекты)
	
	Если ТипЗнч(ТестируемыеОбъекты) = Тип("Массив") Тогда
		ТестируемыеОбъекты = Новый Массив();
	КонецЕсли;
	
	Первые = ?(КоличествоВВыборке > 0, " ПЕРВЫЕ " + Формат(КоличествоВВыборке, "ЧГ=;"), "");
	ШаблонЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ %1
	                |	%2
	                |ИЗ
	                |	%3.%4 КАК ТекТаб";
	Запрос = Новый Запрос();

	ПолеРегистратора = "ТекТаб.Регистратор КАК Регистратор";

	Подчиненность = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра;
	Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений;

	Вид = "РегистрСведений";
	Для Каждого ТекМетаОбъект Из Метаданные.РегистрыСведений Цикл

		Если ТекМетаОбъект.РежимЗаписи = Подчиненность.ПодчинениеРегистратору Тогда
			Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, ПолеРегистратора, Вид, ТекМетаОбъект.Имя);
			ДобавитьТестируемыеРегистрыИзЗапроса(ТестируемыеОбъекты, Запрос, ТекМетаОбъект.ПолноеИмя());
		Иначе
			Поля = "";
		
			Если НЕ ТекМетаОбъект.ПериодичностьРегистраСведений = Периодичность.Непериодический Тогда
				Поля = "ТекТаб.Период КАК Период";
			КонецЕсли;
				
			Для Каждого ТекИзмерение Из ТекМетаОбъект.Измерения Цикл
				Разделитель = ?(Поля = "", "", СтрШаблон(",%1%2", Символы.ПС, Символы.Таб));
				Поля = СтрШаблон("%1%2ТекТаб.%3 КАК %3", Поля, Разделитель, ТекИзмерение.Имя);
			КонецЦикла;
			
			Если Поля = "" Тогда
				ОписаниеОбъекта = ОписаниеТестируемогоОбъекта(ТипыТестируемыхОбъектов().Регистр,
				                                              ТекМетаОбъект.ПолноеИмя(),
				                                              Неопределено);
				ТестируемыеОбъекты.Добавить(ОписаниеОбъекта);
				Продолжить;
			КонецЕсли;
			
			Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, Поля, Вид, ТекМетаОбъект.Имя);

			Отбор = Новый Структура();
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				Для Каждого ТекИзмерение Из ТекМетаОбъект.Измерения Цикл
					Отбор.Вставить(ТекИзмерение.Имя, Выборка[ТекИзмерение.Имя]);
				КонецЦикла;
					
				Хэш = Новый ХешированиеДанных(ХешФункция.MD5);
				Хэш.Добавить(ЗначениеВСтрокуВнутр(Отбор));
				Ид = Base64Строка(Хэш.ХешСумма);
				Ид = КодироватьСтроку(Ид, СпособКодированияСтроки.КодировкаURL);
				Ид = СтрЗаменить(Ид, "%", "");
				ИмяОбъекта = СтрШаблон("%1.%2", ТекМетаОбъект.ПолноеИмя(), Ид);
				
				ОписаниеОбъекта = ОписаниеТестируемогоОбъекта(ТипыТестируемыхОбъектов().Регистр, ИмяОбъекта, Отбор);
				
				ТестируемыеОбъекты.Добавить(ОписаниеОбъекта);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Вид = "РегистрНакопления";
	Для Каждого ТекМетаОбъект Из Метаданные.РегистрыНакопления Цикл
		Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, ПолеРегистратора, Вид, ТекМетаОбъект.Имя);
		ДобавитьТестируемыеРегистрыИзЗапроса(ТестируемыеОбъекты, Запрос, ТекМетаОбъект.ПолноеИмя());
	КонецЦикла;
	
	Вид = "РегистрБухгалтерии";
	Для Каждого ТекМетаОбъект Из Метаданные.РегистрыБухгалтерии Цикл
		Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, ПолеРегистратора, Вид, ТекМетаОбъект.Имя);
		ДобавитьТестируемыеРегистрыИзЗапроса(ТестируемыеОбъекты, Запрос, ТекМетаОбъект.ПолноеИмя());
	КонецЦикла;
	
	Вид = "РегистрРасчета";
	Для Каждого ТекМетаОбъект Из Метаданные.РегистрыРасчета Цикл
		Запрос.Текст = СтрШаблон(ШаблонЗапроса, Первые, ПолеРегистратора, Вид, ТекМетаОбъект.Имя);
		ДобавитьТестируемыеРегистрыИзЗапроса(ТестируемыеОбъекты, Запрос, ТекМетаОбъект.ПолноеИмя());
	КонецЦикла;
	
КонецПроцедуры // ДобавитьРегистрыДляТестирования()

// Процедура - выполняет запрос и добавляет наборы записей регистров в список для тестирования
//
// Параметры:
//  ТестируемыеОбъекты    - Массив из Структура    - (возвр.) описание набора записей регистра для тестирования
//                                                   (см. ОписаниеТестируемогоОбъекта())
//  Запрос                - Запрос                 - запрос получения наборов записей регистра
//  ИмяОбъекта            - Строка                 - строковое имя тестируемого регистра
//
&НаСервере
Процедура ДобавитьТестируемыеРегистрыИзЗапроса(ТестируемыеОбъекты, Запрос, Знач ИмяОбъекта)

	Если НЕ ТипЗнч(ТестируемыеОбъекты) = Тип("Массив") Тогда
		ТестируемыеОбъекты = Новый Массив();
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Отбор = Новый Структура();
		Отбор.Вставить("Регистратор", Выборка.Регистратор);
	
		ИмяОбъекта = СтрШаблон("%1.%2", ИмяОбъекта, Выборка.Регистратор.УникальныйИдентификатор());
		ОписаниеОбъекта = ОписаниеТестируемогоОбъекта(ТипыТестируемыхОбъектов().Регистр, ИмяОбъекта, Отбор);
		
		ТестируемыеОбъекты.Добавить(ОписаниеОбъекта);
	КонецЦикла;

КонецПроцедуры // ДобавитьТестируемыеРегистрыИзЗапроса()

// Процедура - добавляет описания коллекций для тестирования
// (Массив, Структура, Соответствие, ТаблицаЗначений, ДеревоЗначений) 
//
// Параметры:
//  ТестируемыеОбъекты    - Массив из Структура    - (возвр.) описание коллекций для тестирования
//                                                   (см. ОписаниеТестируемогоОбъекта())
//
&НаСервере
Процедура ДобавитьКоллекцииДляТестирования(ТестируемыеОбъекты)

	Если НЕ ТипЗнч(ТестируемыеОбъекты) = Тип("Массив") Тогда
		ТестируемыеОбъекты = Новый Массив();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка,
	|	ИдентификаторыОбъектовМетаданных.Родитель КАК Группа,
	|	ИдентификаторыОбъектовМетаданных.Имя КАК Имя,
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя КАК ПолноеИмя,
	|	ИдентификаторыОбъектовМетаданных.НоваяСсылка КАК НоваяСсылка
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ИТОГИ
	|ПО
	|	Родитель");
	
	Результат = Запрос.Выполнить();
	
	ТестОбъекты = Новый Структура();
	ТестОбъекты.Вставить("Таблица");
	ТестОбъекты.Вставить("Дерево");
	ТестОбъекты.Вставить("Массив");
	ТестОбъекты.Вставить("Список");
	ТестОбъекты.Вставить("Структура");
	ТестОбъекты.Вставить("Соответствие");

	ТестОбъекты.Таблица = Результат.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	ТестОбъекты.Таблица.Колонки.Добавить("ДвоичныеДанные", Новый ОписаниеТипов("ДвоичныеДанные"));
	ТестОбъекты.Таблица.Колонки.Добавить("ХранилищеЗначения", Новый ОписаниеТипов("ХранилищеЗначения"));
	ТестОбъекты.Таблица.Колонки.Добавить("Картинка", Новый ОписаниеТипов("Картинка"));
	
	Для Каждого ТекСтрока Из ТестОбъекты.Таблица Цикл
		ТекСтрока.Картинка = БиблиотекаКартинок.ОформлениеФлажок;
		ТекСтрока.ДвоичныеДанные = ТекСтрока.Картинка.ПолучитьДвоичныеДанные();
		ТекСтрока.ХранилищеЗначения = Новый ХранилищеЗначения(ТекСтрока.ДвоичныеДанные, Новый СжатиеДанных(1));
	КонецЦикла;
	
	ТестОбъекты.Дерево = Результат.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТестОбъекты.Массив = ТестОбъекты.Таблица.ВыгрузитьКолонку("Ссылка");
	
	ТестОбъекты.Список = Новый СписокЗначений();
	
	ТестОбъекты.Структура = Новый Структура();
	
	ТестОбъекты.Соответствие = Новый Соответствие();
	
	Для Каждого ТекСтрока Из ТестОбъекты.Таблица Цикл
		Если НЕ (ЗначениеЗаполнено(ТекСтрока.Имя) И ЗначениеЗаполнено(ТекСтрока.Ссылка)) Тогда
			Продолжить;
		КонецЕсли;
		Если Лев(ТекСтрока.Имя, 1) = "?" Тогда
			Продолжить;
		КонецЕсли;
		ТестОбъекты.Список.Добавить(ТекСтрока.Ссылка, ТекСтрока.ПолноеИмя, Истина, ТекСтрока.Картинка);
		ТестОбъекты.Структура.Вставить(ТекСтрока.Имя, ТекСтрока.Ссылка);
		ТестОбъекты.Соответствие.Вставить(ТекСтрока.ПолноеИмя, ТекСтрока.Ссылка);
	КонецЦикла;

	Библиотека = ПреобразованиеДанных();
	
	Для Каждого ТекЭлемент Из ТестОбъекты Цикл
		АдресДанных = ПоместитьВоВременноеХранилище(ТекЭлемент.Значение, ЭтотОбъект.УникальныйИдентификатор);
		ОписаниеОбъекта = ОписаниеТестируемогоОбъекта(ТипыТестируемыхОбъектов().Коллекция, ТекЭлемент.Ключ, АдресДанных);
		ТестируемыеОбъекты.Добавить(ОписаниеОбъекта);
	КонецЦикла;

КонецПроцедуры // ДобавитьКоллекцииДляТестирования()

// Процедура - добавляет макеты СКД для тестирования
//
// Параметры:
//  ТестируемыеОбъекты    - Массив из Структура    - (возвр.) описание макета СКД для тестирования
//                                                   (см. ОписаниеТестируемогоОбъекта())
//
&НаСервере
Процедура ДобавитьОтчетыДляТестирования(ТестируемыеОбъекты)
	
	Если НЕ ТипЗнч(ТестируемыеОбъекты) = Тип("Массив") Тогда
		ТестируемыеОбъекты = Новый Массив();
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из ТестируемыеОтчеты Цикл
		
		Если НЕ ТекЭлемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ТекОтчет = Метаданные.Отчеты[ТекЭлемент.Значение];
		
		Для Каждого ТекМакет Из ТекОтчет.Макеты Цикл
		
			ТестируемыйОбъект = Отчеты[ТекОтчет.Имя].ПолучитьМакет(ТекМакет.Имя);
			Если НЕ ТипЗнч(ТестируемыйОбъект) = Тип("СхемаКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			
			ОписаниеОбъекта = ОписаниеТестируемогоОбъекта(ТипыТестируемыхОбъектов().СКД, ТекОтчет.Имя, ТекМакет.Имя);
			ТестируемыеОбъекты.Добавить(ОписаниеОбъекта);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ДобавитьОтчетыДляТестирования()

// Функция - получает описание объекта для тестирования
//
// Параметры:
//   Ссылка             - ЛюбаяСсылка      - тип объекта описание тестируемого объекта
//   ПравилаВыгрузки    - Структура        - описание обработчика при выгрузке объекта
//
// Возвращаемое значение:
//   Структура                              - описание ссылки на тестируемый объект
//     *Ссылка             - ЛюбаяСсылка      - тип объекта описание тестируемого объекта
//     *ПравилаВыгрузки    - Структура        - описание обработчика при выгрузке объекта
//
&НаСервере
Функция ОписаниеСсылки(Ссылка, ПравилаВыгрузки)

	Возврат Новый Структура("Ссылка, ПравилаВыгрузки", Ссылка, ПравилаВыгрузки);

КонецФункции // ОписаниеСсылки()

// Функция - получает описание объекта для тестирования
//
// Параметры:
//   ТипОбъекта    - Строка       - тип объекта описание тестируемого объекта
//   Имя           - Строка       - описание тестируемого объекта
//   Данные        - Структура    - описание тестируемого объекта
//
// Возвращаемое значение:
//  Структура      - описание тестируемого объекта
//    *ТипОбъекта    - Строка       - тип объекта описание тестируемого объекта
//    *Имя           - Строка       - описание тестируемого объекта
//    *Данные        - Структура    - описание тестируемого объекта
//
&НаСервере
Функция ОписаниеТестируемогоОбъекта(ТипОбъекта, Имя, Данные)

	Возврат Новый Структура("Тип, Имя, Данные", ТипОбъекта, Имя, Данные);

КонецФункции // ОписаниеТестируемогоОбъекта()

// Процедура - выполняет тесты сериализации/десериализации ссылочных объектов
//
// Параметры:
//  ТестОбъект      - Структура                - описание тестируемого объекта (см. ОписаниеТестируемогоОбъекта())
//  АдресаФайлов    - Соответствие из Строка   - (возвр.) список файлов-результатов для сохранения
//  Ошибки          - Соответствие из Строка   - (возвр.) список ошибок сериализации/десериализации
//
&НаСервере
Процедура ТестОбъекта(Знач ТестОбъект, АдресаФайлов = Неопределено, Ошибки = Неопределено)

	Если НЕ ТипЗнч(АдресаФайлов) = Тип("Соответствие") Тогда
		АдресаФайлов = Новый Соответствие();
	КонецЕсли;
	
	Если НЕ ТипЗнч(Ошибки) = Тип("Соответствие") Тогда
		Ошибки = Новый Соответствие();
	КонецЕсли;

	Библиотека = ПреобразованиеДанных();
	Библиотека.УстановитьСпособОбработкиБитыхСсылок(Библиотека.СпособыОбработкиБитыхСсылок().Сохранять);
	
	Для Каждого ТекПравило Из ТестОбъект.Данные.ПравилаВыгрузки Цикл
		Библиотека.ДобавитьПравилоВыгрузкиТипа(ТекПравило.ТипИсточника, ТекПравило.ФункцияДополнения, ЭтотОбъект);
	КонецЦикла;
	
	ТестСсылка = ТестОбъект.Данные.Ссылка;
	МетаПолноеИмя = ТестСсылка.Метаданные().ПолноеИмя();
	УИД = СокрЛП(ТестСсылка.УникальныйИдентификатор());
	ИмяОбъекта = СтрШаблон("%1.%2", МетаПолноеИмя, УИД);

	Попытка
		Представление = Библиотека.ЗначениеВСтруктуру(ТестСсылка.ПолучитьОбъект());
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка сериализации объекта ""%1 (%2: %3)"": %4%5",
		                        ТестСсылка,
		                        МетаПолноеИмя,
		                        УИД,
		                        Символы.ПС,
		                        ТекстОшибки);
		Ошибки.Вставить(ИмяОбъекта, ТекстОшибки);
		Возврат;
	КонецПопытки;

	ТекстОбъекта1 = Библиотека.ЗаписатьОписаниеОбъектаВJSON(Представление);
	Представление = Библиотека.ПрочитатьОписаниеОбъектаИзJSON(ТекстОбъекта1);
	Попытка
		СозданныйОбъект = Библиотека.ЗначениеИзСтруктуры(Представление);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка создания объекта ""%1 (%2: %3)"": %4%5",
		                        ТестСсылка,
		                        МетаПолноеИмя,
		                        УИД,
		                        Символы.ПС,
		                        ТекстОшибки);
		Ошибки.Вставить(ИмяОбъекта, ТекстОшибки);
	КонецПопытки;
	
	Если ВыгрузитьРезультатыТеста Тогда
		Представление = Библиотека.ЗначениеВСтруктуру(СозданныйОбъект);
		ТекстОбъекта2 = Библиотека.ЗаписатьОписаниеОбъектаВJSON(Представление);
		
		Хранилище = Новый Структура("Первый, Второй",
		                            ПоместитьВоВременноеХранилище(ТекстОбъекта1, ЭтотОбъект.УникальныйИдентификатор),
		                            ПоместитьВоВременноеХранилище(ТекстОбъекта2, ЭтотОбъект.УникальныйИдентификатор));
		АдресаФайлов.Вставить(ИмяОбъекта, Хранилище);
	КонецЕсли;
		
КонецПроцедуры // ТестОбъекта()

// Процедура - выполняет тесты сериализации/десериализации наборов записей регистра
//
// Параметры:
//  ТестРегистр    - Структура                - описание тестируемого набора записей (см. ОписаниеТестируемогоОбъекта())
//  АдресаФайлов   - Соответствие из Строка   - (возвр.) список файлов-результатов для сохранения
//  Ошибки         - Соответствие из Строка   - (возвр.) список ошибок сериализации/десериализации
//
&НаСервере
Процедура ТестРегистра(Знач ТестРегистр, АдресаФайлов = Неопределено, Ошибки = Неопределено)

	Если НЕ ТипЗнч(АдресаФайлов) = Тип("Соответствие") Тогда
		АдресаФайлов = Новый Соответствие();
	КонецЕсли;
	
	Если НЕ ТипЗнч(Ошибки) = Тип("Соответствие") Тогда
		Ошибки = Новый Соответствие();
	КонецЕсли;

	Библиотека = ПреобразованиеДанных();
	Библиотека.УстановитьСпособОбработкиБитыхСсылок(Библиотека.СпособыОбработкиБитыхСсылок().Сохранять);
	
	Если ТестРегистр.Данные = Неопределено Тогда
		УИД = "БезОтбора";
	ИначеЕсли ТестРегистр.Данные.Свойство("Регистратор") Тогда
		УИД = СокрЛП(ТестРегистр.Данные.Регистратор.УникальныйИдентификатор());
	Иначе
		Хэш = Новый ХешированиеДанных(ХешФункция.MD5);
		Хэш.Добавить(ЗначениеВСтрокуВнутр(ТестРегистр.Данные));
		УИД = Base64Строка(Хэш.ХешСумма);
		УИД = КодироватьСтроку(УИД, СпособКодированияСтроки.КодировкаURL);
		УИД = СтрЗаменить(УИД, "%", "");
	КонецЕсли;

	ИмяОбъекта = СтрШаблон("%1.%2", ТестРегистр.Имя, УИД);

	НаборЗаписей = НаборЗаписейРегистра(ТестРегистр.Имя, ТестРегистр.Данные);
	Если НаборЗаписей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Представление = Библиотека.ЗначениеВСтруктуру(НаборЗаписей);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка сериализации набора записей регистра ""%1 (%2)"": %3%4",
		                        ТестРегистр.Имя,
		                        УИД,
		                        Символы.ПС,
		                        ТекстОшибки);
		Ошибки.Вставить(ИмяОбъекта, ТекстОшибки);
		Возврат;
	КонецПопытки;

	ТекстОбъекта1 = Библиотека.ЗаписатьОписаниеОбъектаВJSON(Представление);
	Представление = Библиотека.ПрочитатьОписаниеОбъектаИзJSON(ТекстОбъекта1);
	Попытка
		СозданныйОбъект = Библиотека.ЗначениеИзСтруктуры(Представление);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка создания набора записей регистра ""%1"" (%2): %3%4",
		                        ТестРегистр.Имя,
		                        УИД,
		                        Символы.ПС,
		                        ТекстОшибки);
		Ошибки.Вставить(ИмяОбъекта, ТекстОшибки);
	КонецПопытки;
	
	Если ВыгрузитьРезультатыТеста Тогда
		Представление = Библиотека.ЗначениеВСтруктуру(СозданныйОбъект);
		ТекстОбъекта2 = Библиотека.ЗаписатьОписаниеОбъектаВJSON(Представление);
		
		Хранилище = Новый Структура("Первый, Второй",
		                            ПоместитьВоВременноеХранилище(ТекстОбъекта1, ЭтотОбъект.УникальныйИдентификатор),
		                            ПоместитьВоВременноеХранилище(ТекстОбъекта2, ЭтотОбъект.УникальныйИдентификатор));
		АдресаФайлов.Вставить(ИмяОбъекта, Хранилище);
	КонецЕсли;

КонецПроцедуры // ТестРегистра()

// Функция - получает набор записей регистра по переданным имени и отбору
//
// Параметры:
//  ПолноеИмя         - Строка            - полное имя регистра (например: РегистрНакопления.Продажи)
//  Отбор             - Структура           - значения отбора регистра
//    *Регистратор      - ДокументСсылка      - для регистров, подчиненных регистратору
//    *Период           - Дата                - для периодических регистров сведений, не подчиненных регистратору
//    *_Измерение_      - Произвольный        - для регистров сведений, не подчиненных регистратору
//
&НаСервере
Функция НаборЗаписейРегистра(ПолноеИмя, Отбор)

	НаборЗаписей = Неопределено;
	
	ЧастиИмени = СтрРазделить(ПолноеИмя, ".");
	
	Если ЧастиИмени[0] = "РегистрСведений" Тогда
		НаборЗаписей = РегистрыСведений[ЧастиИмени[1]].СоздатьНаборЗаписей();
	ИначеЕсли ЧастиИмени[0] = "РегистрНакопления" Тогда
		НаборЗаписей = РегистрыНакопления[ЧастиИмени[1]].СоздатьНаборЗаписей();
	ИначеЕсли ЧастиИмени[0] = "РегистрБухгалтерии" Тогда
		НаборЗаписей = РегистрыБухгалтерии[ЧастиИмени[1]].СоздатьНаборЗаписей();
	ИначеЕсли ЧастиИмени[0] = "РегистрРасчета" Тогда
		НаборЗаписей = РегистрыРасчета[ЧастиИмени[1]].СоздатьНаборЗаписей();
	Иначе
		НаборЗаписей = Неопределено;
	КонецЕсли;
	
	Если НаборЗаписей = Неопределено Тогда
		Возврат НаборЗаписей;
	КонецЕсли;
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Для Каждого ТекЭлемент Из Отбор Цикл
			НаборЗаписей.Отбор[ТекЭлемент.Ключ].Установить(ТекЭлемент.Значение);
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей;
	
КонецФункции // НаборЗаписейРегистра()

// Процедура - выполняет тесты сериализации/десериализации коллекций
//
// Параметры:
//  ТестКоллекция  - Структура                - описание тестируемой коллекции (см. ОписаниеТестируемогоОбъекта())
//  АдресаФайлов   - Соответствие из Строка   - (возвр.) список файлов-результатов для сохранения
//  Ошибки         - Соответствие из Строка   - (возвр.) список ошибок сериализации/десериализации
//
&НаСервере
Процедура ТестКоллекции(Знач ТестКоллекция, АдресаФайлов = Неопределено, Ошибки = Неопределено)

	Если НЕ ТипЗнч(АдресаФайлов) = Тип("Соответствие") Тогда
		АдресаФайлов = Новый Соответствие();
	КонецЕсли;
	
	Если НЕ ТипЗнч(Ошибки) = Тип("Соответствие") Тогда
		Ошибки = Новый Соответствие();
	КонецЕсли;

	Библиотека = ПреобразованиеДанных();
	Библиотека.УстановитьСпособОбработкиБитыхСсылок(Библиотека.СпособыОбработкиБитыхСсылок().Сохранять);
	
	Данные = ПолучитьИзВременногоХранилища(ТестКоллекция.Данные);
	Попытка
		Представление = Библиотека.ЗначениеВСтруктуру(Данные);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка сериализации коллекции ""%1"":%2%3",
		                        ТестКоллекция.Имя,
		                        Символы.ПС,
		                        ТекстОшибки);
		Ошибки.Вставить(ТестКоллекция.Имя, ТекстОшибки);
		Возврат;
	КонецПопытки;

	ТекстОбъекта1 = Библиотека.ЗаписатьОписаниеОбъектаВJSON(Представление);
	Представление = Библиотека.ПрочитатьОписаниеОбъектаИзJSON(ТекстОбъекта1);
	Попытка
		СозданнаяКоллекция = Библиотека.ЗначениеИзСтруктуры(Представление);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка десериализации коллекции ""%1"":%2%3",
		                        ТестКоллекция.Имя,
		                        Символы.ПС,
		                        ТекстОшибки);
		Ошибки.Вставить(ТестКоллекция.Имя, ТекстОшибки);
	КонецПопытки;

	Если ВыгрузитьРезультатыТеста Тогда
		Представление = Библиотека.ЗначениеВСтруктуру(СозданнаяКоллекция);
		ТекстОбъекта2 = Библиотека.ЗаписатьОписаниеОбъектаВJSON(Представление);
		
		Хранилище = Новый Структура("Первый, Второй",
		                            ПоместитьВоВременноеХранилище(ТекстОбъекта1, ЭтотОбъект.УникальныйИдентификатор),
		                            ПоместитьВоВременноеХранилище(ТекстОбъекта2, ЭтотОбъект.УникальныйИдентификатор));
		АдресаФайлов.Вставить(ТестКоллекция.Имя, Хранилище);
	КонецЕсли;

КонецПроцедуры // ТестКоллекции()

// Процедура - выполняет тесты сериализации/десериализации макетов СКД
//
// Параметры:
//  ТестМакет      - Структура                - описание тестируемого макета СКД (см. ОписаниеТестируемогоОбъекта())
//  АдресаФайлов   - Соответствие из Строка   - (возвр.) список файлов-результатов для сохранения
//  Ошибки         - Соответствие из Строка   - (возвр.) список ошибок сериализации/десериализации
//
&НаСервере
Процедура ТестСКД(Знач ТестМакет, АдресаФайлов = Неопределено, Ошибки = Неопределено)

	Если НЕ ТипЗнч(АдресаФайлов) = Тип("Соответствие") Тогда
		АдресаФайлов = Новый Соответствие();
	КонецЕсли;
	
	Если НЕ ТипЗнч(Ошибки) = Тип("Соответствие") Тогда
		Ошибки = Новый Соответствие();
	КонецЕсли;

	Библиотека = ПреобразованиеДанных();
	Библиотека.УстановитьСпособОбработкиБитыхСсылок(Библиотека.СпособыОбработкиБитыхСсылок().Сохранять);
	
	ТестируемыйОбъект = Отчеты[ТестМакет.Имя].ПолучитьМакет(ТестМакет.Данные);
	Если НЕ ТипЗнч(ТестируемыйОбъект) = Тип("СхемаКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Представление = Библиотека.ЗначениеВСтруктуру(ТестируемыйОбъект);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка сериализации СКД макета ""%1"" отчета ""%2"":%3%4",
		                        ТестМакет.Данные,
		                        ТестМакет.Имя,
		                        Символы.ПС,
		                        ТекстОшибки);
		Ошибки.Вставить(СтрШаблон("%1.%2", ТестМакет.Имя, ТестМакет.Данные), ТекстОшибки);
		Возврат;
	КонецПопытки;

	ТекстОбъекта1 = Библиотека.ЗаписатьОписаниеОбъектаВJSON(Представление);
	Представление = Библиотека.ПрочитатьОписаниеОбъектаИзJSON(ТекстОбъекта1);
	Попытка
		СозданнаяСКД = Библиотека.ЗначениеИзСтруктуры(Представление);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка десериализации СКД макета ""%1"" отчета ""%2"":%3%4",
		                        ТестМакет.Данные,
		                        ТестМакет.Имя,
		                        Символы.ПС,
		                        ТекстОшибки);
		Ошибки.Вставить(СтрШаблон("%1.%2", ТестМакет.Имя, ТестМакет.Данные), ТекстОшибки);
	КонецПопытки;

	Если ВыгрузитьРезультатыТеста Тогда
		Представление = Библиотека.ЗначениеВСтруктуру(СозданнаяСКД);
		ТекстОбъекта2 = Библиотека.ЗаписатьОписаниеОбъектаВJSON(Представление);
		
		Хранилище = Новый Структура("Первый, Второй",
		                            ПоместитьВоВременноеХранилище(ТекстОбъекта1, ЭтотОбъект.УникальныйИдентификатор),
		                            ПоместитьВоВременноеХранилище(ТекстОбъекта2, ЭтотОбъект.УникальныйИдентификатор));
		АдресаФайлов.Вставить(СтрШаблон("Отчет.%1.%2", ТестМакет.Имя, ТестМакет.Данные), Хранилище);
	КонецЕсли;

КонецПроцедуры // ТестСКД()

// Процедура - проверяет возможность записи структуры объекта в JSON-строку
// и выполняет поиск проблемного узла
//
// Параметры:
//  СтруктураОбъекта    - Структура                 - произвольная структура описания объекта
//                        Массив из Структура
//  ИмяВИерархии        - Строка                    - имя узла в структуре объекта
//  Ошибки              - Соответствие из Строка    - (возвр.) список ошибок преобразования
//
&НаСервере
Процедура ПроверитьСовместимостьСJSON(СтруктураОбъекта, Знач ИмяВИерархии = "", Ошибки = Неопределено)

	Если НЕ ТипЗнч(Ошибки) = Тип("Соответствие") Тогда
		Ошибки = Новый Соответствие();
	КонецЕсли;

	Библиотека = ПреобразованиеДанных();

	Попытка
		// @skip-warning
		// BSLLS:UnusedLocalVariable-off
		// sonar:UnusedLocalVariable-off
		ТекстОбъекта = Библиотека.ЗаписатьОписаниеОбъектаВJSON(СтруктураОбъекта);
		// BSLLS:UnusedLocalVariable-on
		// sonar:UnusedLocalVariable-on
	Исключение
		ТекстОшибки = СтрШаблон("Ошибка преобразования в JSON ""%1"" (%2): %3%4",
		                        ИмяВИерархии,
		                        СокрЛП(ТипЗнч(СтруктураОбъекта)),
		                        Символы.ПС,
		                        ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Ошибки.Вставить(ИмяВИерархии, ТекстОшибки);
	КонецПопытки;

	Если ТипЗнч(СтруктураОбъекта) = Тип("Структура") ИЛИ  ТипЗнч(СтруктураОбъекта) = Тип("Соответствие") Тогда
		Для Каждого ТекЭлемент Из СтруктураОбъекта Цикл
			ПроверитьСовместимостьСJSON(ТекЭлемент.Значение, СтрШаблон("%1.%2", ИмяВИерархии, ТекЭлемент.Ключ), Ошибки);
		КонецЦикла;	
	ИначеЕсли ТипЗнч(СтруктураОбъекта) = Тип("Массив") Тогда
		Для й = 0 По СтруктураОбъекта.ВГраница() Цикл
			ПроверитьСовместимостьСJSON(СтруктураОбъекта[й], СтрШаблон("%1[%2]", ИмяВИерархии, Формат(й, "ЧН=; ЧГ=")), Ошибки);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСовместимостьСJSON()

// Процедура - читает настройки из JSON-строки по указанному адресу и устанавливает значения реквизитов формы
//
// Параметры:
//  АдресНастроек    - Строка    - адрес хранилища настроек
//
&НаСервере
Процедура ПрочитатьНастройкиНаСервере(Знач АдресНастроек)
	
	ДанныеНастроек = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	ЧтениеНастроек = Новый ЧтениеJSON();

	ЧтениеНастроек.ОткрытьПоток(ДанныеНастроек.ОткрытьПотокДляЧтения());
	
	Настройки = ПрочитатьJSON(ЧтениеНастроек, Ложь, , ФорматДатыJSON.ISO);
	
	ПроверитьСвойства(Настройки, "ПутьКБиблиотеке", "Отсутствуют обязательные настройки: %1");

	Если ЗначениеЗаполнено(Настройки.ПутьКБиблиотеке) Тогда
		ЭтотОбъект.ПутьКБиблиотеке = СтрЗаменить(Настройки.ПутьКБиблиотеке, "$thisRoot\", КаталогТекущейОбработки());
	Иначе
		ЭтотОбъект.ПутьКБиблиотеке = СтрШаблон("%1%2",
		                                       КаталогТекущейОбработки(),
		                                       ИмяФайлаОбработкиПреобразованияДанных());
	КонецЕсли;

	ПрочитатьПараметрНастроек(Настройки, "Отладка");
	ПрочитатьПараметрНастроек(Настройки, "КоличествоВВыборке");
	ПрочитатьПараметрНастроек(Настройки, "РазмерПорции");
	ПрочитатьПараметрНастроек(Настройки, "ТестироватьОбъекты");
	ПрочитатьПараметрНастроек(Настройки, "ТестироватьРегистры");
	ПрочитатьПараметрНастроек(Настройки, "ТестироватьКоллекции");
	
	Если Настройки.Свойство("ТестируемыеОтчеты") Тогда
		Для Каждого ТекОтчет Из Настройки.ТестируемыеОтчеты Цикл
			Если ВРег(ТекОтчет) = "ВСЕ" ИЛИ ВРег(ТекОтчет) = "ALL" Тогда
				Для Каждого ТекЭлемент Из ТестируемыеОтчеты Цикл
					ТекЭлемент.Пометка = Истина;
				КонецЦикла;
				Прервать;
			КонецЕсли;
			ТекЭлемент = ТестируемыеОтчеты.НайтиПоЗначению(ВРег(ТекЭлемент));
			Если НЕ ТекЭлемент = Неопределено Тогда
				ТекЭлемент.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Настройки.Свойство("КаталогВыгрузки") Тогда
		КаталогВыгрузки = Настройки.КаталогВыгрузки;
		ЭтотОбъект.ВыгрузитьРезультатыТеста = ЗначениеЗаполнено(КаталогВыгрузки);
	КонецЕсли;

КонецПроцедуры // ПрочитатьНастройкиНаСервере()

// Процедура - читает указанный параметр из настроек и устанавливает значение реквизита формы
//
// Параметры:
//  Настройки    - Структура    - настройки для чтения
//  Параметр     - Строка       - имя параметра настроек
//
&НаСервере
Процедура ПрочитатьПараметрНастроек(Знач Настройки, Знач Параметр)

	Если Настройки.Свойство(Параметр) Тогда
		ЭтотОбъект[Параметр] = Настройки[Параметр];
	КонецЕсли;

КонецПроцедуры // ПрочитатьПараметрНастроек()

// Процедура - читает настройки из JSON-файла и устанавливает значения реквизитов формы
//
// Параметры:
//  Путь     - Строка     - путь к JSON-файлу настроек
//
&НаКлиенте
Процедура ПрочитатьНастройки(Знач Путь = "")
	
	ТекстОшибки = СтрШаблон("Некорректно указан файл настроек ""%1"", тип ""%%1"", ожидается тип %%2!", СокрЛП(Путь));
	ПроверитьДопустимостьТипа(Путь, "Строка, Файл", ТекстОшибки);
	
	Если ЗначениеЗаполнено(Путь) Тогда
		ПутьКФайлуНастроек = Путь;
	Иначе
		ПутьКФайлуНастроек = КаталогТекущейОбработки() + "settings.json";
	КонецЕсли;
	
	Если ТипЗнч(ПутьКФайлуНастроек) = Тип("Файл") Тогда
		ПутьКФайлуНастроек = ПутьКФайлуНастроек.ПолноеИмя;
	КонецЕсли;
	
	АдресНастроек = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлуНастроек),
	                                              ЭтотОбъект.УникальныйИдентификатор);

	Попытка
		ПрочитатьНастройкиНаСервере(АдресНастроек);
	Исключение
		ВызватьИсключение СтрШаблон("Ошибка чтения файла настроек ""%1"":%2%3",
		                            ПутьКФайлуНастроек,
		                            Символы.ПС,
		                            ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры // ПрочитатьНастройки()

// Процедура - добавляет в описание ссылки наименование
//
// Параметры:
//  ОписаниеЗначения       - Структура      - Структура значения для дополнения
//  Значение               - Произвольный   - Преобразуемое значение
//
//@skip-check export-method-in-command-form-module
&НаСервере
Процедура ДобавитьНаименованиеОбъекта(ОписаниеЗначения, Значение) Экспорт
	
	ОписаниеЗначения.Вставить("Наименование", СокрЛП(Значение));
	
КонецПроцедуры // ДобавитьНаименованиеОбъекта()

// Функция - проверяет тип значения на соответствие допустимым типам
//
// Параметры:
//  Значение             - Произвольный                 - проверяемое значение
//  ДопустимыеТипы       - Строка, Массив из Строка     - список допустимых типов
//  ШаблонТекстаОшибки   - Строка                       - шаблон строки сообщения об ошибке
//                                                        ("Некорректный тип значения ""%1"" ожидается тип %2")
// 
// Возвращаемое значение:
//	Булево    - Истина - проверка прошла успешно
//
&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьДопустимостьТипа(Знач Значение, Знач ДопустимыеТипы, Знач ШаблонТекстаОшибки = "")
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗнч(ДопустимыеТипы) = Тип("Строка") Тогда
		МассивДопустимыхТипов = СтрРазделить(ДопустимыеТипы, ",");
	ИначеЕсли ТипЗнч(ДопустимыеТипы) = Тип("Массив") Тогда
		МассивДопустимыхТипов = ДопустимыеТипы;
	Иначе
		ВызватьИсключение СтрШаблон("Некорректно указан список допустимых типов, тип ""%1"" ожидается тип %2!",
		                            Тип(ДопустимыеТипы),
									"""Строка"" или ""Массив""");
	КонецЕсли;
	
	Типы = Новый Соответствие();
	
	СтрокаДопустимыхТипов = "";
	
	Для Каждого ТекТип Из МассивДопустимыхТипов Цикл
		ВремТип = ?(ТипЗнч(ТекТип) = Тип("Строка"), Тип(СокрЛП(ТекТип)), ТекТип);
		Типы.Вставить(ВремТип, СокрЛП(ТекТип));
		Если НЕ СтрокаДопустимыхТипов = "" Тогда
			СтрокаДопустимыхТипов = СтрокаДопустимыхТипов +
				?(МассивДопустимыхТипов.Найти(ТекТип) = МассивДопустимыхТипов.ВГраница(), " или ", ", ");
		КонецЕсли;
	КонецЦикла;
	
	Если ШаблонТекстаОшибки = "" Тогда
		ШаблонТекстаОшибки = "Некорректный тип значения ""%1"" ожидается тип %2!";
	КонецЕсли;
	
	Если Типы[ТипЗначения] = Неопределено Тогда
		ВызватьИсключение СтрШаблон(ШаблонТекстаОшибки, СокрЛП(ТипЗначения), СтрокаДопустимыхТипов);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПроверитьДопустимостьТипа()

// Функция - Проверить свойства
//
// Параметры:
//  ПроверяемаяСтруктура     - Структура                 - проверяемая структура
//  ОбязательныеСвойства     - Строка, Массив из Строка  - список обязательных свойств
//  ШаблонТекстаОшибки       - Строка                    - шаблон строки сообщения об ошибке
//                                                         ("Отсутствуют обязательные свойства: %1")
// 
// Возвращаемое значение:
//	Булево       - Истина - проверка прошла успешно
//
&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьСвойства(Знач ПроверяемаяСтруктура, Знач ОбязательныеСвойства, Знач ШаблонТекстаОшибки = "")

	ПроверитьДопустимостьТипа(ОбязательныеСвойства,
	                          "Строка, Массив",
	                          "Некорректно указан список обязательных свойств, тип ""%1"", ожидается тип %2!");
	
	Если ТипЗнч(ОбязательныеСвойства) = Тип("Строка") Тогда
		МассивСвойств = СтрРазделить(ОбязательныеСвойства, ",");
	ИначеЕсли ТипЗнч(ОбязательныеСвойства) = Тип("Массив") Тогда
		МассивСвойств = ОбязательныеСвойства;
	Иначе
		МассивСвойств = Новый Массив();
	КонецЕсли;
	
	СтрокаСвойств = "";
	
	Для Каждого ТекСвойство Из МассивСвойств Цикл
		
		Если ПроверяемаяСтруктура.Свойство(СокрЛП(ТекСвойство)) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаСвойств = СтрокаСвойств
		                      + ?(СтрокаСвойств = "", Символы.ПС, ", " + Символы.ПС)
		                      + """" + СокрЛП(ТекСвойство) + """";
	КонецЦикла;
	
	Если ШаблонТекстаОшибки = "" Тогда
		ШаблонТекстаОшибки = "Отсутствуют обязательные свойства: %1";
	КонецЕсли;
	
	Если НЕ СтрокаСвойств = "" Тогда
		ВызватьИсключение СтрШаблон(ШаблонТекстаОшибки, СтрокаСвойств);
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ПроверитьСвойства()

// Функция проверяет существование каталога по указанному пути
// и при необходимости создает отсутствующие каталоги
// 
// Параметры:
// 	Путь       - Строка    - путь к каталогу
// 	Очищать    - Булево    - Истина - каталог будет очищен
//
// Возвращаемое значение:
// 	Булево - Истина - указанный путь существует (был успешно создан)
//           Ложь - в противном случае
//
&НаКлиенте
Функция ОбеспечитьКаталог(Знач Путь, Очищать = Истина)
	
	ВремФайл = Новый Файл(Путь);
	
	Если НЕ ВремФайл.Существует() Тогда
		Если ОбеспечитьКаталог(Сред(ВремФайл.Путь, 1, СтрДлина(ВремФайл.Путь) - 1), Ложь) Тогда
			СоздатьКаталог(Путь);
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ВремФайл.ЭтоКаталог() Тогда
		ВызватьИсключение СтрШаблон("По указанному пути ""%1"" не удалось создать каталог", Путь);
	КонецЕсли;
	
	Если Очищать Тогда
		УдалитьФайлы(ВремФайл.ПолноеИмя, ПолучитьМаскуВсеФайлы());
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ОбеспечитьКаталог()

// Процедура - выодит сообщение пользователю
// 
// Параметры:
// 	ТекстСообщения     - Строка - Текст сообщения
// 	ВызыватьИсключение - Булево - Истина - будет вызвано исключение
//
&НаСервере
Процедура ПоказатьСообщение(Знач ТекстСообщения, Знач ВызыватьИсключение = Ложь)
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.ИдентификаторНазначения = ЭтотОбъект.УникальныйИдентификатор;
	Сообщение.Текст                   = ТекстСообщения;
	Сообщение.Сообщить();
	
	Если ВызыватьИсключение Тогда
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры // ПоказатьСообщение()

// Функция - возвращает путь к каталогу текущей обработки
// 
// Возвращаемое значение:
//	Строка       - путь к каталогу текущей обработки
//
&НаСервере
Функция КаталогТекущейОбработки()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ФайлЭтойОбработки = Новый Файл(ОбработкаОбъект.ИспользуемоеИмяФайла);
	
	Возврат ФайлЭтойОбработки.Путь;
	
КонецФункции // КаталогТекущейОбработки()

// Функция - возвращает имя обработки преобразования данных
// 
// Возвращаемое значение:
//	Строка       - имя обработки преобразования данных
//
&НаКлиентеНаСервереБезКонтекста
Функция ИмяОбработкиПреобразованияДанных()
	
	Возврат "ПреобразованиеДанных";
	
КонецФункции // ИмяОбработкиПреобразованияДанных()

// Функция - возвращает имя файла обработки преобразования данных
// 
// Возвращаемое значение:
//	Строка       - имя файла обработки преобразования данных
//
&НаКлиентеНаСервереБезКонтекста
Функция ИмяФайлаОбработкиПреобразованияДанных()
	
	Возврат СтрШаблон("ктв_%1.epf", ИмяОбработкиПреобразованияДанных());
	
КонецФункции // ИмяФайлаОбработкиПреобразованияДанных()

// Функция - Получает обработку сериализации значений
// 
// Возвращаемое значение:
//   ВнешняяОбработка - обработка преобразования данных
//
&НаСервере
Функция ПреобразованиеДанных()
	
	ОписаниеЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий();
	ОписаниеЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;

	Если Отладка Тогда
		Библиотека = ВнешниеОбработки.Создать(ПутьКБиблиотеке, Ложь, ОписаниеЗащиты);
	ИначеЕсли Библиотека = Неопределено Тогда
		ВнешниеОбработки.Подключить(АдресБиблиотеки, ИмяОбработкиПреобразованияДанных(), Ложь, ОписаниеЗащиты);
		Библиотека = ВнешниеОбработки.Создать(ИмяОбработкиПреобразованияДанных());
	Иначе
		Возврат Библиотека;
	КонецЕсли;
	 
	Возврат Библиотека; 

КонецФункции // ПреобразованиеДанных()

// Функция - возвращает версию библиотеки преобразования данных
// 
// Возвращаемое значение:
// 	Строка - версия библиотеки преобразования данных
//
&НаСервере
Функция ВерсияБиблиотеки()
	
	Возврат ПреобразованиеДанных().Версия();
	
КонецФункции // ВерсияБиблиотеки()

#КонецОбласти // СлужебныеПроцедурыИФункции
