// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/SerLib1C/
// ----------------------------------------------------------

// BSLLS:MagicNumber-off
// BSLLS:MagicDate-off
// BSLLS:DuplicateStringLiteral-off
// BSLLS:LatinAndCyrillicSymbolInWord-off
// BSLLS:UsingHardcodePath-off
// BSLLS:StyleElementConstructors-off
// BSLLS:NestedFunctionInParameters-off

// sonar:MagicNumber-off
// sonar:MagicDate-off
// sonar:DuplicateStringLiteral-off
// sonar:LatinAndCyrillicSymbolInWord-off
// sonar:UsingHardcodePath-off
// sonar:StyleElementConstructors-off
// sonar:NestedFunctionInParameters-off

// @skip-check module-accessibility-at-client
// @skip-check doc-comment-field-in-description-suggestion
// @skip-check server-execution-safe-mode
// @skip-check constructor-function-return-section
// @skip-check module-unused-local-variable
// @skip-check bsl-variable-name-invalid
// @skip-check method-too-many-params
// @skip-check module-unused-method

#Область ОписаниеПеременных

Перем ОбработчикиПоискаСсылок;        // - Соответствие   - ссылки на функции поиска ссылок на объекты указанного типа (см. ПолучитьОбработчикиПоискаСсылок())
Перем ОбработчикиПослеВыгрузкиТипов;  // - Соответствие   - ссылки на функции, выполняемые после выгрузки объектов указанного типа (см. ОбработчикиПослеВыгрузкиТипов())
Перем ОбработчикиПослеЗагрузкиТипов;  // - Соответствие   - ссылки на функции, выполняемые после загрузки объектов указанного типа (см. ОбработчикиПослеЗагрузкиТипов())

Перем БезопасныйРежимПД;     // - Булево         - Истина - все методы "Выполнить/Вычислить"
                             //                    будут выполняться в безопасном режиме
Перем Совместимость8_3;      // - Соответствие   - флаги совместимости с релизами 8.3

Перем КэшМетаданных;         // - Соответствие   - кэш объектов метаданных
Перем КэшОписанийТипов;      // - Соответствие   - кэш описаний типов метаданных
Перем КэшСсылок;             // - Соответствие   - кэш ссылок на обработанные объекты
Перем КэшБитыхСсылок;        // - Соответствие   - кэш ссылок на отсутствующие в базе обработанные объекты

Перем СпособОбработкиБитыхСсылок;     // - Число   - способ обработки "битых" ссылок (на отсутствующие в базе объекты)
                                      //             0 - Очищать            - будет возвращена пустая ссылка
                                      //             1 - Сохранять          - будет возвращена "битая" ссылка как есть
                                      //             2 - ВызыватьИсключение - будет вызвано исключение
                                      //             (см. СпособыОбработкиБитыхСсылок())
Перем ПреобразованиеПрикладныхТипов;  // - Булево  - Истина - прикладные типы (Объекты, Ссылки, НаборыЗаписей и т.п.)
                                      //             будут преобразованы из сериализованого представления
                                      //             Ложь - прикладные типы будут прочитаны в сериализованом виде
Перем РасширенноеПредставлениеДаты;   // - Булево  - Истина - значения типа дата будут преобразованы
                                      //             в структуру ("__Тип", "Значение", "Представление")
                                      //             Ложь - значения типа дата будут преобразованы
                                      //             в формат даты Microsoft

Перем ТипыЗначенийСКД;       // - Соответствие   - кэш типов значений СКД
Перем СистемныеПеречисления; // - Соответствие   - кэш системных перечислений
Перем КэшЦветов;             // - Структура      - кэш предопределенных цветов
Перем КэшШрифтов;            // - Структура      - кэш предопределенных шрифтов
Перем КэшРамок;              // - Структура      - кэш предопределенных рамок
Перем КэшКартинок;           // - Структура      - кэш предопределенных картинок

#КонецОбласти // ОписаниеПеременных

#Область ПрограммныйИнтерфейс

#Область ПреобразованияОбъектовОбщие

// Преобразует переданное значение в структуру, значения атомарных типов, возвращаются как есть
//
// Параметры:
//  Значение    - Произвольный    - Преобразуемое значение
//
// Возвращаемое значение:
//   Произвольный    - результат преобразования
//                     (Структура, Неопределено, Строка, Число, Дата, Булево)
//
Функция ЗначениеВСтруктуру(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ЭтоПростойТип(Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗначения = Тип("Структура") И Значение.Свойство("__Тип") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если ТипЗначения = Тип("Дата") Тогда
		Возврат ДатаВСтруктуру(Значение);
	КонецЕсли;
	
	Если ЭтоКоллекция(Значение) Тогда
		Возврат КоллекцияВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("ОписаниеТипов") Тогда
		Возврат ОписаниеТиповВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("УдалениеОбъекта") Тогда
		Возврат УдалениеОбъектаВСтруктуру(Значение);
	КонецЕсли;
	
	Если ЭтоЭлементСтиля(Значение) Тогда
		Возврат ЭлементСтиляВСтруктуру(Значение);
	КонецЕсли;
	
	Если ЭтоСистемноеПеречисление(Значение) Тогда
		Возврат ЗначениеСистемногоПеречисленияВСтруктуру(Значение);
	КонецЕсли;
	
	Если ЭтоЗначениеСКД(Значение) Тогда
		Возврат ЗначениеСКДВСтруктуру(Значение);
	КонецЕсли;
	
	Если ЭтоСсылка(Значение) Тогда
		Возврат СсылкаВСтруктуру(Значение);
	КонецЕсли;
	
	Если ЭтоОбъект(Значение) Тогда
		Возврат ОбъектВСтруктуру(Значение);
	КонецЕсли;
	
	Если ЭтоНаборЗаписейРегистра(Значение) Тогда
		Возврат НаборЗаписейРегистраВСтруктуру(Значение);
	КонецЕсли;
	
	Возврат ЗначениеНеопределенногоТипаВСтруктуру(Значение);
	
КонецФункции // ЗначениеВСтруктуру()

// Получает значение из переданного описания, значения атомарных типов, возвращаются как есть
//
// Параметры:
//  СтруктураЗначения      - Структура, Число       - Описание значение
//                           Строка, Дата, Булево
//
// Возвращаемое значение:
//   Произвольный     - результат преобразования
//
// TODO: продумать управление получением битых ссылок
//
Функция ЗначениеИзСтруктуры(СтруктураЗначения) Экспорт
	
	Если ЭтоПростойТип(СтруктураЗначения) Тогда
		Возврат СтруктураЗначения;
	КонецЕсли;
	
	ТипЗначения = СтруктураТипЗнч(СтруктураЗначения);
	
	Если ТипЗначения = Тип("Дата") Тогда
		Возврат ДатаИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ЭтоКоллекция(СтруктураЗначения) Тогда
		Возврат КоллекцияИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("ОписаниеТипов") Тогда
		Возврат ОписаниеТиповИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("УдалениеОбъекта") Тогда
		Возврат УдалениеОбъектаИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ЭтоЭлементСтиля(СтруктураЗначения) Тогда
		Возврат ЭлементСтиляИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ЭтоСистемноеПеречисление(СтруктураЗначения) Тогда
		Возврат ЗначениеСистемногоПеречисленияИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ЭтоЗначениеСКД(СтруктураЗначения) Тогда
		ОбъектСКД = Неопределено;
		ЗначениеСКДИзСтруктуры(ОбъектСКД, СтруктураЗначения);
		Возврат ОбъектСКД;
	КонецЕсли;
	
	ЭтоПрикладнойТип = ЭтоСсылка(СтруктураЗначения)
	               ИЛИ ЭтоОбъект(СтруктураЗначения)
	               ИЛИ ЭтоНаборЗаписейРегистра(СтруктураЗначения);
	
	Если НЕ ПреобразованиеПрикладныхТипов() И ЭтоПрикладнойТип Тогда
		Возврат СтруктураЗначения;
	КонецЕсли;
	
	Если ЭтоСсылка(СтруктураЗначения) Тогда
		Возврат СсылкаИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ЭтоОбъект(СтруктураЗначения) Тогда
		Возврат СоздатьОбъектИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ЭтоНаборЗаписейРегистра(СтруктураЗначения) Тогда
		Возврат СоздатьНаборЗаписейРегистраИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Возврат ЗначениеНеопределенногоТипаИзСтруктуры(СтруктураЗначения);
	
КонецФункции // ЗначениеИзСтруктуры()

// Преобразует значение ссылочного типа в структуру
//
// Параметры:
//   Объект              - Произвольный         - преобразуемый объект
//   СписокСвойств       - Строка               - список допустимых свойств
//                         Массив из Строка       (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка               - список исключаемых свойств
//                         Массив из Строка       (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Неопределено, Структура                      - результат преобразования:
//     *__Тип                   - Строка            - тип объекта
//     *Ссылка                  - Структура         - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_               - Произвольный      - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_     - Структура         - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//
Функция ОбъектВСтруктуру(Объект, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	ОписаниеВида = ОписаниеВидаОбъектов(ТипЗнч(Объект));
	
	Если ОписаниеВида = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураОбъекта = Неопределено;
	
	Если ПредставленияРавны(ОписаниеВида.Имя, "Справочник") Тогда
		СтруктураОбъекта = СправочникВСтруктуру(Объект, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "Документ") Тогда
		СтруктураОбъекта = ДокументВСтруктуру(Объект, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "ПланВидовХарактеристик") Тогда
		СтруктураОбъекта = ПланВидовХарактеристикВСтруктуру(Объект, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "ПланСчетов") Тогда
		СтруктураОбъекта = ПланСчетовВСтруктуру(Объект, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "ПланВидовРасчета") Тогда
		СтруктураОбъекта = ПланВидовРасчетаВСтруктуру(Объект, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "ПланОбмена") Тогда
		СтруктураОбъекта = ПланОбменаВСтруктуру(Объект, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "БизнесПроцесс") Тогда
		СтруктураОбъекта = БизнесПроцессВСтруктуру(Объект, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "Задача") Тогда
		СтруктураОбъекта = ЗадачаВСтруктуру(Объект, СписокСвойств, ИсключаяСвойства);
	Иначе
		ПоказатьСообщение(СтрШаблон("Неизвестный тип объекта: %1", Объект));
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ОбъектВСтруктуру()

// Находит объект (ссылочного типа) по имени предопределенных данных
// или по идентификатору и заполняет из структуры
//
// Параметры:
//   СтруктураОбъекта           - Структура              - данные для заполнения объекта
//     *Ссылка                    - Структура            - Описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_                 - Произвольный         - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_       - Структура            - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//   Создавать                  - Булево               - Истина - если объект не найден,
//                                                       будет создан новый объект (по умолчанию Ложь)
//   УстановитьСсылку           - Булево               - установить ссылку из СтруктураОбъекта
//   СписокСвойств              - Строка               - список допустимых свойств
//                                Массив из Строка       (если пустой, то допустимы все свойства)
//   ИсключаяСвойства           - Строка               - список исключаемых свойств
//                                Массив из Строка       (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Произвольный       - найденный (созданный) и заполненный объект ссылочного типа
//
Функция НайтиЗаполнитьОбъектИзСтруктуры(СтруктураОбъекта,
                                        Создавать = Ложь,
                                        УстановитьСсылку = Истина,
                                        СписокСвойств = Неопределено,
                                        ИсключаяСвойства = Неопределено) Экспорт
	
	ОписаниеВида = ОписаниеВидаОбъектов(СтруктураОбъекта);
	
	МетаОбъект = ОписаниеВида.МетаКоллекция.Найти(ОписаниеВида.ИмяТипа);
	
	ОбработчикПоискаСсылок = ОбработчикПоискаСсылок(СтруктураОбъекта.Ссылка.__Тип);
	
	ОписаниеВидаПриемника = ОписаниеВидаОбъектов(ОбработчикПоискаСсылок.ТипЗначения);
	
	МетаОбъектПриемника = КэшМетаданных()[СтрШаблон("%1.%2", ОписаниеВидаПриемника.Имя, ОписаниеВидаПриемника.ИмяТипа)];
	
	Если МетаОбъектПриемника = Неопределено Тогда
		ТекстОшибки = СтрШаблон("Не найден тип ""%1"" объекта приемника для объекта ""%2 (%3)"" типа ""%4.%5""",
		                        ОбработчикПоискаСсылок.ТипЗначения,
		                        СтруктураОбъекта.Представление,
		                        СтруктураОбъекта.Ид,
		                        ОписаниеВидаПриемника.Имя,
		                        ОписаниеВидаПриемника.ИмяТипа);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НЕ ТипЗнч(КэшСсылок) = Тип("Соответствие") Тогда
		КэшСсылок = Новый Соответствие();
	КонецЕсли;
	  
	КлючЗначения = СтрШаблон("%1#%2", СтруктураОбъекта.Ссылка.__Тип, СтруктураОбъекта.Ссылка.Ид);
	
	Ссылка = КэшСсылок.Получить(КлючЗначения); 
	Если Ссылка = Неопределено Тогда
		Ссылка = НайтиСсылку(СтруктураОбъекта.Ссылка);
	КонецЕсли;
	
	Объект = Неопределено;
	Попытка
		Объект = Ссылка.ПолучитьОбъект();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Объект не найден ""%1"":%2%3",
		                        СтруктураОбъекта.Ссылка.Представление,
		                        Символы.ПС,
		                        ТекстОшибки);
		ЗаписьЖурналаРегистрации("Преобразование данных.Получение объекта",
		                         УровеньЖурналаРегистрации.Предупреждение,
		                         Ссылка,
		                         МетаОбъект,
		                         ТекстОшибки);
	КонецПопытки;
	
	Если Объект = Неопределено И Создавать Тогда
		Если ОписаниеВида.ИмяТипа = ОписаниеВидаПриемника.ИмяТипа Тогда
			СтруктураНовогоОбъекта = СтруктураОбъекта;
		Иначе
			СтруктураНовогоОбъекта = СкопироватьСтруктуру(СтруктураОбъекта);
			СтруктураНовогоОбъекта.__Тип = СтрШаблон("%1Объект.%2",
			                                         ОписаниеВидаПриемника.Имя,
			                                         ОписаниеВидаПриемника.ИмяТипа);
			СтруктураНовогоОбъекта.Ссылка.__Тип = СтрШаблон("%1Ссылка.%2",
			                                                ОписаниеВидаПриемника.Имя,
			                                                ОписаниеВидаПриемника.ИмяТипа);
		КонецЕсли;
		Объект = СоздатьОбъектИзСтруктуры(СтруктураОбъекта,
		                                  УстановитьСсылку,
		                                  СписокСвойств,
		                                  ИсключаяСвойства);
	ИначеЕсли НЕ Объект = Неопределено Тогда
		ОбъектИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции // НайтиЗаполнитьОбъектИзСтруктуры()

// Обертка для совместимости с предыдущими версиями (см. ОбъектИзСтруктуры())
//
Процедура ЗаполнитьОбъектИзСтруктуры(Объект,
                                     СтруктураОбъекта,
                                     СписокСвойств = Неопределено,
                                     ИсключаяСвойства = Неопределено) Экспорт
	
	ОбъектИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
	
КонецПроцедуры // ЗаполнитьОбъектИзСтруктуры()

// Заполняет объект (ссылочного типа) из структуры
//
// Параметры:
//  Объект                   - Произвольный         - Заполняемый объект
//  СтруктураОбъекта         - Структура            - Данные для заполнения объекта
//    *Ссылка                  - Структура            - Описание ссылки на объект (см. СсылкаВСтруктуру())
//    *_ИмяПоля_               - Произвольный         - значения реквизитов объекта
//    *_ИмяТабличнойЧасти_     - Структура            - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//   СписокСвойств           - Строка               - список допустимых свойств
//                             Массив из Строка       (если пустой, то допустимы все свойства)
//   ИсключаяСвойства        - Строка               - список исключаемых свойств
//                             Массив из Строка       (если пустой, то допустимы все свойства)
//
Процедура ОбъектИзСтруктуры(Объект,
                            СтруктураОбъекта,
                            СписокСвойств = Неопределено,
                            ИсключаяСвойства = Неопределено) Экспорт
	
	ТипОбъекта = ТипОбъектаВОписании(СтруктураОбъекта);
	
	Попытка
		ОписаниеВида = ОписаниеВидаОбъектов(ТипОбъекта);
	Исключение
		ВызватьИсключение СтрШаблон("Ошибка получения описания вида объекта ""%1"": %2%3",
		                            ТипОбъекта,
		                            Символы.ПС,
		                            ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если ПредставленияРавны(ОписаниеВида.Имя, "Справочник") Тогда
		СправочникИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "Документ") Тогда
		ДокументИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "ПланВидовХарактеристик") Тогда
		ПланВидовХарактеристикИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "ПланСчетов") Тогда
		ПланСчетовИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "ПланВидовРасчета") Тогда
		ПланВидовРасчетаИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "ПланОбмена") Тогда
		ПланОбменаИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "БизнесПроцесс") Тогда
		БизнесПроцессИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "Задача") Тогда
		ЗадачаИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
	Иначе
		ПоказатьСообщение(СтрШаблон("Неизвестный тип объекта: %1", ТипОбъекта));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбъектИзСтруктуры()

// Создает объект (ссылочного типа) из структуры
//
// Параметры:
//   СтруктураОбъекта         - Структура         - Данные для заполнения объекта
//     *Ссылка                  - Структура         - Описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_               - Произвольный      - Значения реквизитов объекта
//     *_ИмяТабличнойЧасти_     - Структура         - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//  УстановитьСсылку          - Булево            - Установить ссылку из СтруктураОбъекта
//  СписокСвойств             - Строка            - список допустимых свойств
//                              Массив из Строка    (если пустой, то допустимы все свойства)
//  ИсключаяСвойства          - Строка            - список исключаемых свойств
//                              Массив из Строка    (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Произвольный             - созданный и заполненный объект
//
Функция СоздатьОбъектИзСтруктуры(СтруктураОбъекта,
                                 УстановитьСсылку = Ложь,
                                 СписокСвойств = Неопределено,
                                 ИсключаяСвойства = Неопределено) Экспорт
	
	ТипОбъекта = ТипОбъектаВОписании(СтруктураОбъекта);
	
	Попытка
		ОписаниеВида = ОписаниеВидаОбъектов(ТипОбъекта);
	Исключение
		ВызватьИсключение СтрШаблон("Ошибка получения описания вида объекта ""%1"": %2%3",
		                            ТипОбъекта,
		                            Символы.ПС,
		                            ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	МетаОбъект = КэшМетаданных()[СтрШаблон("%1.%2", ОписаниеВида.Имя, ОписаниеВида.ИмяТипа)];
	Менеджер = ОписаниеВида.Коллекция[МетаОбъект.Имя];
	
	Конструктор = ОписаниеВида.Конструктор;
	
	ИерархияГруппИЭлементов = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов;
	
	ЭтоГруппа = ПредставленияРавны(ОписаниеВида.Имя, "Справочник")
	          И ОписаниеВида.МетаКоллекция[МетаОбъект.Имя].Иерархический
	          И ОписаниеВида.МетаКоллекция[МетаОбъект.Имя].ВидИерархии = ИерархияГруппИЭлементов
	          И СтруктураОбъекта.ЭтоГруппа
	        ИЛИ ПредставленияРавны(ОписаниеВида.Имя, "ПланВидовХарактеристик")
	          И ОписаниеВида.МетаКоллекция[МетаОбъект.Имя].Иерархический
	          И СтруктураОбъекта.ЭтоГруппа;
	Если ЭтоГруппа Тогда
		Конструктор = ОписаниеВида.КонструкторАльт;
	КонецЕсли;
	
	Объект = Неопределено;
	
	Если ЗначениеЗаполнено(Конструктор) Тогда
		
		Если БезопасныйРежимПД() Тогда
			УстановитьБезопасныйРежим(Истина);
		КонецЕсли;
		Объект = Вычислить(СтрШаблон("Менеджер.%1()", Конструктор));
		
		Если УстановитьСсылку Тогда
			НоваяСсылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураОбъекта.Ссылка.Ид)); 
			Объект.УстановитьСсылкуНового(НоваяСсылка);
		КонецЕсли;
		
		ОбъектИзСтруктуры(Объект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства);
		
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции // СоздатьОбъектИзСтруктуры()

// Преобразует переданную ссылку в структуру, значения атомарных типов, возвращаются как есть
//
// Параметры:
//  Значение            - ЛюбаяСсылка                - Преобразуемое ссылка
//
// Возвращаемое значение:
//   Структура    - результат преобразования
//     *__Тип                       - Строка         - имя типа объекта
//     *Ид                          - Строка         - уникальный идентификатор ссылки
//     *ИдПолный                    - Строка         - преставление ссылки на объект,
//                                                     полученное функцией ЗначениеВСтрокуВнутр
//     *Предопределенный            - Булево         - Истина - предопределенное значение; Ложь - в противном случае
//     *ИмяПредопределенныхДанных   - Строка         - имя предопределенного значения
//     *Представление               - Строка         - стандатрное строковое представление объекта
//     *_ИмяПоля_                   - Произвольный   - дополнительные поля добавленные при выгрузке
//
Функция СсылкаВСтруктуру(Значение) Экспорт
	
	ОписаниеМетаданного = КэшМетаданных()[ТипЗнч(Значение)];
	
	Если НЕ ТипЗнч(ОписаниеМетаданного) = Тип("Структура") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если НЕ ТипЗнч(КэшСсылок) = Тип("Соответствие") Тогда
		КэшСсылок = Новый Соответствие();
	КонецЕсли;
	  
	ЗначениеИзКэша = КэшСсылок.Получить(Значение); 
	Если НЕ ЗначениеИзКэша = Неопределено Тогда
		Возврат ЗначениеИзКэша;
	КонецЕсли;
	
	Предопределенный = Ложь;
	
	Если ОписаниеМетаданного.Коллекция = "Перечисления" Тогда
		
		ИмяПредопределенныхДанных = "";
		Если ЗначениеЗаполнено(Значение) Тогда
			Индекс = Перечисления[ОписаниеМетаданного.Имя].Индекс(Значение);
			ИмяПредопределенныхДанных =
				Метаданные.Перечисления[ОписаниеМетаданного.Имя].ЗначенияПеречисления.Получить(Индекс).Имя;
		КонецЕсли;
		
		Предопределенный = Истина;
		
		Ид = ИмяПредопределенныхДанных;
		
	Иначе
		
		ЕстьПредопределенные = (ОписаниеМетаданного.Коллекция = "Справочники"
		                    ИЛИ ОписаниеМетаданного.Коллекция = "ПланыВидовХарактеристик"
		                    ИЛИ ОписаниеМетаданного.Коллекция = "ПланыСчетов"
		                    ИЛИ ОписаниеМетаданного.Коллекция = "ПланыВидовРасчета");
		
		Если ЕстьПредопределенные Тогда
			Предопределенный = Значение.Предопределенный;
		ИначеЕсли ОписаниеМетаданного.Коллекция = "ПланыОбмена" Тогда
			Предопределенный = Значение.ЭтотУзел;
		Иначе
			Предопределенный = Ложь;
		КонецЕсли;
		
		Ид = СокрЛП(Значение.УникальныйИдентификатор());
		
	КонецЕсли;
	
	СтруктураЗначения = Новый Структура();
	СтруктураЗначения.Вставить("__Тип", СтрЗаменить(ОписаниеМетаданного.ПолноеИмя, ".", "Ссылка."));
	Если НЕ Значение.Пустая() Тогда
		СтруктураЗначения.Вставить("Ид"                       , Ид);
		СтруктураЗначения.Вставить("ИдПолный"                 , ЗначениеВСтрокуВнутр(Значение));
		СтруктураЗначения.Вставить("Предопределенный"         , Предопределенный);
		СтруктураЗначения.Вставить("ИмяПредопределенныхДанных", ПолучитьИмяПредопределенныхДанных(Значение));
		СтруктураЗначения.Вставить("Представление"            , СокрЛП(Значение));
	КонецЕсли;
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(Значение, СтруктураЗначения);
	
	КэшСсылок.Вставить(Значение, СтруктураЗначения);
	
	Возврат СтруктураЗначения;
	
КонецФункции // СсылкаВСтруктуру()

// Получает ссылку по переданной структуре
//
// Параметры:
//  СтруктураЗначения           - Структура         - Структура описания ссылки
//
// Возвращаемое значение:
//   ЛюбаяСсылка            - полученная ссылка
//   
// TODO: продумать управление получением битых ссылок
//
Функция СсылкаИзСтруктуры(СтруктураЗначения) Экспорт
	
	Если Не ТипЗнч(СтруктураЗначения) = Тип("Структура") Тогда
		Возврат СтруктураЗначения;
	КонецЕсли;
	
	Если ЕстьТип(СтруктураЗначения) Тогда
		ОбработчикПоискаСсылок = ОбработчикПоискаСсылок(СтруктураЗначения.__Тип);
	Иначе
		ТекстОшибки = "Структура не содержит поля с типом значения или не является представлением ссылки. Поля: ";
		ДополнитьТекстПолямиСтруктуры(ТекстОшибки, СтруктураЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ОписаниеВида = ОписаниеВидаОбъектов(ОбработчикПоискаСсылок.ТипЗначения);
	
	МетаОбъект = КэшМетаданных()[СтрШаблон("%1.%2", ОписаниеВида.Имя, ОписаниеВида.ИмяТипа)];
	
	Если МетаОбъект = Неопределено Тогда
		ТекстОшибки = СтрШаблон("Не найден тип ""%1"" для значения: ""%2 (%3)""",
		                        ОбработчикПоискаСсылок.ТипЗначения,
		                        СтруктураЗначения.Представление,
		                        СтруктураЗначения.Ид);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Результат = ОписаниеВида.Коллекция[МетаОбъект.Имя].ПустаяСсылка();
	
	Если НЕ СтруктураЗначения.Свойство("Ид") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если СтруктураЗначения.Свойство("ИдПолный")
	   И СтрНайти(СтруктураЗначения.ИдПолный, "00000000000000000000000000000000") > 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(КэшСсылок) = Тип("Соответствие") Тогда
		КэшСсылок = Новый Соответствие();
	КонецЕсли;
	  
	КлючЗначения = СтрШаблон("%1#%2", СтруктураЗначения.__Тип, СтруктураЗначения.Ид);
	
	ЗначениеИзКэша = КэшСсылок.Получить(КлючЗначения); 
	Если НЕ ЗначениеИзКэша = Неопределено Тогда
		Возврат ЗначениеИзКэша;
	КонецЕсли;
	
	Результат = НайтиСсылку(СтруктураЗначения, ОписаниеВида.Коллекция[МетаОбъект.Имя].ПустаяСсылка());
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		ТекстСообщения = СтрШаблон("Не найдено значение ""%1"": ""%2 (%3)"".",
		                           МетаОбъект.ПолноеИмя,
		                           ?(СтруктураЗначения.Свойство("Представление"), СтруктураЗначения.Представление, ""),
		                           СтруктураЗначения.Ид);
		Если НЕ ТипЗнч(КэшБитыхСсылок) = Тип("Соответствие") Тогда
			КэшБитыхСсылок = Новый Соответствие();
		КонецЕсли;
		БитаяСсылка = Новый УникальныйИдентификатор(СтруктураЗначения.Ид);
		Если КэшБитыхСсылок.Получить(БитаяСсылка) = Неопределено
		   И НЕ СпособОбработкиБитыхСсылок() = СпособыОбработкиБитыхСсылок().ВызыватьИсключение Тогда
			ПоказатьСообщение(ТекстСообщения);
		КонецЕсли;
		КэшБитыхСсылок.Вставить(КлючЗначения, БитаяСсылка);
		КэшБитыхСсылок.Вставить(БитаяСсылка, СтруктураЗначения);
		Если СпособОбработкиБитыхСсылок() = СпособыОбработкиБитыхСсылок().Сохранять Тогда
			Результат = ОписаниеВида.Коллекция[МетаОбъект.Имя].ПолучитьСсылку(БитаяСсылка);
		ИначеЕсли СпособОбработкиБитыхСсылок() = СпособыОбработкиБитыхСсылок().ВызыватьИсключение Тогда
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
	КэшСсылок.Вставить(КлючЗначения, Результат);
	
	Возврат Результат;
	
КонецФункции // СсылкаИзСтруктуры()

// Преобразует переданную ссылку объект или удаление объекта в структуру
//
// Параметры:
//  Значение    - УдалениеОбъекта    - Преобразуемое ссылка
//                ЛюбаяСсылка     
//                Объект
//
// Возвращаемое значение:
//   Структура                  - результат преобразования
//     *__Тип     - Строка        - тип УдалениеОбъекта
//     *Ссылка    - Структура     - описание ссылки на объект (см. СсылкаВСтруктуру())
//
Функция УдалениеОбъектаВСтруктуру(Значение) Экспорт
	
	ОписаниеЗначения = Новый Структура();
	ОписаниеЗначения.Вставить("__Тип", "УдалениеОбъекта");
	
	Если ЭтоСсылка(Значение) Тогда
		Удаление = Новый УдалениеОбъекта(Значение);
	ИначеЕсли ЭтоОбъект(Значение) Тогда
		Удаление = Новый УдалениеОбъекта(Значение.Ссылка);
	ИначеЕсли ТипЗнч(Значение) = Тип("УдалениеОбъекта") Тогда
		Удаление = Значение;
	Иначе
		Возврат ОписаниеЗначения;
	КонецЕсли;
	
	ОписаниеЗначения.Вставить("Ссылка", СсылкаВСтруктуру(Удаление.Ссылка));
	
	Возврат ОписаниеЗначения;
	
КонецФункции // УдалениеОбъектаВСтруктуру()

// Получает объект типа удаление объекта из структуры
//
// Параметры:
//  СтруктураЗначения      - Структура    - Структура описания удаления объекта
//
// Возвращаемое значение:
//   УдалениеОбъекта    - объект типа удаление объекта
//
Функция УдалениеОбъектаИзСтруктуры(СтруктураЗначения) Экспорт
	
	Если Не ТипЗнч(СтруктураЗначения) = Тип("Структура") Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип параметра ""СтруктураЗначения"" ""%1""
		                        |Ожидается тип ""Структура"".",
		                        ТипЗнч(СтруктураЗначения));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НЕ ЕстьТип(СтруктураЗначения) Тогда
		ТекстОшибки = "Структура не содержит поля ""__Тип"". Поля: ";
		ДополнитьТекстПолямиСтруктуры(ТекстОшибки, СтруктураЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НЕ СтруктураЗначения.__Тип = "УдалениеОбъекта" Тогда
		ТекстОшибки = СтрШаблон("В параметре ""СтруктураЗначения"" передан некорректный тип для преобразования ""%1""
		                        |Ожидается тип ""УдалениеОбъекта"".",
		                        СтруктураЗначения.__Тип);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Ссылка = СсылкаИзСтруктуры(СтруктураЗначения.Ссылка);
	
	Возврат Новый УдалениеОбъекта(Ссылка);
	
КонецФункции // УдалениеОбъектаИзСтруктуры()

// Преобразует набор записей регистра в структуру
//
// Параметры:
//  НаборЗаписей        - РегистрСведенийНаборЗаписей    - набор записей регистра для преобразования
//                        РегистрНакопленияНаборЗаписей
//                        РегистрБухгалтерииНаборЗаписей
//                        РегистрРасчетаНаборЗаписей
//  СписокСвойств       - Строка                         - список допустимых свойств
//                        Массив из Строка                 (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                         - список исключаемых свойств
//                        Массив из Строка                 (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Неопределено, Структура                  - результат преобразования
//     *__Тип            - Строка               - тип <Тип регистра>НаборЗаписей.<Имя регистра>
//     *Отбор            - Структура              - Описание отбора записей регистра
//        **_ИмяПоля_      - Произвольный           - Значение отбора
//     *Записи           - Массив из Структура    - Массив записей регистра
//        **_ИмяПоля_      - Произвольный           - Значения измерений, ресурсов и реквизитов записи регистра
//
//
Функция НаборЗаписейРегистраВСтруктуру(НаборЗаписей,
                                       СписокСвойств = Неопределено,
                                       ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = НаборЗаписей.Метаданные();
	
	ОписаниеВида = ОписаниеВидаОбъектов(МетаОбъект.ПолноеИмя());
	
	СтруктураНабораЗаписей = Неопределено;
	
	Если ПредставленияРавны(ОписаниеВида.Имя, "РегистрСведений") Тогда
		СтруктураНабораЗаписей = НаборЗаписейРегистраСведенийВСтруктуру(НаборЗаписей, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "РегистрНакопления") Тогда
		СтруктураНабораЗаписей = НаборЗаписейРегистраНакопленияВСтруктуру(НаборЗаписей, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "РегистрБухгалтерии") Тогда
		СтруктураНабораЗаписей = НаборЗаписейРегистраБухгалтерииВСтруктуру(НаборЗаписей, СписокСвойств, ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "РегистрРасчета") Тогда
		СтруктураНабораЗаписей = НаборЗаписейРегистраРасчетаВСтруктуру(НаборЗаписей, СписокСвойств, ИсключаяСвойства);
	Иначе
		ПоказатьСообщение(СтрШаблон("Неизвестный тип объекта: %1", МетаОбъект.ПолноеИмя()));
	КонецЕсли;
	
	Возврат СтруктураНабораЗаписей;
	
КонецФункции // НаборЗаписейРегистраВСтруктуру()

// Обертка для совместимости с предыдущими версиями (см. НаборЗаписейРегистраИзСтруктуры())
//
Процедура ЗаполнитьНаборЗаписейРегистраИзСтруктуры(НаборЗаписей,
                                                   СтруктураНабораЗаписей,
                                                   СписокСвойств = Неопределено,
                                                   ИсключаяСвойства = Неопределено) Экспорт
	
	НаборЗаписейРегистраИзСтруктуры(НаборЗаписей, СтруктураНабораЗаписей, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено);
	
КонецПроцедуры // ЗаполнитьНаборЗаписейРегистраИзСтруктуры()

// Заполняет набор записей регистра из структуры
//
// Параметры:
//  НаборЗаписей            - РегистрСведенийНаборЗаписей  - Набор записей регистра для заполнения
//  СтруктураНабораЗаписей  - Структура                    - Данные для заполнения объекта
//    *Отбор                  - Структура                    - Описание отбора записей регистра
//       **_ИмяПоля_            - Произвольный                 - Значение отбора
//    *Записи                 - Массив из Структура          - Массив записей регистра
//       **_ИмяПоля_            - Произвольный                 - Значения измерений,
//                                                               ресурсов и реквизитов записи регистра
//  СписокСвойств           - Строка                       - список допустимых свойств
//                            Массив из Строка               (если пустой, то допустимы все свойства)
//  ИсключаяСвойства        - Строка                       - список исключаемых свойств
//                            Массив из Строка               (если пустой, то допустимы все свойства)
//
Процедура НаборЗаписейРегистраИзСтруктуры(НаборЗаписей,
                                          СтруктураНабораЗаписей,
                                          СписокСвойств = Неопределено,
                                          ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = НаборЗаписей.Метаданные();
	
	ОписаниеВида = ОписаниеВидаОбъектов(МетаОбъект.ПолноеИмя());
	
	Если ПредставленияРавны(ОписаниеВида.Имя, "РегистрСведений") Тогда
		НаборЗаписейРегистраСведенийИзСтруктуры(НаборЗаписей,
		                                        СтруктураНабораЗаписей,
		                                        СписокСвойств,
		                                        ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "РегистрНакопления") Тогда
		НаборЗаписейРегистраНакопленияИзСтруктуры(НаборЗаписей,
		                                          СтруктураНабораЗаписей,
		                                          СписокСвойств,
		                                          ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "РегистрБухгалтерии") Тогда
		НаборЗаписейРегистраБухгалтерииИзСтруктуры(НаборЗаписей,
		                                           СтруктураНабораЗаписей,
		                                           СписокСвойств,
		                                           ИсключаяСвойства);
	ИначеЕсли ПредставленияРавны(ОписаниеВида.Имя, "РегистрРасчета") Тогда
		НаборЗаписейРегистраРасчетаИзСтруктуры(НаборЗаписей,
		                                       СтруктураНабораЗаписей,
		                                       СписокСвойств,
		                                       ИсключаяСвойства);
	Иначе
		ПоказатьСообщение(СтрШаблон("Неизвестный тип объекта: %1", МетаОбъект.ПолноеИмя()));
	КонецЕсли;
	
КонецПроцедуры // НаборЗаписейРегистраИзСтруктуры()

// Заполняет набор записей регистра из структуры
//
// Параметры:
//   СтруктураНабораЗаписей   - Структура              - Данные для заполнения объекта
//     *__Тип                   - Строка                 - тип <Тип регистра>НаборЗаписей.<Имя регистра>
//     *Отбор                   - Структура              - Описание отбора записей регистра
//        **_ИмяПоля_             - Произвольный           - Значение отбора
//     *Записи                  - Массив из Структура    - Массив записей регистра
//        **_ИмяПоля_             - Произвольный           - Значения измерений, ресурсов и реквизитов записи регистра
//   СписокСвойств            - Строка                 - список допустимых свойств
//                              Массив из Строка         (если пустой, то допустимы все свойства)
//   ИсключаяСвойства         - Строка                 - список исключаемых свойств
//                              Массив из Строка         (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Произвольный     - созданный набор записей регистра
//
Функция СоздатьНаборЗаписейРегистраИзСтруктуры(СтруктураНабораЗаписей,
                                               СписокСвойств = Неопределено,
                                               ИсключаяСвойства = Неопределено) Экспорт
	
	ТипОбъекта = "NULL";
	Если ЕстьТип(СтруктураНабораЗаписей) Тогда 
		ТипОбъекта = СтруктураНабораЗаписей.__Тип;
	Иначе
		ТекстОшибки = "Структура не содержит указания типа значения или не является представлением набора записей. Поля :";
		ДополнитьТекстПолямиСтруктуры(ТекстОшибки, СтруктураНабораЗаписей);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Попытка
		ОписаниеВида = ОписаниеВидаОбъектов(ТипОбъекта);
	Исключение
		ВызватьИсключение СтрШаблон("Ошибка получения описания вида объекта ""%1"": %2%3",
		                            ТипОбъекта,
		                            Символы.ПС,
		                            ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	МетаОбъект = КэшМетаданных()[СтрШаблон("%1.%2", ОписаниеВида.Имя, ОписаниеВида.ИмяТипа)];
	
	// BSLLS:UnusedLocalVariable-off
	// sonar:UnusedLocalVariable-off
	Менеджер = ОписаниеВида.Коллекция[МетаОбъект.Имя];
	// BSLLS:UnusedLocalVariable-on
	// sonar:UnusedLocalVariable-on
	
	Конструктор = ОписаниеВида.Конструктор;
	
	НаборЗаписей = Неопределено;
	
	Если ЗначениеЗаполнено(Конструктор) Тогда
		Если БезопасныйРежимПД() Тогда
			УстановитьБезопасныйРежим(Истина);
		КонецЕсли;
		НаборЗаписей = Вычислить(СтрШаблон("Менеджер.%1()", Конструктор));
		НаборЗаписейРегистраИзСтруктуры(НаборЗаписей,
		                                СтруктураНабораЗаписей,
		                                СписокСвойств,
		                                ИсключаяСвойства);
	КонецЕсли;
	
	Возврат НаборЗаписей;
	
КонецФункции // СоздатьНаборЗаписейРегистраИзСтруктуры()

// Преобразует набор записей регистра, полученный по указанному отбору, в структуру
//
// Параметры:
//  Регистр    - Строка       - Строковое представление типа регистра (например: РегистрСведений.КурсыВалют)
//  Отбор      - Структура    - Структура вида <Имя поля>: <Значение поля>, значения полей отбора
//
// Возвращаемое значение:
//   Неопределено, Структура                    - результат преобразования
//     *__Тип            - Строка                 - тип <Имя регистра>НаборЗаписей
//     *Отбор            - Структура              - Описание отбора записей регистра
//        **_ИмяПоля_      - Произвольный           - Значение отбора
//     *Записи           - Массив из Структура    - Массив записей регистра
//        **_ИмяПоля_      - Произвольный           - Значения измерений, ресурсов и реквизитов записи регистра
//
Функция РегистрПоОтборуВСтруктуру(Регистр, Отбор) Экспорт
	
	ОписаниеВида = ОписаниеВидаОбъектов(Регистр);
	
	Если ОписаниеВида = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НаборЗаписей = ОписаниеВида.Коллекция[ОписаниеВида.ИмяТипа].СоздатьНаборЗаписей();
	Для Каждого ТекЭлемент Из Отбор Цикл
		НаборЗаписей.Отбор[ТекЭлемент.Ключ].Установить(ТекЭлемент.Значение);
	КонецЦикла;
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписейРегистраВСтруктуру(НаборЗаписей);
	
КонецФункции // РегистрПоОтборуВСтруктуру()

// Преобразует движения документа в структуру
//
// Параметры:
//  Объект                - ДокументСсылка        - документ, для которого получаются движения
//  СписокРегистров       - Строка                - список обрабатываемых регистров
//                          Массив из Строка        (если пустой, то обрабатываются все регистры)
//  ИсключаяРегистры      - Строка                - список исключаемых регистров
//                          Массив из Строка        (если пустой, то обрабатываются все регистры)
//
// Возвращаемое значение:
//   Структура                                              - движения документа по регистрам
//      *_ИмяРегистра_             - Структура                - движения регистра
//          **__Тип                  - Строка                   - тип <Тип регистра>НаборЗаписей.<Имя регистра>
//          **Отбор                  - Структура                - описание отбора записей регистра
//             ***_ИмяПоля_            - Произвольный             - значение отбора
//          **Записи                 - Массив из Структура      - массив записей регистра
//             ***_ИмяПоля_            - Произвольный             - значения измерений,
//                                                                  ресурсов и реквизитов записи регистра
//
Функция ДвиженияДокументаВСтруктуру(Объект, СписокРегистров = Неопределено, ИсключаяРегистры = Неопределено) Экспорт
	
	МетаОбъект = Объект.Метаданные();
	
	ДвиженияПрочитаны = Ложь;
	Для Каждого ТекДвижения Из МетаОбъект.Движения Цикл
		Если Объект.Движения[ТекДвижения.Имя].Количество() > 0 Тогда
			ДвиженияПрочитаны = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДвижений = Новый Структура();
	Для Каждого ТекДвижения Из МетаОбъект.Движения Цикл
		Если НЕ ИспользоватьСвойство(ТекДвижения.Имя, СписокРегистров, ИсключаяРегистры) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ДвиженияПрочитаны Тогда
			Объект.Движения[ТекДвижения.Имя].Прочитать();
		КонецЕсли;
		
		СтруктураОбъекта = НаборЗаписейРегистраВСтруктуру(Объект.Движения[ТекДвижения.Имя]);
		
		СтруктураДвижений.Вставить(ТекДвижения.Имя, СтруктураОбъекта);
	КонецЦикла;
	
	Возврат СтруктураДвижений;
	
КонецФункции // ДвиженияДокументаВСтруктуру()

// Заполняет движения документа из структуры
//
// Параметры:
//  Объект                  - ДокументОбъект        - Документ, для которого заполняются движения
//  СтруктураДвижений       - Структура               - Движения документа по регистрам
//      *_ИмяРегистра_        - Структура               - Движения регистра
//          **Отбор             - Структура               - Описание отбора записей регистра
//             ***_ИмяПоля_       - Произвольный            - Значение отбора
//          **Записи            - Массив из Структура     - Массив записей регистра
//             ***_ИмяПоля_       - Произвольный            - Значения измерений, ресурсов и реквизитов записи регистра
//  СписокРегистров       - Строка                  - список обрабатываемых регистров
//                          Массив из Строка          (если пустой, то обрабатываются все регистры)
//  ИсключаяРегистры      - Строка                  - список исключаемых регистров
//                          Массив из Строка          (если пустой, то обрабатываются все регистры)
//
Процедура ДвиженияДокументаИзСтруктуры(Объект,
                                       СтруктураДвижений,
                                       СписокРегистров = Неопределено,
                                       ИсключаяРегистры = Неопределено) Экспорт
	
	МетаОбъект = Объект.Метаданные();
	
	Для Каждого ТекДвижения Из МетаОбъект.Движения Цикл
		
		Если НЕ СтруктураДвижений.Свойство(ТекДвижения.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ИспользоватьСвойство(ТекДвижения.Имя, СписокРегистров, ИсключаяРегистры) Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписейРегистраИзСтруктуры(Объект.Движения[ТекДвижения.Имя], СтруктураДвижений[ТекДвижения.Имя]);
	КонецЦикла;
	
КонецПроцедуры // ДвиженияДокументаИзСтруктуры()

#КонецОбласти // ПреобразованияОбъектовОбщие

#Область ПреобразованияСКДИнтерфейсныеПроцедуры

// Функция - заполняет и возвращает структуру описания настроек компоновки данных
//
// Параметры:
//   Объект    - НастройкиКомпоновкиДанных    - настройки компоновки данных для обработки
//
// Возвращаемое значение:
//   Структура     - структура описания настроек компоновки данных
//
Функция НастройкиСКДВСтруктуру(Объект) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("НастройкиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "НастройкиКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Выбор"                 , ЗначениеСКДВСтруктуру(Объект.Выбор));
	СтруктураОбъекта.Вставить("ДополнительныеСвойства", ЗначениеВСтруктуру(Объект.ДополнительныеСвойства));
	СтруктураОбъекта.Вставить("Отбор"                 , ЗначениеСКДВСтруктуру(Объект.Отбор));
	СтруктураОбъекта.Вставить("ПараметрыВывода"       , ЗначениеСКДВСтруктуру(Объект.ПараметрыВывода));
	СтруктураОбъекта.Вставить("ПараметрыДанных"       , ЗначениеСКДВСтруктуру(Объект.ПараметрыДанных));
	СтруктураОбъекта.Вставить("ПользовательскиеПоля"  , ЗначениеСКДВСтруктуру(Объект.ПользовательскиеПоля));
	СтруктураОбъекта.Вставить("Порядок"               , ЗначениеСКДВСтруктуру(Объект.Порядок));
	СтруктураОбъекта.Вставить("Родитель"              , Неопределено); // TODO: Разбраться с родителем
	СтруктураОбъекта.Вставить("Структура"             , КоллекцияСКДВМассив(Объект.Структура));
	СтруктураОбъекта.Вставить("УсловноеОформление"    , ЗначениеСКДВСтруктуру(Объект.УсловноеОформление));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // НастройкиСКДВСтруктуру()

// Процедура - заполняет объект СКД НастройкиКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - НастройкиКомпоновкиДанных     - заполняемый объект
//     СтруктураОбъекта   - Структура                     - данные для заполнения объекта
//
Процедура НастройкиСКДИзСтруктуры(Объект, СтруктураОбъекта) Экспорт
	
	Если НЕ ТипЗнч(Объект) = Тип("НастройкиКомпоновкиДанных") Тогда
		Объект = Новый НастройкиКомпоновкиДанных();
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Выбор", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Отбор", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПараметрыВывода", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПараметрыДанных", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПользовательскиеПоля", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Порядок", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "УсловноеОформление", Истина);
	
	Если СтруктураОбъекта.Свойство("ДополнительныеСвойства") Тогда
		Для Каждого ТекЭлемент Из СтруктураОбъекта.ДополнительныеСвойства Цикл
			Объект.ДополнительныеСвойства.Вставить(ТекЭлемент.Ключ, ЗначениеИзСтруктуры(ТекЭлемент.Значение));
		КонецЦикла;
	КонецЕсли;
	
	// TODO: Разобраться с родителем
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Структура", Истина);
	
КонецПроцедуры // НастройкиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// СхемаКомпоновкиДанных
//
// Параметры:
//   Объект    - СхемаКомпоновкиДанных    - схема компоновки данных для обработки
//
// Возвращаемое значение:
//   Структура    - структура описания схемы компоновки данных
//
Функция СКДВСтруктуру(Объект) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("СхемаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "СхемаКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИсточникиДанных"     , КоллекцияСКДВМассив(Объект.ИсточникиДанных));
	СтруктураОбъекта.Вставить("НаборыДанных"        , КоллекцияСКДВМассив(Объект.НаборыДанных));
	СтруктураОбъекта.Вставить("СвязиНаборовДанных"  , КоллекцияСКДВМассив(Объект.СвязиНаборовДанных));
	СтруктураОбъекта.Вставить("ВычисляемыеПоля"     , КоллекцияСКДВМассив(Объект.ВычисляемыеПоля));
	СтруктураОбъекта.Вставить("Параметры"           , КоллекцияСКДВМассив(Объект.Параметры));
	СтруктураОбъекта.Вставить("ПоляИтога"           , КоллекцияСКДВМассив(Объект.ПоляИтога));
	СтруктураОбъекта.Вставить("ВариантыНастроек"    , КоллекцияСКДВМассив(Объект.ВариантыНастроек));
	СтруктураОбъекта.Вставить("НастройкиПоУмолчанию", СтруктураОбъекта.ВариантыНастроек[0].Имя);
	СтруктураОбъекта.Вставить("Макеты"              , КоллекцияСКДВМассив(Объект.Макеты));
	СтруктураОбъекта.Вставить("МакетыГруппировок"   , КоллекцияСКДВМассив(Объект.МакетыГруппировок));
	СтруктураОбъекта.Вставить("МакетыЗаголовковГруппировок",
	                          КоллекцияСКДВМассив(Объект.МакетыЗаголовковГруппировок));
	СтруктураОбъекта.Вставить("МакетыПолей"         , КоллекцияСКДВМассив(Объект.МакетыПолей));
	СтруктураОбъекта.Вставить("МакетыПолейИтога"    , КоллекцияСКДВМассив(Объект.МакетыПолейИтога));
	СтруктураОбъекта.Вставить("ВложенныеСхемыКомпоновкиДанных",
	                          КоллекцияСКДВМассив(Объект.ВложенныеСхемыКомпоновкиДанных));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // СКДВСтруктуру()

// Процедура - заполняет объект СКД СхемаКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - СхемаКомпоновкиДанных     - заполняемый объект
//     СтруктураОбъекта   - Структура                 - данные для заполнения объекта
//
Процедура СКДИзСтруктуры(Объект, СтруктураОбъекта) Экспорт
	
	Если НЕ ТипЗнч(Объект) = Тип("СхемаКомпоновкиДанных") Тогда
		Объект = Новый СхемаКомпоновкиДанных();
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "ИсточникиДанных");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "НаборыДанных", Истина);
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "СвязиНаборовДанных");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "ВычисляемыеПоля");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Параметры");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "ПоляИтога");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Макеты");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "МакетыГруппировок");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "МакетыЗаголовковГруппировок");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "МакетыПолей");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "МакетыПолейИтога");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "ВложенныеСхемыКомпоновкиДанных");
	
	Если СтруктураОбъекта.Свойство("ВариантыНастроек") Тогда
		ВариантПоУмолчанию = Неопределено;
		Если СтруктураОбъекта.Свойство("НастройкиПоУмолчанию") И Объект.ВариантыНастроек.Количество() > 0 Тогда
			Для Каждого ТекЭлемент Из СтруктураОбъекта.ВариантыНастроек Цикл
				Если ТекЭлемент.Имя = СтруктураОбъекта.НастройкиПоУмолчанию Тогда
					ВариантПоУмолчанию = ТекЭлемент;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НЕ ВариантПоУмолчанию = Неопределено Тогда
				ЗначениеСКДИзСтруктуры(Объект.ВариантыНастроек[0], ВариантПоУмолчанию);
			Иначе
				Объект.ВариантыНастроек.Очистить();
			КонецЕсли;
		Иначе
			Объект.ВариантыНастроек.Очистить();
		КонецЕсли;
		Для Каждого ТекЭлемент Из СтруктураОбъекта.ВариантыНастроек Цикл
			Если НЕ ВариантПоУмолчанию = Неопределено И ТекЭлемент.Имя = СтруктураОбъекта.НастройкиПоУмолчанию Тогда
				Продолжить;
			КонецЕсли;
			НовыйЭлемент = Объект.ВариантыНастроек.Добавить();
			ЗначениеСКДИзСтруктуры(НовыйЭлемент, ТекЭлемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // СКДИзСтруктуры()

#КонецОбласти // ПреобразованияСКДИнтерфейсныеПроцедуры

#Область ПреобразованияДанныхФормИнтерфейсныеПроцедуры

// Функция - заполняет и возвращает структуру описания данных формы
//
// Параметры:
//  Форма             - ФормаКлиентскогоПриложения  - форма для обработки
//  ТолькоСохраняемые - Булево                      - Истина - сохраняются только значения реквизитов
//                                                    с признаком "Сохраняемые данные"
//                                                    Ложь - сохраняются значения всех реквизитов
//  СписокСвойств        - Строка                   - список допустимых свойств
//                         Массив из Строка           (если пустой, то допустимы все свойства)
//  ИсключаяСвойства     - Строка                   - список исключаемых свойств
//                         Массив из Строка           (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                                        - структура описания формы
//      *__Тип               - Строка                   - тип данных (ДанныеФормы)
//      *_ИмяРеквизита_      - Структура                - описание и значение реквизита формы
//
// @skip-check bsl-legacy-check-dynamic-feature-access
Функция ДанныеФормыВСтруктуру(Форма,
                              ТолькоСохраняемые = Ложь,
                              СписокСвойств = Неопределено,
                              ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураДанных = Новый Структура();
	
	Если НЕ ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
		СтруктураДанных.Вставить("__Тип", "Неопределено");
		Возврат СтруктураДанных;
	КонецЕсли;
	
	СтруктураДанных.Вставить("__Тип", СтрШаблон("ДанныеФормы.%1", Форма.ИмяФормы));
	
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	
	Для Каждого ТекРеквизит Из РеквизитыФормы Цикл
		
		Если ТолькоСохраняемые И НЕ ТекРеквизит.СохраняемыеДанные Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ИспользоватьСвойство(ТекРеквизит.Имя, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеРеквизита = Новый Структура();
		ОписаниеРеквизита.Вставить("ТипЗначения"      , ЗначениеВСтруктуру(ТекРеквизит.ТипЗначения));
		ОписаниеРеквизита.Вставить("Путь"             , ТекРеквизит.Путь);
		ОписаниеРеквизита.Вставить("Заголовок"        , ТекРеквизит.Заголовок);
		ОписаниеРеквизита.Вставить("СохраняемыеДанные", ТекРеквизит.СохраняемыеДанные);
		
		ЗначениеДляСохранения = Неопределено;
		
		ТипРеквизита = ТипЗнч(Форма[ТекРеквизит.Имя]);
		
		ЭтоДанныеФормы = (ТипРеквизита = Тип("ДанныеФормыСтруктура")
		              ИЛИ ТипРеквизита = Тип("ДанныеФормыСтруктураСКоллекцией")
		              ИЛИ ТипРеквизита = Тип("ДанныеФормыКоллекция")
		              ИЛИ ТипРеквизита = Тип("ДанныеФормыДерево"));
		Если ЭтоДанныеФормы Тогда
			ЗначениеДляСохранения = Форма.РеквизитФормыВЗначение(ТекРеквизит.Имя);
		Иначе
			ЗначениеДляСохранения = Форма[ТекРеквизит.Имя];
		КонецЕсли;
		
		ОписаниеРеквизита.Вставить("Значение", ЗначениеВСтруктуру(ЗначениеДляСохранения));
		
		СтруктураДанных.Вставить(ТекРеквизит.Имя, ОписаниеРеквизита);
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции // ДанныеФормыВСтруктуру()

// Заполняет значения данных формы из структуры
//
// Параметры:
//  Форма               - ФормаКлиентскогоПриложения   - форма для заполнения данных
//  СтруктураДанных     - Структура                    - данные для заполнения формы
//      *__Тип            - Строка                       - тип данных (ДанныеФормы)
//      *_ИмяРеквизита_   - Структура                    - описание и значение реквизита формы
//  ПроверятьИмяФормы   - Булево                       - Истина - если имя формы не соответствует сохраненным данным,
//                                                       то будет выдано исключение;
//                                                       Ложь - имя формы не проверяется
//  СоздаватьРеквизиты  - Булево                       - Истина - если реквизит отсутствует в форме,
//                                                       то будет создан новый;
//                                                       Ложь - новые реквизиты не создаются
//  СписокСвойств       - Строка                       - список допустимых свойств
//                        Массив из Строка               (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                       - список исключаемых свойств
//                        Массив из Строка               (если пустой, то допустимы все свойства)
//
// @skip-check bsl-legacy-check-dynamic-feature-access
Процедура ДанныеФормыИзСтруктуры(Форма,
                                 СтруктураДанных,
                                 ПроверятьИмяФормы = Ложь,
                                 СоздаватьРеквизиты = Ложь,
                                 СписокСвойств = Неопределено,
                                 ИсключаяСвойства = Неопределено) Экспорт
	
	Если НЕ ТипЗнч(Форма) = Тип("ФормаКлиентскогоПриложения") Тогда
		ТекстОшибки = СтрШаблон("Попытка заполнения объекта типа ""%1"" данными для объекта типа ""%2""!",
		                        ТипЗнч(Форма),
		                        Тип("ФормаКлиентскогоПриложения"));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НЕ ЕстьТип(СтруктураДанных) Тогда
		ТекстОшибки = "В структуре данных для заполнения служебное поле ""__Тип"", поля структуры:";
		ДополнитьТекстПолямиСтруктуры(ТекстОшибки, СтруктураДанных);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НЕ ПредставленияРавны(Лев(СтруктураДанных.__Тип, СтрДлина("ДанныеФормы")), "ДанныеФормы") Тогда
		ТекстОшибки = СтрШаблон("Тип данных ""%1"" структуры данных не является данными формы", СтруктураДанных.__Тип);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если ПроверятьИмяФормы
	   И ПредставленияРавны(СтруктураДанных.__Тип, СтрШаблон("ДанныеФормы.%1", Форма.ИмяФормы)) Тогда
		ТекстОшибки = СтрШаблон("Тип данных ""%1"" структуры данных не является данными формы ""%2""!",
		                        СтруктураДанных.__Тип,
		                        Форма.ИмяФормы);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	
	ИменаРеквизитовФормы = Новый Соответствие();
	
	Для Каждого ТекРеквизит Из РеквизитыФормы Цикл
		ИменаРеквизитовФормы.Вставить(ТекРеквизит.Имя, ТекРеквизит);
	КонецЦикла;
	
	СоздаваемыеРеквизиты = Новый Массив();
	
	Для Каждого ТекРеквизит Из СтруктураДанных Цикл
		Если ПредставленияРавны(ТекРеквизит.Ключ, "__Тип") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ИспользоватьСвойство(ТекРеквизит.Ключ, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СоздаватьРеквизиты И ИменаРеквизитовФормы.Получить(ТекРеквизит.Ключ) = Неопределено Тогда
			СоздаваемыеРеквизиты.Добавить(Новый РеквизитФормы(ТекРеквизит.Ключ,
			                                                  ЗначениеИзСтруктуры(ТекРеквизит.Значение.ТипЗначения),
			                                                  ТекРеквизит.Значение.Путь,
			                                                  ТекРеквизит.Значение.Заголовок,
			                                                  ТекРеквизит.Значение.СохраняемыеДанные));               
		КонецЕсли;
	КонецЦикла;
	
	Если СоздаваемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(СоздаваемыеРеквизиты);
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из СтруктураДанных Цикл
		Если ПредставленияРавны(ТекРеквизит.Ключ, "__Тип") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ИспользоватьСвойство(ТекРеквизит.Ключ, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		
		РеквизитФормы = ИменаРеквизитовФормы.Получить(ТекРеквизит.Ключ);
		
		Если РеквизитФормы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипРеквизита = ТипЗнч(Форма[ТекРеквизит.Ключ]);
		
		ЭтоДанныеФормы = (ТипРеквизита = Тип("ДанныеФормыСтруктура")
		              ИЛИ ТипРеквизита = Тип("ДанныеФормыСтруктураСКоллекцией")
		              ИЛИ ТипРеквизита = Тип("ДанныеФормыКоллекция")
		              ИЛИ ТипРеквизита = Тип("ДанныеФормыДерево"));
		Если ЭтоДанныеФормы Тогда
			Если ЭтоОбъект(ТекРеквизит.Значение.Значение) Тогда
				ЗначениеДляЗаполнения = Форма.РеквизитФормыВЗначение(ТекРеквизит.Ключ);
				ОбъектИзСтруктуры(ЗначениеДляЗаполнения, ТекРеквизит.Значение.Значение, Истина);
			ИначеЕсли ЭтоНаборЗаписейРегистра(ТекРеквизит.Значение.Значение) Тогда
				ЗначениеДляЗаполнения = Форма.РеквизитФормыВЗначение(ТекРеквизит.Ключ);
				НаборЗаписейРегистраИзСтруктуры(ЗначениеДляЗаполнения, ТекРеквизит.Значение.Значение, Истина);
			Иначе
				ЗначениеДляЗаполнения = ЗначениеИзСтруктуры(ТекРеквизит.Значение.Значение);
			КонецЕсли;
			Форма.ЗначениеВРеквизитФормы(ЗначениеДляЗаполнения, ТекРеквизит.Ключ);
		Иначе
			Форма[ТекРеквизит.Ключ] = ЗначениеИзСтруктуры(ТекРеквизит.Значение.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ДанныеФормыИзСтруктуры()

#КонецОбласти // ПреобразованияДанныхФормИнтерфейсныеПроцедуры

#Область ПреобразованияJSON

// Функция - возвращает представление описания объекта в текстовом формате JSON
//
// Параметры:
//  ОписаниеОбъекта     - Структура, Массив из Структура     - описание объекта для преобразования
//
// Возвращаемое значение:
//  Строка - представление описания объекта в текстовом формате JSON
//
Функция ЗаписатьОписаниеОбъектаВJSON(Знач ОписаниеОбъекта) Экспорт
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Unix, Символы.Таб));
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON();
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.Microsoft;
	
	Попытка
		ЗаписатьJSON(Запись, ОписаниеОбъекта, НастройкиСериализации, "ОбработчикЗаписиЗначенийJSON", ЭтотОбъект);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат Запись.Закрыть();
	
КонецФункции // ЗаписатьОписаниеОбъектаВJSON()

// Функция - возвращает описание объекта, прочитанное из текстового формата JSON
//
// Параметры:
//  ТекстОписанияОбъекта       - Строка           - представление описания объекта в текстовом формате JSON
//  ВСоответствие              - Булево           - Истина - чтение объекта JSON будет выполнено в Соответствие;
//                                                  Ложь - объекты будут считываться в объект типа Структура
//  СвойстваСоЗначениемДата    - Строка           - список свойств, которые должны быть преобразованы в формат даты
//                               Массив из Строка
// Возвращаемое значение:
//  Структура, Массив из Структура     - описание объекта 
//
Функция ПрочитатьОписаниеОбъектаИзJSON(Знач ТекстОписанияОбъекта,
                                       Знач ВСоответствие = Ложь,
                                       Знач СвойстваСоЗначениемДата = Неопределено) Экспорт
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(ТекстОписанияОбъекта);
	
	Если ТипЗнч(СвойстваСоЗначениемДата) = Тип("Строка") Тогда
		СвойстваСоЗначениемДата = СтрРазделить(СвойстваСоЗначениемДата, ",", Ложь);
	КонецЕсли;
	
	Если НЕ ТипЗнч(СвойстваСоЗначениемДата) = Тип("Массив") Тогда
		СвойстваСоЗначениемДата = Новый Массив();
	КонецЕсли;
	
	Попытка
		Возврат ПрочитатьJSON(Чтение,
		                      ВСоответствие,
		                      СвойстваСоЗначениемДата,
		                      ФорматДатыJSON.Microsoft,
		                      "ОбработчикЧтенияЗначенийJSON",
		                      ЭтотОбъект);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецФункции // ПрочитатьОписаниеОбъектаИзJSON()

// Обработчик записи значений JSON
//
// Параметры:
//  Свойство                   - Строка       - записываемое свойство
//  Значение                   - Строка       - записываемое значение
//  ДополнительныеПараметры    - Структура    - дополнительные параметры для обработки
//  Отказ                      - Булево       - Истина - отказ от дальнейшей обработки
//
// Возвращаемое значение:
//  Строка     - значение свойства для записи
//
Функция ОбработчикЗаписиЗначенийJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("ДвоичныеДанные") Тогда
		Значение = СтрШаблон("/BinaryData(%1)/", Base64Строка(Значение));
	ИначеЕсли ТипЗначения = Тип("ХранилищеЗначения") Тогда
		Значение = СтрШаблон("/ValueStorage(%1)/", ЗначениеВСтрокуВнутр(Значение));
	ИначеЕсли ТипЗначения = Тип("УникальныйИдентификатор") Тогда
		Значение = СтрШаблон("/UniqueID(%1)/", СокрЛП(Значение));
	ИначеЕсли ТипЗначения = Тип("NULL") Тогда
		Значение = "/NULL()/";
	ИначеЕсли ТипЗначения = Тип("Неопределено") Тогда
		Значение = "/Undefined()/";
	Иначе
		Значение = СтрШаблон("/UnknownType(%1)/", ЗначениеВСтрокуВнутр(Значение));
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // ОбработчикЗаписиЗначенийJSON()

// Обработчик чтения значений JSON
//
// Параметры:
//  Свойство                   - Строка       - читаемое свойство
//  Значение                   - Строка       - читаемое значение
//  ДополнительныеПараметры    - Структура    - дополнительные параметры для обработки
//
// Возвращаемое значение:
//  Произвольный     - прочитанное значение
//
Функция ОбработчикЧтенияЗначенийJSON(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Если СтрНачинаетсяС(Значение, "/Date(") И Прав(Значение, 2) = ")/" Тогда
			Значение = ПрочитатьДатуJSON(Значение, ФорматДатыJSON.Microsoft);
			Если Значение < '00020101000000' Тогда
				Значение = '00010101000000';
			КонецЕсли;
		ИначеЕсли СтрНачинаетсяС(Значение, "/BinaryData(") И Прав(Значение, 2) = ")/" Тогда
			Значение = Base64Значение(Сред(Значение, 13, СтрДлина(Значение) - 14));
		ИначеЕсли СтрНачинаетсяС(Значение, "/ValueStorage(") И Прав(Значение, 2) = ")/" Тогда
			Значение = ЗначениеИзСтрокиВнутр(Сред(Значение, 15, СтрДлина(Значение) - 16));
		ИначеЕсли СтрНачинаетсяС(Значение, "/UniqueID(") И Прав(Значение, 2) = ")/" Тогда
			Значение = Новый УникальныйИдентификатор(Сред(Значение, 11, СтрДлина(Значение) - 12));
		ИначеЕсли Значение = "/NULL()/" Тогда
			Значение = NULL;
		ИначеЕсли Значение = "/Undefined()/" Тогда
			Значение = Неопределено;
		ИначеЕсли СтрНачинаетсяС(Значение, "/UnknownType(") И Прав(Значение, 2) = ")/" Тогда
			Значение = ЗначениеИзСтрокиВнутр(Сред(Значение, 14, СтрДлина(Значение) - 15));
		Иначе
			Возврат Значение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // ОбработчикЧтенияЗначенийJSON()

#КонецОбласти // ПреобразованияJSON

#Область БитыеСсылки

// Функция - возвращает кэш "битых" (отсутствует объект БД) ссылок
//
// Возвращаемое значение:
//   Соответствие из Произвольный    - кэш "битых" (отсутствует объект БД) ссылок
//
Функция БитыеСсылки() Экспорт
	
	Если НЕ ТипЗнч(КэшБитыхСсылок) = Тип("Соответствие") Тогда
		КэшБитыхСсылок = Новый Соответствие();
	КонецЕсли;
	
	Возврат КэшБитыхСсылок;
	
КонецФункции // БитыеСсылки()

// Процедура - очищает кэш "битых" (отсутствует объект БД) ссылок
//
Процедура ОчиститьБитыеСсылки() Экспорт
	
	КэшБитыхСсылок = Новый Соответствие();
	
КонецПроцедуры // ОчиститьБитыеСсылки()

#КонецОбласти // БитыеСсылки

#Область ПараметрыОбработки

// Функция - возвращает значение флага использования безопасного режима выполнения кода
//
// Возвращаемое значение:
//   Булево    - значение флага использования безопасного режима выполнения кода
//
Функция БезопасныйРежимПД() Экспорт
	
	Если НЕ ТипЗнч(БезопасныйРежимПД) = Тип("Булево") Тогда
		БезопасныйРежимПД = Ложь;
	КонецЕсли;
	
	Возврат БезопасныйРежимПД;
	
КонецФункции // БезопасныйРежимПД()

// Процедура - устанавливает флаг использования безопасного режима выполнения кода
//
// Параметры:
//   НовоеЗначение    - Булево    - новое значение флага
//
Процедура УстановитьБезопасныйРежимПД(НовоеЗначение) Экспорт
	
	Если ТипЗнч(НовоеЗначение) = Тип("Булево") Тогда
		БезопасныйРежимПД = НовоеЗначение;
	Иначе
		ВызватьИсключение СтрШаблон("Некорректное значение флага безопасного режима ""%1"", ожидается тип ""Булево""",
		                            НовоеЗначение);
	КонецЕсли;
	
КонецПроцедуры // УстановитьБезопасныйРежимПД()

// Функция - возвращает установленный способ обработки "битых" ссылок (на отсутствующие в базе объекты)
//
// Возвращаемое значение:
//   Число    - текущий способ обработки "битых" ссылок
//
Функция СпособОбработкиБитыхСсылок() Экспорт
	
	Если НЕ (ТипЗнч(СпособОбработкиБитыхСсылок) = Тип("Число")
	         И СпособОбработкиБитыхСсылок >= 0 И СпособОбработкиБитыхСсылок <= 2) Тогда
		СпособОбработкиБитыхСсылок = 0;
	КонецЕсли;
	
	Возврат СпособОбработкиБитыхСсылок;
	
КонецФункции // СпособОбработкиБитыхСсылок()

// Процедура - устанавливает способ обработки "битых" ссылок (на отсутствующие в базе объекты)
//
// Параметры:
//   НовоеЗначение    - Число    - новый способ обработки "битых" ссылок (см. СпособыОбработкиБитыхСсылок())
//
Процедура УстановитьСпособОбработкиБитыхСсылок(НовоеЗначение) Экспорт
	
	Если НовоеЗначение = СпособыОбработкиБитыхСсылок().Очищать
	 ИЛИ НовоеЗначение = СпособыОбработкиБитыхСсылок().ВызыватьИсключение Тогда
		ОчиститьБитыеСсылки();
	КонецЕсли;
	
	Если ТипЗнч(НовоеЗначение) = Тип("Число") И НовоеЗначение >= 0 И НовоеЗначение <= 2 Тогда
		СпособОбработкиБитыхСсылок = НовоеЗначение;
	Иначе
		ВызватьИсключение СтрШаблон("Некорректный способ обработки битых ссылок ""%1"", ожидается ""Число"" (0-2)",
		                            НовоеЗначение);
	КонецЕсли;
	
КонецПроцедуры // УстановитьСпособОбработкиБитыхСсылок()

// Функция - возвращает доступные способы обработки "битых" ссылок (на отсутствующие в базе объекты)
//
// Возвращаемое значение:
//   ФиксированнаяСтруктура            - доступные способы обработки "битых" ссылок (на отсутствующие в базе объекты)
//     *Очищать               - Число    - (0) будет возвращена пустая ссылка
//     *Сохранять             - Число    - (1) будет возвращена "битая" ссылка как есть
//     *ВызыватьИсключение    - Число    - (2) будет выбрасываться исключение
//
Функция СпособыОбработкиБитыхСсылок() Экспорт
	
	СпособыОбработки = Новый Структура();
	СпособыОбработки.Вставить("Очищать"           , 0);
	СпособыОбработки.Вставить("Сохранять"         , 1);
	СпособыОбработки.Вставить("ВызыватьИсключение", 2);
	
	Возврат Новый ФиксированнаяСтруктура(СпособыОбработки);
	
КонецФункции // СпособОбработкиБитыхСсылок()

// Функция - возвращает значение флага преобразования прикладных типов
// (Объекты, Ссылки, НаборыЗаписей и т.п.), вложенных в преобразуемые структуры данных
//
// Возвращаемое значение:
//   Булево    - Истина - прикладные типы (Объекты, Ссылки, НаборыЗаписей и т.п.)
//                        будут преобразованы из сериализованого представления
//               Ложь - прикладные типы будут прочитаны в сериализованом виде
//
Функция ПреобразованиеПрикладныхТипов() Экспорт
	
	Если НЕ ТипЗнч(ПреобразованиеПрикладныхТипов) = Тип("Булево") Тогда
		ПреобразованиеПрикладныхТипов = Истина;
	КонецЕсли;
	
	Возврат ПреобразованиеПрикладныхТипов;
	
КонецФункции // ПреобразованиеПрикладныхТипов()

// Процедура - устанавливает значение флага преобразования прикладных типов
// (Объекты, Ссылки, НаборыЗаписей и т.п.), вложенных в преобразуемые структуры данных
//
// Параметры:
//   НовоеЗначение    - Число    - новое значение значение флага преобразования прикладных типов
//                                 (см. ПреобразованиеПрикладныхТипов())
//
Процедура УстановитьПреобразованиеПрикладныхТипов(НовоеЗначение) Экспорт
	
	Если ТипЗнч(НовоеЗначение) = Тип("Булево") Тогда
		ПреобразованиеПрикладныхТипов = НовоеЗначение;
	Иначе
		ВызватьИсключение СтрШаблон("Некорректное значение флага преобразования прикладных типов ""%1"",
		                            | ожидается тип ""Булево""",
		                            НовоеЗначение);
	КонецЕсли;
	
КонецПроцедуры // УстановитьПреобразованиеПрикладныхТипов()

// Функция - возвращает значение флага расширенного представления даты при сериализации
//
// Возвращаемое значение:
//   Булево    - Истина - значения типа дата будут преобразованы
//               в структуру ("__Тип", "Значение", "Представление")
//               Ложь - значения типа дата будут преобразованы
//               в формат даты Microsoftе
//
Функция РасширенноеПредставлениеДаты() Экспорт
	
	Если НЕ ТипЗнч(РасширенноеПредставлениеДаты) = Тип("Булево") Тогда
		РасширенноеПредставлениеДаты = Ложь;
	КонецЕсли;
	
	Возврат РасширенноеПредставлениеДаты;
	
КонецФункции // РасширенноеПредставлениеДаты()

// Процедура - устанавливает значение флага расширенного представления даты при сериализации
//
// Параметры:
//   НовоеЗначение    - Булево    - новое значение флага расширенного представления даты
//                                  при сериализации (см. РасширенноеПредставлениеДаты())
//
Процедура УстановитьРасширенноеПредставлениеДаты(НовоеЗначение) Экспорт
	
	Если ТипЗнч(НовоеЗначение) = Тип("Булево") Тогда
		РасширенноеПредставлениеДаты = НовоеЗначение;
	Иначе
		ВызватьИсключение СтрШаблон("Некорректное значение флага расширенного представления даты ""%1"",
		                            | ожидается тип ""Булево""",
		                            НовоеЗначение);
	КонецЕсли;
	
КонецПроцедуры // УстановитьРасширенноеПредставлениеДаты()

// Функция - возвращает версию библиотеки
//
// Возвращаемое значение:
//   Строка - версия библиотеки
//
Функция Версия() Экспорт
	
	Возврат ПолучитьМакет("ВерсияБиблиотеки").ПолучитьТекст();
	
КонецФункции // Версия()

#КонецОбласти // ПараметрыОбработки

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область ПреобразованияОбъектовСлужебные

// Возвращает структуру, содержащую информацию
// о переданном виде объектов метаданных
//
// Параметры:
//  Значение        - Строка        - Имя вида объектов метаданных (например, константа,
//                    Тип             ПланСчетов и т.п.), может передаваться в ед. мн. числе,
//                    Структура       тип объекта, объект или структура объекта
//  ТекИБ           - COMОбъект     - Информационная база, из которой будет получена информация
//                                    о виде объектов, Неопределено - текущая инф. база
//
// Возвращаемое значение:
//   Неопределено, Структура                              - описание вида объектов
//     *Коллекция          - Менеджер                       - Менеджер вида объектов (например, СправочникиМенеджер)
//     *МетаКоллекция      - КоллекцияОбъектовМетаданных    - Коллекция метаданных вида объектов (например, Справочники)
//     *Имя                - Строка                         - Имя вида объектов (например, "ПланСчетов")
//     *ИмяКоллекции       - Строка                         - Имя коллекции вида объектов (например, "ПланыСчетов")
//     *Представление      - Строка                         - Представление вида объектов (например, "План счетов")
//     *ПредставлениеМ     - Строка                         - Представление коллекции вида объектов
//                                                            (например, "Планы счетов")
//     *ИмяТипа            - Строка                         - Имя типа (конкретный элемент, например, Контрагенты)
//     *Картинка           - Картинка                       - Картинка коллекции по умолчанию
//     *КартинкаОбъекта    - Картинка                       - Картинка объекта коллекции по умолчанию
//     *Конструктор        - Строка                         - Имя функции конструктора экземпляра объекта
//                                                            (например, СоздатьЭлемент)
//     *КонструкторАльт    - Строка                         - Имя альтернативной функции конструктора
//                                                            экземпляра объекта (например, СоздатьГруппу) 
//
Функция ОписаниеВидаОбъектов(Знач Значение, Знач ТекИБ = Неопределено) Экспорт
	
	Если БезопасныйРежимПД() Тогда
		УстановитьБезопасныйРежим(Истина);
	КонецЕсли;
	
	ИмяТипа = "";
	
	Если ТипЗнч(Значение) = Тип("Структура") Тогда
		Если Значение.__Тип = "УдалениеОбъекта" Тогда
			ИмяИлиТип = Значение.Ссылка.__Тип;
		Иначе
			ИмяИлиТип = Значение.__Тип;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("ОбъектМетаданных") Тогда
		ИмяИлиТип = Значение.ПолноеИмя();
	Иначе
		ИмяИлиТип = Значение;
	КонецЕсли;
	
	ТипИмениИлиТипа = ТипЗнч(ИмяИлиТип);
	
	Если ТипИмениИлиТипа = Тип("Тип") Тогда
		ОписаниеМетаданных = КэшМетаданных()[ИмяИлиТип];
		Если ОписаниеМетаданных = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		ЧастиИмени = СтрРазделить(ОписаниеМетаданных.ПолноеИмя, ".", Ложь);
	ИначеЕсли ТипИмениИлиТипа = Тип("Строка") Тогда
		ЧастиИмени = СтрРазделить(ИмяИлиТип, ".", Ложь);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	НИмя = НРег(ЧастиИмени[0]);
	Если ЧастиИмени.Количество() > 1 Тогда
		ИмяТипа = ЧастиИмени[1];
	КонецЕсли;
	НИмя = СтрЗаменить(СтрЗаменить(НИмя, "-", ""), " ", "");
	
	ОписаниеТипаКэш = КэшОписанийТипов().Получить(НИмя);
	
	Если ОписаниеТипаКэш = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеТипа = Новый Структура();
	
	ОписаниеТипа.Вставить("ИмяТипа"        , ИмяТипа);
	ОписаниеТипа.Вставить("Коллекция"      , ?(ТекИБ = Неопределено,
	                                           Вычислить(ОписаниеТипаКэш.Коллекция),
	                                           ТекИБ.Вычислить(ОписаниеТипаКэш.Коллекция)));
	ОписаниеТипа.Вставить("МетаКоллекция"  , ?(ТекИБ = Неопределено,
	                                           Метаданные[ОписаниеТипаКэш.Коллекция],
	                                           ТекИБ.Метаданные[ОписаниеТипаКэш.Коллекция]));
	ОписаниеТипа.Вставить("Имя"            , ОписаниеТипаКэш.Имя);
	ОписаниеТипа.Вставить("ИмяКоллекции"   , ОписаниеТипаКэш.Коллекция);
	ОписаниеТипа.Вставить("Представление"  , ОписаниеТипаКэш.Представление);
	ОписаниеТипа.Вставить("ПредставлениеМ" , ОписаниеТипаКэш.ПредставлениеМ);
	ОписаниеТипа.Вставить("Конструктор"    , ОписаниеТипаКэш.Конструктор);
	ОписаниеТипа.Вставить("КонструкторАльт", ОписаниеТипаКэш.КонструкторАльт);
	ОписаниеТипа.Вставить("Картинка");
	ОписаниеТипа.Вставить("КартинкаОбъекта");
	
	#Если Клиент Тогда
	ОписаниеТипа.Картинка        = БиблиотекаКартинок[ОписаниеТипаКэш.Картинка];
	ОписаниеТипа.КартинкаОбъекта = БиблиотекаКартинок[ОписаниеТипаКэш.КартинкаОбъекта];
	#КонецЕсли
	
	Возврат ОписаниеТипа;
	
КонецФункции // ОписаниеВидаОбъектов()

// Возвращает соответствие таблиц СУБД объектам 1С
//
// Возвращаемое значение:
//   Соответствие из Структура      - соответствие таблиц СУБД объектам 1С
//     * Ключ           - Строка      - имя таблицы СУБД
//     * Значение       - Структура   - Коллекция метаданных вида объектов (например, Справочники)
//        ** mainObject    - Строка      - имя основной таблицы объекта в 1С
//        ** tableName     - Строка      - имя таблицы в 1С
//        ** Purpose       - Строка      - назначение таблицы в 1С
//
Функция СтруктураХраненияБазыДанных() Экспорт
	
	ТаблицаХранения = ПолучитьСтруктуруХраненияБазыДанных(, Истина); // - ТаблицаЗначений
	
	СтруктураХранения = Новый Соответствие();
	
	Для Каждого ТекСтрока Из ТаблицаХранения Цикл
		
		Назначение = ВРег(ТекСтрока.Назначение);
		
		ЭтоИтоги = (Назначение = "ИТОГИ"
		        ИЛИ Назначение = "TOTALS"
		        ИЛИ Назначение = "ОБОРОТЫ"
		        ИЛИ Назначение = "TURNOVERS");
		
		ОписаниеТаблицы = Новый Структура();
		ОписаниеТаблицы.Вставить("purpose", ТекСтрока.Назначение);
		Если ПустаяСтрока(ТекСтрока.Метаданные) Тогда
			ОсновнойОбъект = ТекСтрока.ИмяТаблицыХранения;
			ИмяТаблицы = ТекСтрока.ИмяТаблицыХранения;
		ИначеЕсли ПустаяСтрока(ТекСтрока.ИмяТаблицы) Тогда
			ОсновнойОбъект = ТекСтрока.Метаданные;
			ИмяТаблицы = ТекСтрока.Метаданные;
		ИначеЕсли Назначение = "ОСНОВНАЯ"
		      ИЛИ Назначение = "MAIN"Тогда
			ОсновнойОбъект = ТекСтрока.ИмяТаблицы;
			ИмяТаблицы = ТекСтрока.ИмяТаблицы;
		ИначеЕсли Назначение = "РЕГИСТРАЦИЯИЗМЕНЕНИЙ"
		      ИЛИ Назначение = "CHANGERECORD"Тогда
			ОсновнойОбъект = ТекСтрока.Метаданные;
			ИмяТаблицы = ТекСтрока.ИмяТаблицы;
		ИначеЕсли Назначение = "РЕГИСТРАЦИЯИЗМЕНЕНИЙКОНСТАНТЫ"
		      ИЛИ Назначение = "CONSTANTSCHANGERECORD"Тогда
			ОсновнойОбъект = ТекСтрока.Метаданные;
			ИмяТаблицы = СтрШаблон("%1.Изменения", ТекСтрока.Метаданные);
		ИначеЕсли ЭтоИтоги Тогда
			ОсновнойОбъект = ТекСтрока.Метаданные;
			ИмяТаблицы = СтрШаблон("%1.%2", ТекСтрока.Метаданные, ТекСтрока.Назначение);
		Иначе
			ЧастиИмени = СтрРазделить(ТекСтрока.ИмяТаблицы, ".");
			ОсновнойОбъект = СтрШаблон("%1.%2", ЧастиИмени[0], ЧастиИмени[1]);
			ИмяТаблицы = ТекСтрока.Метаданные;
		КонецЕсли;
		
		ОписаниеТаблицы.Вставить("mainObject", ОсновнойОбъект);
		ОписаниеТаблицы.Вставить("tableName", ИмяТаблицы);
		
		СтруктураХранения.Вставить(ТекСтрока.ИмяТаблицыХранения, ОписаниеТаблицы);	
		
	КонецЦикла;
	
	Возврат СтруктураХранения;
	
КонецФункции // СтруктураХраненияБазыДанных()

// Проверяет, что переданное значение является объектом регистра или его представлением
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение или его представление
//
// Возвращаемое значение:
//  Булево      - Истина - передан объект регистра или его представление,
//                Ложь   - в противном случае
//
Функция ЭтоОбъектРегистра(Значение) Экспорт
	
	ТипДляПроверки = Неопределено;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура") Тогда
		Если ЕстьТип(Значение) Тогда
			ТипДляПроверки = Значение.__Тип;
		КонецЕсли;
	Иначе
		ТипДляПроверки = ТипЗначения;
	КонецЕсли;
	
	ОписаниеВида = ОписаниеВидаОбъектов(ТипДляПроверки);
	
	Если ОписаниеВида = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КоллекцииРегистров = Новый Соответствие();
	КоллекцииРегистров.Вставить("РегистрСведений"   , Истина);
	КоллекцииРегистров.Вставить("РегистрНакопления" , Истина);
	КоллекцииРегистров.Вставить("РегистрБухгалтерии", Истина);
	КоллекцииРегистров.Вставить("РегистрРасчета"    , Истина);
	
	Возврат (КоллекцииРегистров.Получить(ОписаниеВида.Имя) = Истина);
	
КонецФункции // ЭтоОбъектРегистра()

// Проверяет, что переданное значение является записью регистра или ее представлением
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение или его представление
//
// Возвращаемое значение:
//  Булево      - Истина - передана запись регистра или ее представление
//                Ложь   - в противном случае
//
Функция ЭтоЗаписьРегистра(Значение) Экспорт
	
	Если НЕ ЭтоОбъектРегистра(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	
	ОписаниеВида = ОписаниеВидаОбъектов(ТипЗначения);
	
	Если ОписаниеВида = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЕстьТип(Значение) Тогда
		Возврат (СтрНайти(Значение.__Тип, "Запись.") > 1);
	КонецЕсли;
	
	Возврат (ТипЗначения = Тип(СтрШаблон("%1Запись.%2", ОписаниеВида.Имя, ОписаниеВида.ИмяТипа)));
	
КонецФункции // ЭтоЗаписьРегистра()

// Проверяет, что переданное значение является набором записей регистра или его представлением
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение или его представление
//
// Возвращаемое значение:
//  Булево      - Истина - передан набор записей регистра или его представление,
//                Ложь   - в противном случае
//
Функция ЭтоНаборЗаписейРегистра(Значение) Экспорт
	
	Если НЕ ЭтоОбъектРегистра(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ЕстьТип(Значение) Тогда
		Возврат (СтрНайти(Значение.__Тип, "НаборЗаписей.") > 1);
	КонецЕсли;
	
	ОписаниеВида = ОписаниеВидаОбъектов(ТипЗначения);
	
	Если ОписаниеВида = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (ТипЗначения = Тип(СтрШаблон("%1НаборЗаписей.%2", ОписаниеВида.Имя, ОписаниеВида.ИмяТипа)));
	
КонецФункции // ЭтоНаборЗаписейРегистра()

// Проверяет, что переданное значение является значением ссылочного типа или его представлением
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение или его представление
//
// Возвращаемое значение:
//  Булево      - Истина - передано ссылочное значение или его представление,
//                Ложь   - в противном случае
//
Функция ЭтоЗначениеСсылочногоТипа(Значение) Экспорт
	
	ТипДляПроверки = Неопределено;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура") Тогда
		Если ЕстьТип(Значение) Тогда
			Попытка
				ТипДляПроверки = Тип(Значение.__Тип);
			Исключение
				ТипДляПроверки = Неопределено;
			КонецПопытки;
		КонецЕсли;
	Иначе
		ТипДляПроверки = ТипЗначения;
	КонецЕсли;
	
	ОписаниеМетаданных = КэшМетаданных()[ТипДляПроверки];
	
	Если ОписаниеМетаданных = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СсылочныеКоллекции = Новый Соответствие();
	СсылочныеКоллекции.Вставить("Справочники"            , Истина);
	СсылочныеКоллекции.Вставить("Документы"              , Истина);
	СсылочныеКоллекции.Вставить("Перечисления"           , Истина);
	СсылочныеКоллекции.Вставить("ПланыВидовХарактеристик", Истина);
	СсылочныеКоллекции.Вставить("ПланыСчетов"            , Истина);
	СсылочныеКоллекции.Вставить("ПланыОбмена"            , Истина);
	СсылочныеКоллекции.Вставить("ПланыВидовРасчета"      , Истина);
	СсылочныеКоллекции.Вставить("БизнесПроцессы"         , Истина);
	СсылочныеКоллекции.Вставить("Задачи"                 , Истина);
	
	Возврат (СсылочныеКоллекции.Получить(ОписаниеМетаданных.Коллекция) = Истина);
	
КонецФункции // ЭтоЗначениеСсылочногоТипа()

// Проверяет, что переданное значение является ссылкой на объект или ее представление
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение или его представление
//
// Возвращаемое значение:
//  Булево      - Истина - передано ссылочное значение или его представление,
//                Ложь   - в противном случае
//
Функция ЭтоСсылка(Значение) Экспорт
	
	Если НЕ ЭтоЗначениеСсылочногоТипа(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ЕстьТип(Значение) Тогда
		Возврат (СтрНайти(Значение.__Тип, "Ссылка.") > 1);
	КонецЕсли;
	
	ОписаниеВида = ОписаниеВидаОбъектов(ТипЗначения);
	
	Если ОписаниеВида = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (ТипЗначения = Тип(СтрШаблон("%1Ссылка.%2", ОписаниеВида.Имя, ОписаниеВида.ИмяТипа)));
	
КонецФункции // ЭтоСсылка()

// Проверяет, что переданное значение является ссылочным объектом или его представлением
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение или его представление
//
// Возвращаемое значение:
//  Булево      - Истина - передан ссылочный объект или его представление,
//                Ложь   - в противном случае
//
Функция ЭтоОбъект(Значение) Экспорт
	
	Если НЕ ЭтоЗначениеСсылочногоТипа(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ЕстьТип(Значение) Тогда
		Возврат (СтрНайти(Значение.__Тип, "Объект.") > 1);
	КонецЕсли;
	
	ОписаниеВида = ОписаниеВидаОбъектов(ТипЗначения);
	
	Если ОписаниеВида = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (ТипЗначения = Тип(СтрШаблон("%1Объект.%2", ОписаниеВида.Имя, ОписаниеВида.ИмяТипа)));
	
КонецФункции // ЭтоОбъект()

// Проверяет, что переданное значение является табличной частью или ее представлением
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение или его представление
//
// Возвращаемое значение:
//  Булево      - Истина - передана табличная часть или ее представление,
//                Ложь   - в противном случае
//
Функция ЭтоТабличнаяЧасть(Значение) Экспорт
	
	ТипДляПроверки = Неопределено;
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Структура") Тогда
		Если ЕстьТип(Значение) Тогда
			Попытка
				ТипДляПроверки = Тип(Значение.__Тип);
			Исключение
				ТипДляПроверки = Неопределено;
			КонецПопытки;
		КонецЕсли;
	Иначе
		ТипДляПроверки = ТипЗначения;
	КонецЕсли;
	
	ЧастиТипа = СтрРазделить(ТипДляПроверки, ".", Ложь);
	
	Возврат ЧастиТипа.Количество() = 3 И ВРег(Прав(ЧастиТипа[0], 14)) = "ТАБЛИЧНАЯЧАСТЬ";
	
КонецФункции // ЭтоТабличнаяЧасть()

// Проверяет, что переданное значение является описанием типа
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение или его представление
//
// Возвращаемое значение:
//  Булево      - Истина - передано описание типов
//                Ложь   - в противном случае
//
Функция ЭтоОписаниеТипов(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ЕстьТип(Значение) Тогда
		Возврат (Значение.__Тип = "ОписаниеТипов");
	КонецЕсли;
	
	Если ТипЗначения = Тип("Структура") Тогда
		Возврат (Значение.Свойство("Типы")
		       И Значение.Свойство("КвалификаторыСтроки")
		       И Значение.Свойство("КвалификаторыЧисла")
		       И Значение.Свойство("КвалификаторыДаты"));
	КонецЕсли;
	
	Возврат (ТипЗначения = Тип("ОписаниеТипов"));
	
КонецФункции // ЭтоОписаниеТипов()

// Проверяет, что переданное значение является значением простого типа
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение
//
// Возвращаемое значение:
//  Булево      - Истина - передано значение простого типа
//                Ложь   - в противном случае
//
Функция ЭтоПростойТип(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Возврат (ТипЗначения = Тип("Строка")
	     ИЛИ ТипЗначения = Тип("Число")
	     ИЛИ ТипЗначения = Тип("Булево")
	     ИЛИ ТипЗначения = Тип("ДвоичныеДанные")
	     ИЛИ ТипЗначения = Тип("ХранилищеЗначения")
	     ИЛИ ТипЗначения = Тип("УникальныйИдентификатор")
	     ИЛИ ТипЗначения = Тип("NULL")
	     ИЛИ ТипЗначения = Тип("Неопределено"));
	
КонецФункции // ЭтоПростойТип()

// Проверяет, что переданное значение является коллекцией
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение
//
// Возвращаемое значение:
//  Булево      - Истина - передана коллекция
//                Ложь   - в противном случае
//
Функция ЭтоКоллекция(Значение) Экспорт
	
	ТипЗначения = СтруктураТипЗнч(Значение);
	
	Возврат (ТипЗначения = Тип("Массив")
	     ИЛИ ТипЗначения = Тип("ФиксированныйМассив")
	     ИЛИ ТипЗначения = Тип("Структура")
	     ИЛИ ТипЗначения = Тип("ФиксированнаяСтруктура")
	     ИЛИ ТипЗначения = Тип("Соответствие")
	     ИЛИ ТипЗначения = Тип("ФиксированноеСоответствие")
	     ИЛИ ТипЗначения = Тип("СписокЗначений")
	     ИЛИ ТипЗначения = Тип("ТаблицаЗначений")
	     ИЛИ ТипЗначения = Тип("ДеревоЗначений"));
	
КонецФункции // ЭтоКоллекция()

// Проверяет, что переданное значение является значением одного из типов системы компоновки данных
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение
//
// Возвращаемое значение:
//  Булево      - Истина - передано значение одного из типов системы компоновки данных
//                Ложь   - в противном случае
//
Функция ЭтоЗначениеСКД(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ЕстьТип(Значение) Тогда
		Попытка
			ТипЗначения = Тип(Значение.__Тип);
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Результат = НЕ (ТипыЗначенийСКД().Получить(ТипЗначения) = Неопределено);
	
	// TODO: Обработка нештатной ситуации, когда в конфигурации отсутствует тип значения
	// видимо ошибка переноса отчета из другой конфигурации
	Если НЕ Результат И ПолучитьТипСтрокой(ТипЗначения) = "ПредопределенноеЗначениеКомпоновкиДанных" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ЭтоЗначениеСКД()

// Проверяет, что переданное значение является значением системного перечисления
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение
//
// Возвращаемое значение:
//  Булево      - Истина - передано значение системного перечисления
//                Ложь   - в противном случае
//
Функция ЭтоСистемноеПеречисление(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ЕстьТип(Значение) Тогда
		Попытка
			ТипЗначения = Тип(Значение.__Тип);
		Исключение
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Возврат НЕ СистемныеПеречисления().Получить(ТипЗначения) = Неопределено;
	
КонецФункции // ЭтоСистемноеПеречисление()

// Проверяет, что переданное значение является элементом стиля (Картинка, Цвет, Шрифт, Рамка, Линия)
//
// Параметры:
//  Значение    - Произвольный - проверяемое значение
//
// Возвращаемое значение:
//  Булево      - Истина - передано значение системного перечисления
//                Ложь   - в противном случае
//
Функция ЭтоЭлементСтиля(Значение) Экспорт
	
	ТипЗначения = СтруктураТипЗнч(Значение);
	
	Возврат (ТипЗначения = Тип("Картинка")
	     ИЛИ ТипЗначения = Тип("Цвет")
	     ИЛИ ТипЗначения = Тип("Шрифт")
	     ИЛИ ТипЗначения = Тип("Рамка")
	     ИЛИ ТипЗначения = Тип("Линия"));
	
КонецФункции // ЭтоЭлементСтиля()

// Проверяет существование объекта по ссылке
//
// Параметры:
//  Значение    - ЛюбаяСсылка - ссылка на объект информационной базы
//
// Возвращаемое значение:
//  Булево      - Истина - объект по ссылке существует,
//                Ложь   - в противном случае
//
Функция СсылкаСуществует(Значение) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Значение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОписаниеВида = ОписаниеВидаОбъектов(ТипЗнч(Значение));
	
	Если ОписаниеВида = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |    Таб.Ссылка КАК Ссылка
	                      |ИЗ
	                      |    &ИмяТаблицы КАК Таб
	                      |ГДЕ
	                      |    Таб.Ссылка = &Ссылка");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
	                           "&ИмяТаблицы",
	                           СтрШаблон("%1.%2", ОписаниеВида.Имя, ОписаниеВида.ИмяТипа));
	
	Запрос.УстановитьПараметр("Ссылка", Значение);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции // СсылкаСуществует()

// Возвращает имя пердопределенных данных для переданного значения
// требуется, т.к. в разных версиях различается способ получения имени предопределенных данных
//
// Параметры:
//  Значение        - СправочникСсылка    - Имя значение ссылочного типа (СправочникСсылка, ПеречислениеСсылка и т.п.)
//                    ПеречислениеСсылка
//                    ПланВидовХарактеристикСсылка
//                    ПланВидовРасчетовСсылка
//                    ПланСчетовСсылка
//                    ПланОбменаСсылка
// Возвращаемое значение:
//   Строка    - Имя предопределенных данных, если значение не является предопределенным, возвращается пустая строка
//
Функция ПолучитьИмяПредопределенныхДанных(Значение) Экспорт
	
	ОписаниеМетаданного = КэшМетаданных()[ТипЗнч(Значение)];
	
	Если НЕ ТипЗнч(ОписаниеМетаданного) = Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяКоллекции = ОписаниеМетаданного.Коллекция;
	
	ИмяПредопределенныхДанных = "";
	
	ЕстьПредопределенные = (ИмяКоллекции = "Справочники"
	                    ИЛИ ИмяКоллекции = "ПланыВидовХарактеристик"
	                    ИЛИ ИмяКоллекции = "ПланыВидовРасчетов"
	                    ИЛИ ИмяКоллекции = "ПланыСчетов");
	
	Если ИмяКоллекции = "Перечисления" Тогда
		ИндексЗначения = Перечисления[ОписаниеМетаданного.Имя].Индекс(Значение);
		ИмяПредопределенныхДанных = Метаданные.Перечисления[ОписаниеМетаданного.Имя].ЗначенияПеречисления[ИндексЗначения].Имя;
	ИначеЕсли ИмяКоллекции = "ПланыОбмена" И Значение.ЭтотУзел Тогда
		ИмяПредопределенныхДанных = "ЭтотУзел";
	ИначеЕсли ЕстьПредопределенные Тогда
		ИмяПредопределенныхДанных = Значение.ИмяПредопределенныхДанных;
	КонецЕсли;
	
	Возврат ИмяПредопределенныхДанных;	
	
КонецФункции // ПолучитьИмяПредопределенныхДанных()

// Функция, возвращает строковое представление типа данных
//
// Параметры:
//     ПарамТип  - Тип, Строка - тип данных
//
// Возвращаемое значение:
//     Строка    - строковое представление типа данных
//
Функция ПолучитьТипСтрокой(Знач ПарамТип) Экспорт
	
	МетаТип = Метаданные.НайтиПоТипу(ПарамТип);
	Если НЕ МетаТип = Неопределено Тогда
		 Возврат МетаТип.ПолноеИмя();
	КонецЕсли;
	
	ВремСтрока = СокрЛП(ПарамТип);
	Если СтрНайти(ВремСтрока, " ") = 0 И СтрНайти(ВремСтрока, "-") = 0 Тогда
		Возврат ВремСтрока;
	КонецЕсли;
	
	СтрокаТипа = "";
	ВерхнийРегистр = Истина;
	Для й = 1 По СтрДлина(ВремСтрока) Цикл
		Символ = Сред(ВремСтрока, й, 1);
		Если Символ = " " ИЛИ Символ = "-" Тогда
			ВерхнийРегистр = Истина;
			Продолжить;
		КонецЕсли;
		Если ВерхнийРегистр Тогда
			Символ = ВРег(Символ);
			ВерхнийРегистр = Ложь;
		КонецЕсли;
		СтрокаТипа = СтрокаТипа + Символ;
	КонецЦикла;
	
	Возврат ПроверитьПолучитьСтрокуТипа(СтрокаТипа);
	
КонецФункции // ПолучитьТипСтрокой()

// Преобразует описание типов в структуру
//
// Параметры:
//  ОписаниеТипов            - ОписаниеТипов                - Преобразуемое значение
//
// Возвращаемое значение:
//   Структура                                          - результат преобразования
//     *Типы                          - Массив из Строка  - Список типов
//     *КвалификаторыЧисла            - Структура         - Описание квалификаторов числа
//        **Разрядность                 - Число             - Разрядность
//        **РазрядностьДробнойЧасти     - Число             - Разрядность дробной части
//        **ДопустимыйЗнак              - ДопустимыйЗнак    - Допустимый знак
//     *КвалификаторыСтроки           - Структура         - Описание квалификаторов строки
//        **Длина                       - Число             - Длина
//        **ДопустимаяДлина             - ДопустимаяДлина   - Разрядность дробной части
//     *КвалификаторыДаты             - Структура         - Описание квалификаторов даты
//        **ЧастиДаты                   - ЧастиДаты         - Части даты (Дата / Время)
//     *КвалификаторыДвоичныхДанных   - Структура         - Описание квалификаторов двоичных данных
//        **Длина                       - Число             - Длина
//        **ДопустимаяДлина             - ДопустимаяДлина   - Разрядность дробной части
//
Функция ОписаниеТиповВСтруктуру(ОписаниеТипов) Экспорт
	
	СтруктураОписаниеТипов = Новый Структура();
	СтруктураОписаниеТипов.Вставить("__Тип"                      , "ОписаниеТипов");
	СтруктураОписаниеТипов.Вставить("Типы"                       , Новый Массив());
	СтруктураОписаниеТипов.Вставить("КвалификаторыЧисла",
	                                Новый Структура("Разрядность, РазрядностьДробнойЧасти, ДопустимыйЗнак", 10, 0));
	СтруктураОписаниеТипов.Вставить("КвалификаторыСтроки",
	                                Новый Структура("Длина, ДопустимаяДлина", 10, "Переменная"));
	СтруктураОписаниеТипов.Вставить("КвалификаторыДаты",
	                                Новый Структура("ЧастиДаты", "ДатаВремя"));
	СтруктураОписаниеТипов.Вставить("КвалификаторыДвоичныхДанных",
	                                Новый Структура("Длина, ДопустимаяДлина", 0, "Переменная"));
	
	Для Каждого ТекТип Из ОписаниеТипов.Типы() Цикл
		СтруктураОписаниеТипов.Типы.Добавить(ПолучитьТипСтрокой(ТекТип));
	КонецЦикла;
	
	СтруктураОписаниеТипов.КвалификаторыЧисла.Разрядность             = ОписаниеТипов.КвалификаторыЧисла.Разрядность;
	СтруктураОписаниеТипов.КвалификаторыЧисла.РазрядностьДробнойЧасти =
	    ОписаниеТипов.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	
	Если ОписаниеТипов.КвалификаторыЧисла.ДопустимыйЗнак = ДопустимыйЗнак.Неотрицательный Тогда
		СтруктураОписаниеТипов.КвалификаторыЧисла.ДопустимыйЗнак = "Неотрицательный";
	Иначе
		СтруктураОписаниеТипов.КвалификаторыЧисла.ДопустимыйЗнак = "Любой";
	КонецЕсли;
	
	СтруктураОписаниеТипов.КвалификаторыСтроки.Длина = ОписаниеТипов.КвалификаторыСтроки.Длина;
	
	Если ОписаниеТипов.КвалификаторыСтроки.ДопустимаяДлина = ДопустимаяДлина.Фиксированная Тогда
		СтруктураОписаниеТипов.КвалификаторыСтроки.ДопустимаяДлина = "Фиксированная";
	Иначе
		СтруктураОписаниеТипов.КвалификаторыСтроки.ДопустимаяДлина = "Переменная";
	КонецЕсли;
	
	Если ОписаниеТипов.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
		СтруктураОписаниеТипов.КвалификаторыДаты.ЧастиДаты = "Дата";
	ИначеЕсли ОписаниеТипов.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
		СтруктураОписаниеТипов.КвалификаторыДаты.ЧастиДаты = "Время";
	Иначе
		СтруктураОписаниеТипов.КвалификаторыДаты.ЧастиДаты = "ДатаВремя";
	КонецЕсли;
	
	СтруктураОписаниеТипов.КвалификаторыДвоичныхДанных.Длина = ОписаниеТипов.КвалификаторыДвоичныхДанных.Длина;
	
	Если ОписаниеТипов.КвалификаторыДвоичныхДанных.ДопустимаяДлина = ДопустимаяДлина.Фиксированная Тогда
		СтруктураОписаниеТипов.КвалификаторыДвоичныхДанных.ДопустимаяДлина = "Фиксированная";
	Иначе
		СтруктураОписаниеТипов.КвалификаторыДвоичныхДанных.ДопустимаяДлина = "Переменная";
	КонецЕсли;
	
	Возврат СтруктураОписаниеТипов;
	
КонецФункции // ОписаниеТиповВСтруктуру()

// Получает описание типов из структуры
//
// Параметры:
//   СтруктураОписаниеТипов         - Структура            - структура описания типов для преобразования
//     *Типы                          - Массив            - Список типов
//     *КвалификаторыЧисла            - Структура         - Описание квалификаторов числа
//        **Разрядность                 - Число             - Разрядность
//        **РазрядностьДробнойЧасти     - Число             - Разрядность дробной части
//        **ДопустимыйЗнак              - ДопустимыйЗнак    - Допустимый знак
//     *КвалификаторыСтроки           - Структура         - Описание квалификаторов строки
//        **Длина                       - Число             - Длина
//        **ДопустимаяДлина             - ДопустимаяДлина   - Разрядность дробной части
//     *КвалификаторыДаты             - Структура         - Описание квалификаторов даты
//        **ЧастиДаты                   - ЧастиДаты         - Части даты (Дата / Время)
//     *КвалификаторыДвоичныхДанных   - Структура         - Описание квалификаторов двоичных данных
//        **Длина                       - Число             - Длина
//        **ДопустимаяДлина             - ДопустимаяДлина   - Разрядность дробной части
//
// Возвращаемое значение:
//  ОписаниеТипов            - Созданное описание типов
//
Функция ОписаниеТиповИзСтруктуры(СтруктураОписаниеТипов) Экспорт
	
	Если БезопасныйРежимПД() Тогда
		УстановитьБезопасныйРежим(Истина);
	КонецЕсли;
	
	МассивТипов = Новый Массив();
	
	Для Каждого ТекТип Из СтруктураОписаниеТипов.Типы Цикл
		Попытка
			НовыйТип = Тип(СтрЗаменить(ТекТип, ".", "Ссылка."));
			МассивТипов.Добавить(НовыйТип);
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	ПараметрКвалификатора = Вычислить("ДопустимыйЗнак." + СтруктураОписаниеТипов.КвалификаторыЧисла.ДопустимыйЗнак);
	КвалификаторыЧисла = Новый КвалификаторыЧисла(СтруктураОписаниеТипов.КвалификаторыЧисла.Разрядность,
	                                              СтруктураОписаниеТипов.КвалификаторыЧисла.РазрядностьДробнойЧасти,
	                                              ПараметрКвалификатора);
	
	ПараметрКвалификатора = Вычислить("ДопустимаяДлина." + СтруктураОписаниеТипов.КвалификаторыСтроки.ДопустимаяДлина);
	КвалификаторыСтроки = Новый КвалификаторыСтроки(СтруктураОписаниеТипов.КвалификаторыСтроки.Длина,
	                                                ПараметрКвалификатора);
	
	ПараметрКвалификатора = Вычислить("ЧастиДаты." + СтруктураОписаниеТипов.КвалификаторыДаты.ЧастиДаты);
	КвалификаторыДаты = Новый КвалификаторыДаты(ПараметрКвалификатора);
	
	ПараметрКвалификатора =
		Вычислить("ДопустимаяДлина." + СтруктураОписаниеТипов.КвалификаторыДвоичныхДанных.ДопустимаяДлина);
	КвалификаторыДвоичныхДанных = Новый КвалификаторыДвоичныхДанных(СтруктураОписаниеТипов.КвалификаторыСтроки.Длина,
	                                                                ПараметрКвалификатора);
	
	Возврат Новый ОписаниеТипов(МассивТипов,
	                            КвалификаторыЧисла,
	                            КвалификаторыСтроки,
	                            КвалификаторыДаты,
	                            КвалификаторыДвоичныхДанных);
	
КонецФункции // ОписаниеТиповИзСтруктуры()

#КонецОбласти // ПреобразованияОбъектовСлужебные

#Область ОбработчикиВыгрузкиЗагрузки

// Обертка для совместимости с предыдущими версиями (см. ДобавитьОбработчикПослеВыгрузкиТипа())
//
Процедура ДобавитьПравилоВыгрузкиТипа(Знач ТипИсточника, Знач ПроцедураОбработки, Знач Модуль = Неопределено) Экспорт
	
	ДобавитьОбработчикПослеВыгрузкиТипа(ТипИсточника, ПроцедураОбработки, Модуль);
	
КонецПроцедуры // ДобавитьПравилоВыгрузкиТипа()

// Обертка для совместимости с предыдущими версиями (см. ДобавитьОбработчикПоискаСсылок())
//
Процедура ДобавитьПравилоЗагрузкиТипа(Знач ТипИсточника,
                                      Знач ТипПриемника,
                                      Знач ФункцияПоиска,
                                      Знач Модуль = Неопределено) Экспорт
	
	ДобавитьОбработчикПоискаСсылок(ТипИсточника, ТипПриемника, ФункцияПоиска, Модуль);
	
КонецПроцедуры // ДобавитьПравилоЗагрузкиТипа()

// Функция - возвращает все обработчики данных, выполняемые после сериализации
//
// Возвращаемое значение:
//   Соответствие из Структура       - обработчики после сериализации данных
//     *Ключ            - Строка       - имя типа значения сериализуемых данных
//     *Значение        - Структура
//       **Процедура      - Строка       - имя процедуры обработки данных после сериализации
//       **Модуль         - Модуль       - модуль из которого будет вызвана процедура обработки
//
Функция ОбработчикиПослеВыгрузкиТипов() Экспорт
	
	Если НЕ ТипЗнч(ОбработчикиПослеВыгрузкиТипов) = Тип("Соответствие") Тогда
		ОбработчикиПослеВыгрузкиТипов = Новый Соответствие();
	КонецЕсли;
	
	Возврат ОбработчикиПослеВыгрузкиТипов;
	
КонецФункции // ОбработчикиПослеВыгрузкиТипов()

// Добавляет обработчик, выполняемый после сериализации объекта указанного типа
//
// Параметры:
//    ТипИсточника          - Строка          - имя типа сериализуемого значения
//    ПроцедураОбработки    - Строка          - имя процедуры обработки
//    Модуль                - Произвольный    - модуль, содержащий процедуру обработки,
//                                              Неопределено - процедура будет вызвана
//                                              из модуля обработки (этот модуль)
//
Процедура ДобавитьОбработчикПослеВыгрузкиТипа(Знач ТипИсточника,
                                              Знач ПроцедураОбработки,
                                              Знач Модуль = Неопределено) Экспорт
	
	Если НЕ ТипЗнч(ОбработчикиПослеВыгрузкиТипов) = Тип("Соответствие") Тогда
		ОбработчикиПослеВыгрузкиТипов = Новый Соответствие();
	КонецЕсли;
	
	ТипИсточника = ВРег(ТипИсточника);
	
	Если НЕ ЗначениеЗаполнено(Модуль) Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	ОбработчикиПослеВыгрузкиТипов.Вставить(ТипИсточника, Новый Структура());
	ОбработчикиПослеВыгрузкиТипов[ТипИсточника].Вставить("Процедура", ПроцедураОбработки);
	ОбработчикиПослеВыгрузкиТипов[ТипИсточника].Вставить("Модуль"   , Модуль);
	
КонецПроцедуры // ДобавитьОбработчикПослеВыгрузкиТипа()

// Удаляет обработчик, выполняемый после сериализации объекта указанного типа
//
// Параметры:
//    ТипИсточника    - Строка    - имя типа
//
Процедура УдалитьОбработчикПослеВыгрузкиТипа(Знач ТипИсточника) Экспорт
	
	Если НЕ ТипЗнч(ОбработчикиПослеВыгрузкиТипов) = Тип("Соответствие")
	 ИЛИ ОбработчикиПослеВыгрузкиТипов.Получить(ТипИсточника) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбработчикиПослеВыгрузкиТипов.Удалить(ТипИсточника);
	
КонецПроцедуры // УдалитьОбработчикПослеВыгрузкиТипа()

// Очищает список обработчиков, выполняемых после сериализации объектов
//
Процедура ОчиститьОбработчикиПослеВыгрузкиТипов() Экспорт
	
	ОбработчикиПослеВыгрузкиТипов = Новый Соответствие();
	
КонецПроцедуры // ОчиститьОбработчикиПослеВыгрузкиТипов()

// Функция - возвращает все обработчики поиска ссылок на объекты, выполняемые при десериализации
//
// Возвращаемое значение:
//   Соответствие из Структура       - обработчики поиска ссылок на объекты при десериализации
//     *Ключ            - Строка       - имя типа значения исходных данных
//     *Значение        - Структура
//       **ТипЗначения    - Строка     - имя типа значения целевых данных
//       **Функция        - Строка     - имя функции поиска значения
//       **Модуль         - Строка     - модуль, содержащий функцию поиска,
//                                       Неопределено - функция будет вызвана
//                                       из модуля обработки (этот модуль)
//
Функция ОбработчикиПоискаСсылок() Экспорт
	
	Если НЕ ТипЗнч(ОбработчикиПоискаСсылок) = Тип("Соответствие") Тогда
		ОбработчикиПоискаСсылок = Новый Соответствие();
	КонецЕсли;
	
	Возврат ОбработчикиПоискаСсылок;
	
КонецФункции // ОбработчикиПоискаСсылок()

// Добавляет обработчик поиска ссылок на объекты указанного типа при десериализации
//
// Параметры:
//    ТипИсточника     - Строка          - имя типа десериализуемого значения
//    ТипПриемника     - Строка          - имя типа целевого значения
//    ФункцияПоиска    - Строка          - имя функции поиска значения
//    Модуль           - Произвольный    - модуль, содержащий функцию поиска,
//                                         Неопределено - функция будет вызвана
//                                         из модуля обработки (этот модуль)
//
Процедура ДобавитьОбработчикПоискаСсылок(Знач ТипИсточника,
                                         Знач ТипПриемника = Неопределено,
                                         Знач ФункцияПоиска = Неопределено,
                                         Знач Модуль = Неопределено) Экспорт
	
	Если НЕ ТипЗнч(ОбработчикиПоискаСсылок) = Тип("Соответствие") Тогда
		ОбработчикиПоискаСсылок = Новый Соответствие();
	КонецЕсли;
	
	ТипИсточника = ВРег(ТипИсточника);
	
	Если НЕ ЗначениеЗаполнено(ТипПриемника) Тогда
		ТипПриемника = ТипИсточника;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФункцияПоиска) Тогда
		ФункцияПоиска = "НайтиЗначениеПоОписанию";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Модуль) Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	ОбработчикиПоискаСсылок.Вставить(ТипИсточника, Новый Структура());
	ОбработчикиПоискаСсылок[ТипИсточника].Вставить("ТипЗначения", ТипПриемника);
	ОбработчикиПоискаСсылок[ТипИсточника].Вставить("Функция"    , ФункцияПоиска);
	ОбработчикиПоискаСсылок[ТипИсточника].Вставить("Модуль"     , Модуль);
	
КонецПроцедуры // ДобавитьОбработчикПоискаСсылок()

// Удаляет обработчик поиска ссылок на объекты указанного типа, выполняемый при десериализации
//
// Параметры:
//    ТипИсточника    - Строка    - имя типа
//
Процедура УдалитьОбработчикПоискаСсылок(Знач ТипИсточника) Экспорт
	
	Если НЕ ТипЗнч(ОбработчикиПоискаСсылок) = Тип("Соответствие")
	 ИЛИ ОбработчикиПоискаСсылок.Получить(ТипИсточника) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбработчикиПоискаСсылок.Удалить(ТипИсточника);
	
КонецПроцедуры // УдалитьОбработчикПоискаСсылок()

// Очищает список обработчиков поиска ссылок на объекты, выполняемых при десериализации
//
Процедура ОчиститьОбработчикиПоискаСсылок() Экспорт
	
	ОбработчикиПоискаСсылок = Новый Соответствие();
	
КонецПроцедуры // ОчиститьОбработчикиПоискаСсылок()

// Функция - возвращает все обработчики данных, выполняемые при десериализации до записи объекта
//
// Возвращаемое значение:
//   Соответствие из Структура         - обработчики, выполняемые  после десериализации типов
//     *Ключ            - Строка       - имя типа значения десериализуемых данных
//     *Значение        - Структура
//       **Процедура      - Строка       - имя процедуры обработки данных после десериализации
//       **Модуль         - Модуль       - модуль из которого будет вызвана процедура обработки
//
Функция ОбработчикиПослеЗагрузкиТипов() Экспорт
	
	Если НЕ ТипЗнч(ОбработчикиПослеЗагрузкиТипов) = Тип("Соответствие") Тогда
		ОбработчикиПослеЗагрузкиТипов = Новый Соответствие();
	КонецЕсли;
	
	Возврат ОбработчикиПослеЗагрузкиТипов;
	
КонецФункции // ОбработчикиПослеЗагрузкиТипов()

// Добавляет обработчик, выполняемый после десериализации объекта указанного типа
//
// Параметры:
//    ТипИсточника          - Строка          - имя типа десериализуемого значения
//    ПроцедураОбработки    - Строка          - имя процедуры обработки
//    Модуль                - Произвольный    - модуль, содержащий процедуру
//                                              Неопределено - процедура будет вызвана
//                                              из модуля обработки (этот модуль)
//
Процедура ДобавитьОбработчикПослеЗагрузкиТипа(Знач ТипИсточника,
                                              Знач ПроцедураОбработки,
                                              Знач Модуль = Неопределено) Экспорт
	
	Если НЕ ТипЗнч(ОбработчикиПослеЗагрузкиТипов) = Тип("Соответствие") Тогда
		ОбработчикиПослеЗагрузкиТипов = Новый Соответствие();
	КонецЕсли;
	
	ТипИсточника = ВРег(ТипИсточника);
	
	Если НЕ ЗначениеЗаполнено(Модуль) Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	ОбработчикиПослеЗагрузкиТипов.Вставить(ТипИсточника, Новый Структура());
	ОбработчикиПослеЗагрузкиТипов[ТипИсточника].Вставить("Процедура", ПроцедураОбработки);
	ОбработчикиПослеЗагрузкиТипов[ТипИсточника].Вставить("Модуль"   , Модуль);
	
КонецПроцедуры // ДобавитьОбработчикПослеЗагрузкиТипа()

// Удаляет обработчик, выполняемый после десериализации объекта указанного типа
//
// Параметры:
//    ТипИсточника    - Строка    - имя типа
//
Процедура УдалитьОбработчикПослеЗагрузкиТипа(Знач ТипИсточника) Экспорт
	
	Если НЕ ТипЗнч(ОбработчикиПослеЗагрузкиТипов) = Тип("Соответствие")
	 ИЛИ ОбработчикиПослеЗагрузкиТипов.Получить(ТипИсточника) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбработчикиПослеЗагрузкиТипов.Удалить(ТипИсточника);
	
КонецПроцедуры // УдалитьОбработчикПослеЗагрузкиТипак()

// Очищает список обработчиков, выполняемых после десериализации объектов
//
Процедура ОчиститьОбработчикиПослеЗагрузкиТипов() Экспорт
	
	ОбработчикиПослеЗагрузкиТипов = Новый Соответствие();
	
КонецПроцедуры // ОчиститьОбработчикиПослеЗагрузкиТипов()

// Функция поиска значений по структуре описания (шаблон процедуры поиска)
// Ищет значение по имени предопределенных данных, затем по полному иидентификатору,
// затем по представлению (наименованию)
//
// Параметры:
//   СтруктураЗначения       - Структура           - Структура значения для обработки
//   ПоискПоНаименованию     - Булево              - Истина - если значение не найдено по идентификатору,
//                                                   выполнить поиск по наименованию
//
// Возвращаемое значение:
//   ЛюбаяСсылка            - найденное значение
//
Функция НайтиЗначениеПоОписанию(СтруктураЗначения, Знач ПоискПоНаименованию = Ложь) Экспорт
	
	ОписаниеВида = ОписаниеВидаОбъектов(СтруктураЗначения.__Тип);
	
	МетаОбъект = КэшМетаданных()[СтрШаблон("%1.%2", ОписаниеВида.Имя, ОписаниеВида.ИмяТипа)];

	Коллекция = ОписаниеВида.Коллекция;
	
	Если СтруктураЗначения.Свойство("ИмяПредопределенныхДанных")
	   И ЗначениеЗаполнено(СтруктураЗначения.ИмяПредопределенныхДанных) Тогда
		Если ПредставленияРавны(ОписаниеВида.Имя, "ПланОбмена")
		   И ПредставленияРавны(СтруктураЗначения.ИмяПредопределенныхДанных, "ЭтотУзел") Тогда
			Возврат Коллекция[МетаОбъект.Имя].ЭтотУзел();
		Иначе
			Возврат Коллекция[МетаОбъект.Имя][СтруктураЗначения.ИмяПредопределенныхДанных];
		КонецЕсли;
	Иначе
		Если СтруктураЗначения.Свойство("ИдПолный") Тогда
			ВремСсылка = ЗначениеИзСтрокиВнутр(СтруктураЗначения.ИдПолный);
		ИначеЕсли СтруктураЗначения.Свойство("Ид") Тогда
			ВремСсылка = Коллекция[МетаОбъект.Имя].ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураЗначения.Ид));
		Иначе
			ВремСсылка = Неопределено;
		КонецЕсли;
		Если СсылкаСуществует(ВремСсылка) Тогда
			Возврат ВремСсылка;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоискПоНаименованию Тогда
		ПоискПоНаименованию = (СтруктураЗначения.Свойство("Представление")
		                     И НЕ ПустаяСтрока(СтруктураЗначения.Представление)
		                     И (ПредставленияРавны(ОписаниеВида.Имя, "Справочник")
		                    ИЛИ ПредставленияРавны(ОписаниеВида.Имя, "ПланВидовХарактеристик")
		                    ИЛИ ПредставленияРавны(ОписаниеВида.Имя, "ПланСчетов")
		                    ИЛИ ПредставленияРавны(ОписаниеВида.Имя, "ПланВидовРасчета")
		                    ИЛИ ПредставленияРавны(ОписаниеВида.Имя, "ПланОбмена")
		                    ИЛИ ПредставленияРавны(ОписаниеВида.Имя, "Задача")));
	КонецЕсли;
	
	Если ПоискПоНаименованию Тогда
		
		ВремСсылка = Коллекция[МетаОбъект.Имя].НайтиПоНаименованию(СтруктураЗначения.Представление, Истина); 
		Если НЕ ВремСсылка.Пустая() Тогда
			Возврат ВремСсылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Коллекция[МетаОбъект.Имя].ПустаяСсылка();
	
КонецФункции // НайтиЗначениеПоОписанию()

#КонецОбласти // ОбработчикиВыгрузкиЗагрузки

#Область ПреобразованияОбъектовПоВидам

// Преобразует элемент справочника в структуру
//
// Параметры:
//  Объект              - Произвольный              - преобразуемый объект
//  СписокСвойств       - Строка                    - список допустимых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                    - список исключаемых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                                       - результат преобразования
//     *__Тип                         - Строка         - тип СправочникОбъект.<Имя справочника>
//     *Ссылка                        - Структура      - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_                     - Произвольный   - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_           - Структура      - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//
Функция СправочникВСтруктуру(Объект, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = Объект.Метаданные();
	
	Если НЕ ТипЗнч(Объект) = Тип(СтрШаблон("СправочникОбъект.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("СправочникОбъект.%1", МетаОбъект.Имя));
	
	Если Объект.Ссылка.Пустая() Тогда
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.ПолучитьСсылкуНового()));
	Иначе
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.Ссылка));
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ПометкаУдаления", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ЭтоГруппа", СписокСвойств, ИсключаяСвойства);
	
	СтруктураОбъекта.Вставить("Родитель", Неопределено);
	Если МетаОбъект.Иерархический Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Родитель", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Владелец", Неопределено);
	Если МетаОбъект.Владельцы.Количество() > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Владелец", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Код", Неопределено);
	Если МетаОбъект.ДлинаКода > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Код", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Наименование", Неопределено);
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Наименование", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		Если НЕ СвойствоИерархическогоОбъектаИспользуется(Объект, ТекРеквизит, МетаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекРеквизит.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		Если НЕ СвойствоИерархическогоОбъектаИспользуется(Объект, ТекТЧ, МетаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		ТЧОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекТЧ.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(Объект, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // СправочникВСтруктуру()

// Заполняет справочник из структуры
//
// Параметры:
//  Объект                  - Произвольный       - заполняемый объект
//  СтруктураОбъекта        - Структура          - данные для заполнения объекта
//     *Ссылка                - Структура          - Описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_             - Произвольный       - Значения реквизитов объекта
//     *_ИмяТабличнойЧасти_   - Структура          - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//  СписокСвойств           - Строка             - список допустимых свойств
//                            Массив из Строка     (если пустой, то допустимы все свойства)
//  ИсключаяСвойства        - Строка             - список исключаемых свойств
//                            Массив из Строка     (если пустой, то допустимы все свойства)
//
Процедура СправочникИзСтруктуры(Объект,
                                СтруктураОбъекта,
                                СписокСвойств = Неопределено,
                                ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = Объект.Метаданные();
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "ПометкаУдаления",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	
	Если МетаОбъект.Иерархический Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Родитель",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.Владельцы.Количество() > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Владелец",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.ДлинаКода > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Код",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Наименование",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		Если НЕ СвойствоИерархическогоОбъектаИспользуется(Объект, ТекРеквизит, МетаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           ТекРеквизит.Имя,
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		Если НЕ СвойствоИерархическогоОбъектаИспользуется(Объект, ТекТЧ, МетаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		ТЧОбъектаИзСтруктуры(Объект,
		                     СтруктураОбъекта,
		                     ТекТЧ.Имя,
		                     СписокСвойств,
		                     ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(Объект, СтруктураОбъекта);
	
КонецПроцедуры // СправочникИзСтруктуры()

// Преобразует счет в структуру
//
// Параметры:
//  Объект              - Произвольный              - преобразуемый объект
//  СписокСвойств       - Строка                    - список допустимых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                    - список исключаемых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                                 - результат преобразования
//     *__Тип                   - Строка         - тип ПланСчетовОбъект.<Имя справочника>
//     *Ссылка                  - Структура      - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_               - Произвольный   - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_     - Структура      - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//
Функция ПланСчетовВСтруктуру(Объект, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = Объект.Метаданные();
	
	Если НЕ ТипЗнч(Объект) = Тип(СтрШаблон("ПланСчетовОбъект.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("ПланСчетовОбъект.%1", МетаОбъект.Имя));
	
	Если Объект.Ссылка.Пустая() Тогда
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.ПолучитьСсылкуНового()));
	Иначе
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.Ссылка));
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ПометкаУдаления", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Забалансовый", СписокСвойств, ИсключаяСвойства);
	
	Если ИспользоватьСвойство("Вид", СписокСвойств, ИсключаяСвойства) Тогда
		Если Объект.Вид = ВидСчета.Активный Тогда
			СтруктураОбъекта.Вставить("Вид", "Активный");
		ИначеЕсли Объект.Вид = ВидСчета.Пассивный Тогда
			СтруктураОбъекта.Вставить("Вид", "Пассивный");
		Иначе
			СтруктураОбъекта.Вставить("Вид", "АктивноПассивный");
		КонецЕсли;
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Родитель", СписокСвойств, ИсключаяСвойства);
	
	СтруктураОбъекта.Вставить("Код", Неопределено);
	Если МетаОбъект.ДлинаКода > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Код", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Порядок", Неопределено);
	Если МетаОбъект.ДлинаПорядка > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Порядок", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Наименование", Неопределено);
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Наименование", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	Для Каждого ТекПризнак Из МетаОбъект.ПризнакиУчета Цикл
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекПризнак.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	СтруктураОбъекта.Вставить("ВидыСубконто", Новый Массив());
	Если ИспользоватьСвойство("ВидыСубконто", СписокСвойств, ИсключаяСвойства)
	   И МетаОбъект.МаксКоличествоСубконто > 0 Тогда
		й = 1;
		Для Каждого ТекСтрока Из Объект.ВидыСубконто Цикл
			ОписаниеСубконто = Новый Структура();
			ОписаниеСубконто.Вставить("НомерСтроки", й);
			ОписаниеСубконто.Вставить("ВидСубконто", ЗначениеВСтруктуру(ТекСтрока.ВидСубконто));
			ОписаниеСубконто.Вставить("ТолькоОбороты", ТекСтрока.ТолькоОбороты);
			
			Для Каждого ТекПризнак Из МетаОбъект.ПризнакиУчетаСубконто Цикл
				ОписаниеСубконто.Вставить(ТекПризнак.Имя, ТекСтрока[ТекПризнак.Имя]);
			КонецЦикла;
			СтруктураОбъекта.ВидыСубконто.Добавить(ОписаниеСубконто);
			й = й + 1;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекРеквизит.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекТЧ.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(Объект, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПланСчетовВСтруктуру()

// Заполняет счет из структуры
//
// Параметры:
//  Объект                  - Произвольный          - заполняемый объект
//  СтруктураОбъекта        - Структура             - данные для заполнения объекта
//     *Ссылка                - Структура             - Описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_             - Произвольный          - Значения реквизитов объекта
//     *_ИмяТабличнойЧасти_   - Структура             - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//  СписокСвойств             - Строка              - список допустимых свойств
//                              Массив из Строка      (если пустой, то допустимы все свойства)
//  ИсключаяСвойства          - Строка              - список исключаемых свойств
//                              Массив из Строка      (если пустой, то допустимы все свойства)
//
Процедура ПланСчетовИзСтруктуры(Объект,
                                СтруктураОбъекта,
                                СписокСвойств = Неопределено,
                                ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = Объект.Метаданные();
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "ПометкаУдаления",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "Забалансовый",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	Если ИспользоватьСвойство("Вид", СписокСвойств, ИсключаяСвойства) Тогда
		Если БезопасныйРежимПД() Тогда
			УстановитьБезопасныйРежим(Истина);
		КонецЕсли;
		Объект.Вид = Вычислить("ВидСчета." + СтруктураОбъекта.Вид);
	КонецЕсли;
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "Родитель",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	
	Если МетаОбъект.ДлинаКода > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Код",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.ДлинаПорядка > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Порядок",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Наименование",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Для Каждого ТекПризнак Из МетаОбъект.ПризнакиУчета Цикл
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           ТекПризнак.Имя,
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЦикла;
	
	ЕстьСубконто = (СтруктураОбъекта.Свойство("ВидыСубконто")
	              И ИспользоватьСвойство("ВидыСубконто", СписокСвойств, ИсключаяСвойства)
	              И МетаОбъект.МаксКоличествоСубконто > 0);
	
	Если ЕстьСубконто Тогда
		Объект.ВидыСубконто.Очистить();
		Для Каждого ТекСтрока Из СтруктураОбъекта.ВидыСубконто Цикл
			Если Объект.ВидыСубконто.Количество() >= МетаОбъект.МаксКоличествоСубконто Тогда
				Прервать;
			КонецЕсли;
			НоваяСтрока = Объект.ВидыСубконто.Добавить();
			НоваяСтрока.ВидСубконто		= ЗначениеИзСтруктуры(ТекСтрока.ВидСубконто);
			НоваяСтрока.ТолькоОбороты	= ТекСтрока.ТолькоОбороты;
			
			Для Каждого ТекПризнак Из МетаОбъект.ПризнакиУчетаСубконто Цикл
				Если НЕ ТекСтрока.Свойство(ТекПризнак.Имя) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока[ТекПризнак.Имя] = ТекСтрока[ТекПризнак.Имя];
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           ТекРеквизит.Имя,
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаИзСтруктуры(Объект,
		                     СтруктураОбъекта,
		                     ТекТЧ.Имя,
		                     СписокСвойств,
		                     ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(Объект, СтруктураОбъекта);
	
КонецПроцедуры // ПланСчетовИзСтруктуры()

// Преобразует элемент плана видов характеристик в структуру
//
// Параметры:
//  Объект              - Произвольный              - преобразуемый объект
//  СписокСвойств       - Строка                    - список допустимых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                    - список исключаемых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                                   - результат преобразования
//     *__Тип                   - Строка           - тип ПланВидовХарактеристикОбъект.<Имя справочника>
//     *Ссылка                  - Структура        - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_               - Произвольный     - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_     - Структура        - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//
Функция ПланВидовХарактеристикВСтруктуру(Объект, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = Объект.Метаданные();
	
	Если НЕ ТипЗнч(Объект) = Тип(СтрШаблон("ПланВидовХарактеристикОбъект.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("ПланВидовХарактеристикОбъект.%1", МетаОбъект.Имя));
	
	Если Объект.Ссылка.Пустая() Тогда
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.ПолучитьСсылкуНового()));
	Иначе
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.Ссылка));
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ПометкаУдаления", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ЭтоГруппа", СписокСвойств, ИсключаяСвойства);
	
	СтруктураОбъекта.Вставить("Родитель", Неопределено);
	Если МетаОбъект.Иерархический Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Родитель", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Код", Неопределено);
	Если МетаОбъект.ДлинаКода > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Код", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Наименование", Неопределено);
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Наименование", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("ТипЗначения", ОписаниеТиповВСтруктуру(Объект.ТипЗначения));
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		Если НЕ СвойствоИерархическогоОбъектаИспользуется(Объект, ТекРеквизит) Тогда
			Продолжить;
		КонецЕсли;
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекРеквизит.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		Если НЕ СвойствоИерархическогоОбъектаИспользуется(Объект, ТекТЧ) Тогда
			Продолжить;
		КонецЕсли;
		ТЧОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекТЧ.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(Объект, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПланВидовХарактеристикВСтруктуру()

// Заполняет элемент плана вида характеристик из структуры
//
// Параметры:
//  Объект                   - Произвольный        - заполняемый объект
//  СтруктураОбъекта         - Структура           - данные для заполнения объекта
//     *Ссылка                 - Структура           - Описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_              - Произвольный        - Значения реквизитов объекта
//     *_ИмяТабличнойЧасти_    - Структура           - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//  СписокСвойств        - Строка                  - список допустимых свойств
//                         Массив из Строка          (если пустой, то допустимы все свойства)
//  ИсключаяСвойства     - Строка                  - список исключаемых свойств
//                         Массив из Строка          (если пустой, то допустимы все свойства)
//
Процедура ПланВидовХарактеристикИзСтруктуры(Объект,
                                            СтруктураОбъекта,
                                            СписокСвойств = Неопределено,
                                            ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = Объект.Метаданные();
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "ПометкаУдаления",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	
	Если МетаОбъект.Иерархический Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Родитель",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.ДлинаКода > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Код",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Наименование",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если СтруктураОбъекта.ТипЗначения.Типы.Количество() > 0 Тогда
		Объект.ТипЗначения = ОписаниеТиповИзСтруктуры(СтруктураОбъекта.ТипЗначения);
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		Если НЕ СвойствоИерархическогоОбъектаИспользуется(Объект, ТекРеквизит, МетаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           ТекРеквизит.Имя,
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		Если НЕ СвойствоИерархическогоОбъектаИспользуется(Объект, ТекТЧ, МетаОбъект) Тогда
			Продолжить;
		КонецЕсли;
		ТЧОбъектаИзСтруктуры(Объект,
		                     СтруктураОбъекта,
		                     ТекТЧ.Имя,
		                     СписокСвойств,
		                     ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(Объект, СтруктураОбъекта);
	
КонецПроцедуры // ПланВидовХарактеристикИзСтруктуры()

// Преобразует вид расчета в структуру
//
// Параметры:
//  Объект              - Произвольный              - преобразуемый объект
//  СписокСвойств       - Строка                    - список допустимых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                    - список исключаемых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                                  - результат преобразования
//     *__Тип                  - Строка           - тип ПланВидовРасчетаОбъект.<Имя справочника>
//     *Ссылка                 - Структура        - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_              - Произвольный     - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_    - Структура        - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//
Функция ПланВидовРасчетаВСтруктуру(Объект, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = Объект.Метаданные();
	
	Если НЕ ТипЗнч(Объект) = Тип(СтрШаблон("ПланВидовРасчетаОбъект.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("ПланВидовРасчетаОбъект.%1", МетаОбъект.Имя));
	
	Если Объект.Ссылка.Пустая() Тогда
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.ПолучитьСсылкуНового()));
	Иначе
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.Ссылка));
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ПометкаУдаления", СписокСвойств, ИсключаяСвойства);
	
	СтруктураОбъекта.Вставить("БазовыеВидыРасчета", Новый Массив());
	Если НЕ МетаОбъект.ЗависимостьОтВидовРасчета = Метаданные.СвойстваОбъектов.ИспользованиеБазыПланаВидовРасчета.НеИспользовать
	   И ИспользоватьСвойство("БазовыеВидыРасчета", СписокСвойств, ИсключаяСвойства) Тогда
		Для Каждого ТекВР Из Объект.БазовыеВидыРасчета Цикл
			СтруктураОбъекта.БазовыеВидыРасчета.Добавить(ЗначениеВСтруктуру(ТекВР.ВидРасчета));
		КонецЦикла;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("ВедущиеВидыРасчета", Новый Массив());
	Если ИспользоватьСвойство("ВедущиеВидыРасчета", СписокСвойств, ИсключаяСвойства) Тогда
		Для Каждого ТекВР Из Объект.ВедущиеВидыРасчета Цикл
			СтруктураОбъекта.ВедущиеВидыРасчета.Добавить(ЗначениеВСтруктуру(ТекВР.ВидРасчета));
		КонецЦикла;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("ВытесняющиеВидыРасчета", Новый Массив());
	Если МетаОбъект.ИспользованиеПериодаДействия
	   И ИспользоватьСвойство("ВытесняющиеВидыРасчета", СписокСвойств, ИсключаяСвойства) Тогда
		Для Каждого ТекВР Из Объект.ВытесняющиеВидыРасчета Цикл
			СтруктураОбъекта.ВытесняющиеВидыРасчета.Добавить(ЗначениеВСтруктуру(ТекВР.ВидРасчета));
		КонецЦикла;
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ПериодДействияБазовый", СписокСвойств, ИсключаяСвойства);
	
	СтруктураОбъекта.Вставить("Код", Неопределено);
	Если МетаОбъект.ДлинаКода > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Код", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	СтруктураОбъекта.Вставить("Наименование", Неопределено);
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Наименование", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекРеквизит.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекТЧ.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(Объект, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПланВидовРасчетаВСтруктуру()

// Заполняет вид расчета из структуры
//
// Параметры:
//  Объект                   - Произвольный        - заполняемый объект
//  СтруктураОбъекта         - Структура           - данные для заполнения объекта
//     *Ссылка                 - Структура           - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_              - Произвольный        - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_    - Структура           - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//  СписокСвойств            - Строка              - список допустимых свойств
//                             Массив из Строка      (если пустой, то допустимы все свойства)
//  ИсключаяСвойства         - Строка              - список исключаемых свойств
//                             Массив из Строка      (если пустой, то допустимы все свойства)
//
Процедура ПланВидовРасчетаИзСтруктуры(Объект,
                                      СтруктураОбъекта,
                                      СписокСвойств = Неопределено,
                                      ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = Объект.Метаданные();
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "ПометкаУдаления",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	
	Если НЕ МетаОбъект.ЗависимостьОтВидовРасчета =
	     Метаданные.СвойстваОбъектов.ИспользованиеБазыПланаВидовРасчета.НеИспользовать
	   И ИспользоватьСвойство("БазовыеВидыРасчета", СписокСвойств, ИсключаяСвойства) Тогда
		Объект.БазовыеВидыРасчета.Очистить();
		Для Каждого ТекВР Из СтруктураОбъекта.БазовыеВидыРасчета Цикл
			ВремВР = ЗначениеИзСтруктуры(ТекВР);
			Если НЕ ЗначениеЗаполнено(ВремВР) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Объект.БазовыеВидыРасчета.Добавить();
			НоваяСтрока.ВидРасчета = ВремВР;
		КонецЦикла;
	КонецЕсли;
	
	Если ИспользоватьСвойство("ВедущиеВидыРасчета", СписокСвойств, ИсключаяСвойства) Тогда
		Объект.ВедущиеВидыРасчета.Очистить();
		Для Каждого ТекВР Из СтруктураОбъекта.ВедущиеВидыРасчета Цикл
			ВремВР = ЗначениеИзСтруктуры(ТекВР);
			Если НЕ ЗначениеЗаполнено(ВремВР) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Объект.ВедущиеВидыРасчета.Добавить();
			НоваяСтрока.ВидРасчета = ВремВР;
		КонецЦикла;
	КонецЕсли;
	
	Если МетаОбъект.ИспользованиеПериодаДействия
	   И ИспользоватьСвойство("ВытесняющиеВидыРасчета", СписокСвойств, ИсключаяСвойства) Тогда
		Объект.ВытесняющиеВидыРасчета.Очистить();
		Для Каждого ТекВР Из СтруктураОбъекта.ВытесняющиеВидыРасчета Цикл
			ВремВР = ЗначениеИзСтруктуры(ТекВР);
			Если НЕ ЗначениеЗаполнено(ВремВР) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Объект.ВытесняющиеВидыРасчета.Добавить();
			НоваяСтрока.ВидРасчета = ВремВР;
		КонецЦикла;
	КонецЕсли;
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "ПериодДействияБазовый",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	
	Если МетаОбъект.ДлинаКода > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Код",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Наименование",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           ТекРеквизит.Имя,
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаИзСтруктуры(Объект,
		                     СтруктураОбъекта,
		                     ТекТЧ.Имя,
		                     СписокСвойств,
		                     ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(Объект, СтруктураОбъекта);
	
КонецПроцедуры // ПланВидовРасчетаИзСтруктуры()

// Преобразует узел обмена в структуру
//
// Параметры:
//  Объект              - Произвольный        - преобразуемый объект
//  СписокСвойств       - Строка              - список допустимых свойств
//                        Массив из Строка      (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка              - список исключаемых свойств
//                        Массив из Строка      (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                                  - результат преобразования
//     *__Тип                  - Строка           - тип ПланОбменаОбъект.<Имя справочника>
//     *Ссылка                 - Структура        - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_              - Произвольный     - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_    - Структура        - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//
Функция ПланОбменаВСтруктуру(Объект, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = Объект.Метаданные();
	
	Если НЕ ТипЗнч(Объект) = Тип(СтрШаблон("ПланОбменаОбъект.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("ПланОбменаОбъект.%1", МетаОбъект.Имя));
	
	Если Объект.Ссылка.Пустая() Тогда
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.ПолучитьСсылкуНового()));
	Иначе
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.Ссылка));
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ПометкаУдаления", СписокСвойств, ИсключаяСвойства);
	
	// совместимость с версиями < 8.3.5
	Попытка
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ЭтотУзел", СписокСвойств, ИсключаяСвойства);
	Исключение
		Если ИспользоватьСвойство("ЭтотУзел", СписокСвойств, ИсключаяСвойства) Тогда
			Если Объект.Ссылка.Пустая() Тогда
				СтруктураОбъекта.Вставить("ЭтотУзел", ПланыОбмена[МетаОбъект.Имя].ЭтотУзел() = Объект.ПолучитьСсылкуНового());
			Иначе
				СтруктураОбъекта.Вставить("ЭтотУзел", ПланыОбмена[МетаОбъект.Имя].ЭтотУзел() = Объект.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецПопытки;
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "НомерОтправленного", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "НомерПринятого", СписокСвойств, ИсключаяСвойства);
	
	СтруктураОбъекта.Вставить("Код", Неопределено);
	Если МетаОбъект.ДлинаКода > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Код", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Наименование", Неопределено);
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Наименование", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекРеквизит.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекТЧ.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(Объект, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПланОбменаВСтруктуру()

// Заполняет узел плана обмена из структуры
//
// Параметры:
//  Объект                    - Произвольный        - заполняемый объект
//  СтруктураОбъекта          - Структура           - данные для заполнения объекта
//     *Ссылка                  - Структура           - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_               - Произвольный        - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_     - Структура           - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//  СписокСвойств             - Строка              - список допустимых свойств
//                              Массив из Строка      (если пустой, то допустимы все свойства)
//  ИсключаяСвойства          - Строка              - список исключаемых свойств
//                              Массив из Строка      (если пустой, то допустимы все свойства)
//
Процедура ПланОбменаИзСтруктуры(Объект,
                                СтруктураОбъекта,
                                СписокСвойств = Неопределено,
                                ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = Объект.Метаданные();
	
	СвойствоОбъектаИзСтруктуры(Объект, СтруктураОбъекта, "ПометкаУдаления", СписокСвойств, ИсключаяСвойства);
	
	СвойствоОбъектаИзСтруктуры(Объект, СтруктураОбъекта, "ЭтотУзел", СписокСвойств, ИсключаяСвойства);
	
	Если НЕ Объект.ЭтотУзел Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "НомерОтправленного",
		                           СписокСвойств,
		                           ИсключаяСвойства);
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "НомерПринятого",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.ДлинаКода > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Код",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Наименование",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           ТекРеквизит.Имя,
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаИзСтруктуры(Объект,
		                     СтруктураОбъекта,
		                     ТекТЧ.Имя,
		                     СписокСвойств,
		                     ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(Объект, СтруктураОбъекта);
	
КонецПроцедуры // ПланОбменаИзСтруктуры()

// Преобразует документ в структуру
//
// Параметры:
//  Объект              - Произвольный             - преобразуемый объект
//  СписокСвойств       - Строка                   - список допустимых свойств
//                        Массив из Строка           (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                   - список исключаемых свойств
//                        Массив из Строка           (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                                  - результат преобразования
//     *Ссылка                 - Структура        - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_              - Произвольный     - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_    - Структура        - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//
Функция ДокументВСтруктуру(Объект, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = Объект.Метаданные();
	
	Если НЕ ТипЗнч(Объект) = Тип(СтрШаблон("ДокументОбъект.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("ДокументОбъект.%1", МетаОбъект.Имя));
	
	Если Объект.Ссылка.Пустая() Тогда
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.ПолучитьСсылкуНового()));
	Иначе
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.Ссылка));
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ПометкаУдаления", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Проведен", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Дата", СписокСвойств, ИсключаяСвойства);
	
	СтруктураОбъекта.Вставить("Номер", Неопределено);
	// TODO: Тут еще нужно проверить использование нумератора
	Если МетаОбъект.ДлинаНомера > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Номер", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекРеквизит.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекТЧ.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	Если ИспользоватьСвойство("Движения", СписокСвойств, ИсключаяСвойства) Тогда
		СтруктураОбъекта.Вставить("Движения", ДвиженияДокументаВСтруктуру(Объект, СписокСвойств, ИсключаяСвойства));
	КонецЕсли;
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(Объект, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ДокументВСтруктуру()

// Заполняет документ из структуры
//
// Параметры:
//  Объект                    - Произвольный       - заполняемый объект
//  СтруктураОбъекта          - Структура          - данные для заполнения объекта
//     *Ссылка                  - Структура          - Описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_               - Произвольный       - Значения реквизитов объекта
//     *_ИмяТабличнойЧасти_     - Структура          - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//  СписокСвойств             - Строка             - список допустимых свойств
//                              Массив из Строка     (если пустой, то допустимы все свойства)
//  ИсключаяСвойства          - Строка             - список исключаемых свойств
//                              Массив из Строка     (если пустой, то допустимы все свойства)
//
Процедура ДокументИзСтруктуры(Объект,
                              СтруктураОбъекта,
                              СписокСвойств = Неопределено,
                              ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = Объект.Метаданные();
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "ПометкаУдаления",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "Проведен",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "Дата",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	
	// TODO: Тут еще нужно проверить использование нумератора
	Если МетаОбъект.ДлинаНомера > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Номер",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           ТекРеквизит.Имя,
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаИзСтруктуры(Объект,
		                     СтруктураОбъекта,
		                     ТекТЧ.Имя,
		                     СписокСвойств,
		                     ИсключаяСвойства);
	КонецЦикла;
	
	Если ИспользоватьСвойство("Движения", СписокСвойств, ИсключаяСвойства) И СтруктураОбъекта.Свойство("Движения") Тогда
		ДвиженияДокументаИзСтруктуры(Объект,
		                             СтруктураОбъекта.Движения,
		                             СписокСвойств,
		                             ИсключаяСвойства);
	КонецЕсли;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(Объект, СтруктураОбъекта);
	
КонецПроцедуры // ДокументИзСтруктуры()

// Преобразует бизнес-процесс в структуру
//
// Параметры:
//   Объект              - Произвольный              - преобразуемый объект
//   СписокСвойств       - Строка                    - список допустимых свойств
//                         Массив из Строка            (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка                    - список исключаемых свойств
//                         Массив из Строка            (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                                       - результат преобразования
//     *Ссылка                        - Структура      - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_                     - Произвольный   - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_           - Структура      - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//
Функция БизнесПроцессВСтруктуру(Объект, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = Объект.Метаданные();
	
	Если НЕ ТипЗнч(Объект) = Тип(СтрШаблон("БизнесПроцессОбъект.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("БизнесПроцессОбъект.%1", МетаОбъект.Имя));
	
	Если Объект.Ссылка.Пустая() Тогда
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.ПолучитьСсылкуНового()));
	Иначе
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.Ссылка));
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ПометкаУдаления", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Дата", СписокСвойств, ИсключаяСвойства);
	
	СтруктураОбъекта.Вставить("Номер", Неопределено);
	Если МетаОбъект.ДлинаНомера > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Номер", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Стартован", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Завершен", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ВедущаяЗадача", СписокСвойств, ИсключаяСвойства);
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекРеквизит.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекТЧ.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(Объект, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // БизнесПроцессВСтруктуру()

// Заполняет бизнес-процесс из структуры
//
// Параметры:
//   Объект               - Произвольный              - заполняемый объект
//   СтруктураОбъекта     - Структура                 - данные для заполнения объекта
//     *Ссылка                        - Структура       - Описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_                     - Произвольный    - Значения реквизитов объекта
//     *_ИмяТабличнойЧасти_           - Структура       - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//   СписокСвойств        - Строка                   - список допустимых свойств
//                          Массив из Строка           (если пустой, то допустимы все свойства)
//   ИсключаяСвойства     - Строка                   - список исключаемых свойств
//                          Массив из Строка           (если пустой, то допустимы все свойства)
//
Процедура БизнесПроцессИзСтруктуры(Объект,
                                   СтруктураОбъекта,
                                   СписокСвойств = Неопределено,
                                   ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = Объект.Метаданные();
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "ПометкаУдаления",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "Дата",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	
	Если МетаОбъект.ДлинаНомера > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Номер",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "Стартован",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "Завершен",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "ВедущаяЗадача",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           ТекРеквизит.Имя,
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаИзСтруктуры(Объект,
		                     СтруктураОбъекта,
		                     ТекТЧ.Имя,
		                     СписокСвойств,
		                     ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(Объект, СтруктураОбъекта);
	
КонецПроцедуры // БизнесПроцессИзСтруктуры()

// Преобразует задачу в структуру
//
// Параметры:
//   Объект              - Произвольный              - преобразуемый объект
//   СписокСвойств       - Строка                    - список допустимых свойств
//                         Массив из Строка            (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка                    - список исключаемых свойств
//                         Массив из Строка            (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                               - результат преобразования
//     *Ссылка               - Структура       - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_            - Произвольный    - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_  - Структура       - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//
Функция ЗадачаВСтруктуру(Объект, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = Объект.Метаданные();
	
	Если НЕ ТипЗнч(Объект) = Тип(СтрШаблон("ЗадачаОбъект.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("ЗадачаОбъект.%1", МетаОбъект.Имя));
	
	Если Объект.Ссылка.Пустая() Тогда
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.ПолучитьСсылкуНового()));
	Иначе
		СтруктураОбъекта.Вставить("Ссылка", ЗначениеВСтруктуру(Объект.Ссылка));
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ПометкаУдаления", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Дата", СписокСвойств, ИсключаяСвойства);
	
	СтруктураОбъекта.Вставить("Номер", Неопределено);
	Если МетаОбъект.ДлинаНомера > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Номер", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Наименование", Неопределено);
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Наименование", СписокСвойств, ИсключаяСвойства);
	КонецЕсли;
	
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "БизнесПроцесс", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "Выполнена", СписокСвойств, ИсключаяСвойства);
	СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, "ТочкаМаршрута", СписокСвойств, ИсключаяСвойства);
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекРеквизит.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаВСтруктуру(СтруктураОбъекта, Объект, ТекТЧ.Имя, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(Объект, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ЗадачаВСтруктуру()

// Заполняет задачу из структуры
//
// Параметры:
//   Объект                    - Произвольный        - заполняемый объект
//   СтруктураОбъекта          - Структура           - данные для заполнения объекта
//     *Ссылка                  - Структура            - описание ссылки на объект (см. СсылкаВСтруктуру())
//     *_ИмяПоля_               - Произвольный         - значения реквизитов объекта
//     *_ИмяТабличнойЧасти_     - Структура            - содержимое табличной части (см. ТЧОбъектаВСтруктуру())
//   СписокСвойств       - Строка                    - список допустимых свойств
//                         Массив из Строка            (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка                    - список исключаемых свойств
//                         Массив из Строка            (если пустой, то допустимы все свойства)
//
Процедура ЗадачаИзСтруктуры(Объект,
                            СтруктураОбъекта,
                            СписокСвойств = Неопределено,
                            ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = Объект.Метаданные();
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "ПометкаУдаления",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "Дата",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	
	Если МетаОбъект.ДлинаНомера > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Номер",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	Если МетаОбъект.ДлинаНаименования > 0 Тогда
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           "Наименование",
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЕсли;
	
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "БизнесПроцесс",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "Выполнена",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	СвойствоОбъектаИзСтруктуры(Объект,
	                           СтруктураОбъекта,
	                           "ТочкаМаршрута",
	                           СписокСвойств,
	                           ИсключаяСвойства);
	
	Для Каждого ТекРеквизит Из МетаОбъект.Реквизиты Цикл
		СвойствоОбъектаИзСтруктуры(Объект,
		                           СтруктураОбъекта,
		                           ТекРеквизит.Имя,
		                           СписокСвойств,
		                           ИсключаяСвойства);
	КонецЦикла;
	
	Для Каждого ТекТЧ Из МетаОбъект.ТабличныеЧасти Цикл
		ТЧОбъектаИзСтруктуры(Объект,
		                     СтруктураОбъекта,
		                     ТекТЧ.Имя,
		                     СписокСвойств,
		                     ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(Объект, СтруктураОбъекта);
	
КонецПроцедуры // ЗадачаИзСтруктуры()

// Преобразует набор записей регистра сведений в структуру
//
// Параметры:
//   НаборЗаписей        - РегистрСведенийНаборЗаписей    - набор записей регистра сведений для преобразования
//   СписокСвойств       - Строка                         - список допустимых свойств
//                         Массив из Строка                 (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка                         - список исключаемых свойств
//                         Массив из Строка                 (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                              - результат преобразования
//     *Отбор          - Структура            - Описание отбора записей регистра
//        **_ИмяПоля_    - Произвольный         - Значение отбора
//     *Записи         - Массив из Структура  - Массив записей регистра
//        **_ИмяПоля_    - Произвольный         - Значения измерений, ресурсов и реквизитов записи регистра
//
// @skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
Функция НаборЗаписейРегистраСведенийВСтруктуру(НаборЗаписей,
                                               СписокСвойств = Неопределено,
                                               ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = НаборЗаписей.Метаданные();
	
	Если НЕ ТипЗнч(НаборЗаписей) = Тип(СтрШаблон("РегистрСведенийНаборЗаписей.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("РегистрСведенийНаборЗаписей.%1", МетаОбъект.Имя));
	
	СтруктураОбъекта.Вставить("Отбор", Новый Структура());
	
	Если МетаОбъект.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
		СтруктураОбъекта.Отбор.Вставить("Регистратор", ЗначениеВСтруктуру(НаборЗаписей.Отбор.Регистратор.Значение));
	Иначе
		Если НЕ МетаОбъект.ПериодичностьРегистраСведений =
				Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			СтруктураОбъекта.Отбор.Вставить("Период", НаборЗаписей.Отбор.Период.Значение);
		КонецЕсли;
		
		Для Каждого ТекЭлемент Из НаборЗаписей.Отбор Цикл
			Если НЕ (ИспользоватьСвойство(ТекЭлемент.Имя, СписокСвойств, ИсключаяСвойства) И ТекЭлемент.Использование) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураОбъекта.Отбор.Вставить(ТекЭлемент.Имя, ЗначениеВСтруктуру(ТекЭлемент.Значение));
		КонецЦикла;
	КонецЕсли;
	
	МассивСтрок = Новый Массив();
	
	НомерСтроки = 1;
	
	Для Каждого ТекСтрока Из НаборЗаписей Цикл
		
		СтруктураСтроки = Новый Структура();
		
		Если МетаОбъект.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
			СтруктураСтроки.Вставить("Регистратор", ЗначениеВСтруктуру(ТекСтрока.Регистратор));
			Если ИспользоватьСвойство("НомерСтроки", СписокСвойств, ИсключаяСвойства) Тогда
				СтруктураСтроки.Вставить("НомерСтроки",
				                         ?(ТекСтрока.НомерСтроки = 0, НомерСтроки, ТекСтрока.НомерСтроки));
			КонецЕсли;
			СтруктураСтроки.Вставить("Активность", ТекСтрока.Активность);
		КонецЕсли;
		
		Если НЕ МетаОбъект.ПериодичностьРегистраСведений =
				Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			СтруктураСтроки.Вставить("Период", ТекСтрока.Период);
		КонецЕсли;
		
		ЗаполнитьДанныеЗаписиРегистраВСтруктуре(СтруктураСтроки, ТекСтрока, СписокСвойств, ИсключаяСвойства);
		
		МассивСтрок.Добавить(СтруктураСтроки);
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	СтруктураОбъекта.Вставить("Записи", МассивСтрок);
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(НаборЗаписей, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // НаборЗаписейРегистраСведенийВСтруктуру()

// Заполняет набор записей регистра сведений из структуры
//
// Параметры:
//   НаборЗаписей         - РегистрСведенийНаборЗаписей   - набор записей регистра для заполнения
//   СтруктураОбъекта     - Структура                     - данные для заполнения объекта
//     *Отбор              - Структура                      - Описание отбора записей регистра
//        **_ИмяПоля_        - Произвольный                   - Значение отбора
//     *Записи             - Массив из Структура            - Массив записей регистра
//        **_ИмяПоля_        - Произвольный                   - Значения измерений,
//                                                              ресурсов и реквизитов записи регистра
//   СписокСвойств        - Строка                        - список допустимых свойств
//                          Массив из Строка                (если пустой, то допустимы все свойства)
//   ИсключаяСвойства     - Строка                        - список исключаемых свойств
//                          Массив из Строка                (если пустой, то допустимы все свойства)
//
// @skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
Процедура НаборЗаписейРегистраСведенийИзСтруктуры(НаборЗаписей,
                                                  СтруктураОбъекта,
                                                  СписокСвойств = Неопределено,
                                                  ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = НаборЗаписей.Метаданные();
	
	Если МетаОбъект.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
		НаборЗаписей.Отбор.Регистратор.Установить(ЗначениеИзСтруктуры(СтруктураОбъекта.Отбор.Регистратор));
	Иначе
		Если НЕ МетаОбъект.ПериодичностьРегистраСведений =
				Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			НаборЗаписей.Отбор.Период.Установить(ЗначениеИзСтруктуры(СтруктураОбъекта.Отбор.Период));
		КонецЕсли;
		
		Для Каждого ТекПоле Из МетаОбъект.Измерения Цикл
			Если НЕ (СтруктураОбъекта.Отбор.Свойство(ТекПоле.Имя)
			   И ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства)) Тогда
				Продолжить;
			КонецЕсли;
			НаборЗаписей.Отбор[ТекПоле.Имя].Установить(ЗначениеИзСтруктуры(СтруктураОбъекта.Отбор[ТекПоле.Имя]));
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей.Очистить();
	
	Для Каждого ТекЗапись Из СтруктураОбъекта.Записи Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		Если МетаОбъект.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
			НоваяЗапись.Регистратор = ЗначениеИзСтруктуры(ТекЗапись.Регистратор);
			НоваяЗапись.Активность = ЗначениеИзСтруктуры(ТекЗапись.Активность);
		КонецЕсли;
		
		Если НЕ МетаОбъект.ПериодичностьРегистраСведений =
				Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
			НоваяЗапись.Период = ЗначениеИзСтруктуры(ТекЗапись.Период);
		КонецЕсли;
		
		ЗаполнитьДанныеЗаписиРегистраИзСтруктуры(НоваяЗапись, ТекЗапись, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(НаборЗаписей, СтруктураОбъекта);
	
КонецПроцедуры // НаборЗаписейРегистраСведенийИзСтруктуры()

// Преобразует набор записей регистра накопления в структуру
//
// Параметры:
//   НаборЗаписей        - РегистрНакопленияНаборЗаписей    - набор записей регистра накопления для преобразования
//   СписокСвойств       - Строка                           - список допустимых свойств
//                         Массив из Строка                   (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка                           - список исключаемых свойств
//                         Массив из Строка                   (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                              - результат преобразования
//     *Отбор          - Структура            - описание отбора записей регистра
//        **_ИмяПоля_    - Произвольный         - значение отбора
//     *Записи         - Массив из Структура  - массив записей регистра
//        **_ИмяПоля_    - Произвольный         - значения измерений, ресурсов и реквизитов записи регистра
//
Функция НаборЗаписейРегистраНакопленияВСтруктуру(НаборЗаписей,
                                                 СписокСвойств = Неопределено,
                                                 ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = НаборЗаписей.Метаданные();
	
	Если НЕ ТипЗнч(НаборЗаписей) = Тип(СтрШаблон("РегистрНакопленияНаборЗаписей.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("РегистрНакопленияНаборЗаписей.%1", МетаОбъект.Имя));
	
	СтруктураОбъекта.Вставить("Отбор", Новый Структура());
	
	СтруктураОбъекта.Отбор.Вставить("Регистратор", ЗначениеВСтруктуру(НаборЗаписей.Отбор.Регистратор.Значение));
	
	МассивСтрок = Новый Массив();
	
	НомерСтроки = 1;
	
	Для Каждого ТекСтрока Из НаборЗаписей Цикл
		
		СтруктураСтроки = Новый Структура();
		
		СтруктураСтроки.Вставить("Регистратор", ЗначениеВСтруктуру(ТекСтрока.Регистратор));
		
		Если ИспользоватьСвойство("НомерСтроки", СписокСвойств, ИсключаяСвойства) Тогда
			СтруктураСтроки.Вставить("НомерСтроки", ?(ТекСтрока.НомерСтроки = 0, НомерСтроки, ТекСтрока.НомерСтроки));
		КонецЕсли;
		
		СтруктураСтроки.Вставить("Активность", ТекСтрока.Активность);
		
		Если МетаОбъект.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
			СтруктураСтроки.Вставить("ВидДвижения",
			                         ?(ТекСтрока.ВидДвижения = ВидДвиженияНакопления.Приход, "Приход", "Расход"));
		КонецЕсли;
		
		СтруктураСтроки.Вставить("Период", ТекСтрока.Период);
		
		ЗаполнитьДанныеЗаписиРегистраВСтруктуре(СтруктураСтроки, ТекСтрока, СписокСвойств, ИсключаяСвойства);
		
		МассивСтрок.Добавить(СтруктураСтроки);
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	СтруктураОбъекта.Вставить("Записи", МассивСтрок);
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(НаборЗаписей, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // НаборЗаписейРегистраНакопленияВСтруктуру()

// Заполняет набор записей регистра накопления из структуры
//
// Параметры:
//  НаборЗаписей         - РегистрСведенийНаборЗаписей   - набор записей регистра для заполнения
//  СтруктураОбъекта     - Структура                     - данные для заполнения объекта
//     *Отбор              - Структура                     - описание отбора записей регистра
//        **_ИмяПоля_        - Произвольный                  - значение отбора
//     *Записи             - Массив из Структура           - массив записей регистра
//        **_ИмяПоля_        - Произвольный                  - значения измерений, ресурсов и реквизитов записи регистра
//   СписокСвойств       - Строка                        - список допустимых свойств
//                         Массив из Строка                (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка                        - список исключаемых свойств
//                         Массив из Строка                (если пустой, то допустимы все свойства)
//
// @skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
Процедура НаборЗаписейРегистраНакопленияИзСтруктуры(НаборЗаписей,
                                                    СтруктураОбъекта,
                                                    СписокСвойств = Неопределено,
                                                    ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = НаборЗаписей.Метаданные();
	
	НаборЗаписей.Отбор.Регистратор.Установить(ЗначениеИзСтруктуры(СтруктураОбъекта.Отбор.Регистратор));
	
	НаборЗаписей.Очистить();
	
	Для Каждого ТекЗапись Из СтруктураОбъекта.Записи Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Регистратор = ЗначениеИзСтруктуры(ТекЗапись.Регистратор);
		
		НоваяЗапись.Активность = ЗначениеИзСтруктуры(ТекЗапись.Активность);
		
		Если МетаОбъект.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
			Если БезопасныйРежимПД() Тогда
				УстановитьБезопасныйРежим(Истина);
			КонецЕсли;
			НоваяЗапись.ВидДвижения = Вычислить("ВидДвиженияНакопления." + ТекЗапись.ВидДвижения);
		КонецЕсли;
		
		НоваяЗапись.Период = ЗначениеИзСтруктуры(ТекЗапись.Период);
		
		ЗаполнитьДанныеЗаписиРегистраИзСтруктуры(НоваяЗапись, ТекЗапись, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(НаборЗаписей, СтруктураОбъекта);
	
КонецПроцедуры // НаборЗаписейРегистраНакопленияИзСтруктуры()

// Преобразует набор записей регистра бухгалтерии в структуру
//
// Параметры:
//  НаборЗаписей         - РегистрБухгалтерииНаборЗаписей    - набор записей регистра бухгалтерии для преобразования
//   СписокСвойств       - Строка                            - список допустимых свойств
//                         Массив из Строка                    (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка                            - список исключаемых свойств
//                         Массив из Строка                    (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                              - результат преобразования
//     *Отбор          - Структура            - описание отбора записей регистра
//        **_ИмяПоля_    - Произвольный         - значение отбора
//     *Записи         - Массив из Структура  - массив записей регистра
//        **_ИмяПоля_    - Произвольный         - значения измерений, ресурсов и реквизитов записи регистра
//
Функция НаборЗаписейРегистраБухгалтерииВСтруктуру(НаборЗаписей,
                                                  СписокСвойств = Неопределено,
                                                  ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = НаборЗаписей.Метаданные();
	
	Если НЕ ТипЗнч(НаборЗаписей) = Тип(СтрШаблон("РегистрБухгалтерииНаборЗаписей.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("РегистрБухгалтерииНаборЗаписей.%1", МетаОбъект.Имя));
	
	СтруктураОбъекта.Вставить("Отбор", Новый Структура());
	
	СтруктураОбъекта.Отбор.Вставить("Регистратор", ЗначениеВСтруктуру(НаборЗаписей.Отбор.Регистратор.Значение));
	
	МассивСтрок = Новый Массив();
	
	НомерСтроки = 1;
	
	Для Каждого ТекСтрока Из НаборЗаписей Цикл
		
		СтруктураСтроки = Новый Структура();
		
		СтруктураСтроки.Вставить("Регистратор", ЗначениеВСтруктуру(ТекСтрока.Регистратор));
		
		Если ИспользоватьСвойство("НомерСтроки", СписокСвойств, ИсключаяСвойства) Тогда
			СтруктураСтроки.Вставить("НомерСтроки", ?(ТекСтрока.НомерСтроки = 0, НомерСтроки, ТекСтрока.НомерСтроки));
		КонецЕсли;
		
		СтруктураСтроки.Вставить("Активность", ТекСтрока.Активность);
		
		СтруктураСтроки.Вставить("Период", ТекСтрока.Период);
		
		Если МетаОбъект.ДлинаУточненияПериода > 0
		   И ИспользоватьСвойство("УточнениеПериода", СписокСвойств, ИсключаяСвойства) Тогда
			СтруктураСтроки.Вставить("УточнениеПериода", ТекСтрока.УточнениеПериода);
		КонецЕсли;
		
		Если МетаОбъект.Корреспонденция Тогда
			СтруктураСтроки.Вставить("СчетДт", ЗначениеВСтруктуру(ТекСтрока.СчетДт));
			СтруктураСтроки.Вставить("СчетКт", ЗначениеВСтруктуру(ТекСтрока.СчетКт));
			
			СтруктураСтроки.Вставить("СубконтоДт",
			                         ЗначенияСубконтоЗаписиВСтруктуру(ТекСтрока, "Дт", СписокСвойств, ИсключаяСвойства));
			СтруктураСтроки.Вставить("СубконтоКт",
			                         ЗначенияСубконтоЗаписиВСтруктуру(ТекСтрока, "Кт", СписокСвойств, ИсключаяСвойства));
		Иначе
			СтруктураСтроки.Вставить("ВидДвижения",
			                         ?(ТекСтрока.ВидДвижения = ВидДвиженияБухгалтерии.Дебет, "Дебет", "Кредит"));
			
			СтруктураСтроки.Вставить("Счет", ЗначениеВСтруктуру(ТекСтрока.Счет));
			
			СтруктураСтроки.Вставить("Субконто",
			                         ЗначенияСубконтоЗаписиВСтруктуру(ТекСтрока, "", СписокСвойств, ИсключаяСвойства));
		КонецЕсли;
		
		Для Каждого ТекПоле Из МетаОбъект.Измерения Цикл
			Если НЕ ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства) Тогда
				Продолжить;
			КонецЕсли;
			Если МетаОбъект.Корреспонденция И НЕ ТекПоле.Балансовый Тогда
				СтруктураСтроки.Вставить(ТекПоле.Имя + "Дт", ЗначениеВСтруктуру(ТекСтрока[ТекПоле.Имя + "Дт"]));
				СтруктураСтроки.Вставить(ТекПоле.Имя + "Кт", ЗначениеВСтруктуру(ТекСтрока[ТекПоле.Имя + "Кт"]));
			Иначе
				СтруктураСтроки.Вставить(ТекПоле.Имя, ЗначениеВСтруктуру(ТекСтрока[ТекПоле.Имя]));
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекПоле Из МетаОбъект.Ресурсы Цикл
			Если НЕ ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства) Тогда
				Продолжить;
			КонецЕсли;
			Если МетаОбъект.Корреспонденция И НЕ ТекПоле.Балансовый Тогда
				СтруктураСтроки.Вставить(ТекПоле.Имя + "Дт", ЗначениеВСтруктуру(ТекСтрока[ТекПоле.Имя + "Дт"]));
				СтруктураСтроки.Вставить(ТекПоле.Имя + "Кт", ЗначениеВСтруктуру(ТекСтрока[ТекПоле.Имя + "Кт"]));
			Иначе
				СтруктураСтроки.Вставить(ТекПоле.Имя, ЗначениеВСтруктуру(ТекСтрока[ТекПоле.Имя]));
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекПоле Из МетаОбъект.Реквизиты Цикл
			Если НЕ ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства) Тогда
				Продолжить;
			КонецЕсли;
			СтруктураСтроки.Вставить(ТекПоле.Имя, ЗначениеВСтруктуру(ТекСтрока[ТекПоле.Имя]));
		КонецЦикла;
		
		МассивСтрок.Добавить(СтруктураСтроки);
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	СтруктураОбъекта.Вставить("Записи", МассивСтрок);
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(НаборЗаписей, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // НаборЗаписейРегистраБухгалтерииВСтруктуру()

// Заполняет набор записей регистра бухгалтерии из структуры
//
// Параметры:
//  НаборЗаписей         - РегистрСведенийНаборЗаписей   - набор записей регистра для заполнения
//  СтруктураОбъекта     - Структура                     - данные для заполнения объекта
//     *Отбор              - Структура                     - описание отбора записей регистра
//        **_ИмяПоля_        - Произвольный                  - значение отбора
//     *Записи             - Массив из Структура           - массив записей регистра
//        **_ИмяПоля_        - Произвольный                  - значения измерений, ресурсов и реквизитов записи регистра
//   СписокСвойств       - Строка                        - список допустимых свойств
//                         Массив из Строка                (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка                        - список исключаемых свойств
//                         Массив из Строка                (если пустой, то допустимы все свойства)
//
// @skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
Процедура НаборЗаписейРегистраБухгалтерииИзСтруктуры(НаборЗаписей,
                                                     СтруктураОбъекта,
                                                     СписокСвойств = Неопределено,
                                                     ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = НаборЗаписей.Метаданные();
	
	НаборЗаписей.Отбор.Регистратор.Установить(ЗначениеИзСтруктуры(СтруктураОбъекта.Отбор.Регистратор));
	
	НаборЗаписей.Очистить();
	
	Для Каждого ТекЗапись Из СтруктураОбъекта.Записи Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Регистратор = ЗначениеИзСтруктуры(ТекЗапись.Регистратор);
		НоваяЗапись.Активность  = ЗначениеИзСтруктуры(ТекЗапись.Активность);
		НоваяЗапись.Период      = ЗначениеИзСтруктуры(ТекЗапись.Период);
		
		Если МетаОбъект.ДлинаУточненияПериода > 0
		   И ИспользоватьСвойство("УточнениеПериода", СписокСвойств, ИсключаяСвойства) Тогда
			// @skip-warning - в СП написано, что поле имеет свойство "Только чтение",
			// но при добавлении записи присваивание допускается
			НоваяЗапись.УточнениеПериода = ЗначениеИзСтруктуры(ТекЗапись.УточнениеПериода);
		КонецЕсли;
		
		Если МетаОбъект.Корреспонденция Тогда
			НоваяЗапись.СчетДт = ЗначениеИзСтруктуры(ТекЗапись.СчетДт);
			НоваяЗапись.СчетКт = ЗначениеИзСтруктуры(ТекЗапись.СчетКт);
			
			ЗначенияСубконтоЗаписиИзСтруктуры(НоваяЗапись,
			                                  ТекЗапись,
			                                  "Дт",
			                                  СписокСвойств,
			                                  ИсключаяСвойства);
			ЗначенияСубконтоЗаписиИзСтруктуры(НоваяЗапись,
			                                  ТекЗапись,
			                                  "Кт",
			                                  СписокСвойств,
			                                  ИсключаяСвойства);
		Иначе
			Если БезопасныйРежимПД() Тогда
				УстановитьБезопасныйРежим(Истина);
			КонецЕсли;
			НоваяЗапись.ВидДвижения = Вычислить("ВидДвиженияБухгалтерии." + ТекЗапись.ВидДвижения);
			НоваяЗапись.Счет        = ЗначениеИзСтруктуры(ТекЗапись.Счет);
			
			ЗначенияСубконтоЗаписиИзСтруктуры(НоваяЗапись,
			                                  ТекЗапись,
			                                  "",
			                                  СписокСвойств,
			                                  ИсключаяСвойства);
		КонецЕсли;
	
		Для Каждого ТекПоле Из МетаОбъект.Измерения Цикл
			Если МетаОбъект.Корреспонденция И НЕ ТекПоле.Балансовый Тогда
				ЗаполнитьИзмерениеРегистраБухгалтерии(НоваяЗапись,
				                                      ТекЗапись,
				                                      ТекПоле,
				                                      "Дт",
				                                      СписокСвойств,
				                                      ИсключаяСвойства);
				ЗаполнитьИзмерениеРегистраБухгалтерии(НоваяЗапись,
				                                      ТекЗапись,
				                                      ТекПоле,
				                                      "Кт",
				                                      СписокСвойств,
				                                      ИсключаяСвойства);
			Иначе
				ЗаполнитьИзмерениеРегистраБухгалтерии(НоваяЗапись,
				                                      ТекЗапись,
				                                      ТекПоле,
				                                      "",
				                                      СписокСвойств,
				                                      ИсключаяСвойства);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекПоле Из МетаОбъект.Ресурсы Цикл
			Если МетаОбъект.Корреспонденция И НЕ ТекПоле.Балансовый Тогда
				ЗаполнитьРесурсРегистраБухгалтерии(НоваяЗапись,
				                                   ТекЗапись,
				                                   ТекПоле,
				                                   "Дт",
				                                   СписокСвойств,
				                                   ИсключаяСвойства);
				ЗаполнитьРесурсРегистраБухгалтерии(НоваяЗапись,
				                                   ТекЗапись,
				                                   ТекПоле,
				                                   "Кт",
				                                   СписокСвойств,
				                                   ИсключаяСвойства);
			Иначе
				ЗаполнитьРесурсРегистраБухгалтерии(НоваяЗапись,
				                                   ТекЗапись,
				                                   ТекПоле,
				                                   "",
				                                   СписокСвойств,
				                                   ИсключаяСвойства);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекПоле Из МетаОбъект.Реквизиты Цикл
			Если НЕ (ТекЗапись.Свойство(ТекПоле.Имя)
					И ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства)) Тогда
				Продолжить;
			КонецЕсли;
			НоваяЗапись[ТекПоле.Имя] = ЗначениеИзСтруктуры(ТекЗапись[ТекПоле.Имя]);
		КонецЦикла;
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(НаборЗаписей, СтруктураОбъекта);
	
КонецПроцедуры // НаборЗаписейРегистраБухгалтерииИзСтруктуры()

// Преобразует набор записей регистра расчета в структуру
//
// Параметры:
//  НаборЗаписей        - РегистрРасчетаНаборЗаписей    - набор записей регистра расчета для преобразования
//   СписокСвойств       - Строка                       - список допустимых свойств
//                         Массив из Строка               (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка                       - список исключаемых свойств
//                         Массив из Строка               (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                              - результат преобразования
//     *Отбор          - Структура            - описание отбора записей регистра
//        **_ИмяПоля_    - Произвольный         - значение отбора
//     *Записи         - Массив из Структура  - массив записей регистра
//        **_ИмяПоля_    - Произвольный         - значения измерений, ресурсов и реквизитов записи регистра
//
Функция НаборЗаписейРегистраРасчетаВСтруктуру(НаборЗаписей,
                                              СписокСвойств = Неопределено,
                                              ИсключаяСвойства = Неопределено) Экспорт
	
	СтруктураОбъекта = Новый Структура();
	
	МетаОбъект = НаборЗаписей.Метаданные();
	
	Если НЕ ТипЗнч(НаборЗаписей) = Тип(СтрШаблон("РегистрРасчетаНаборЗаписей.%1", МетаОбъект.Имя)) Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", СтрШаблон("РегистрРасчетаНаборЗаписей.%1", МетаОбъект.Имя));
	
	СтруктураОбъекта.Вставить("Отбор", Новый Структура());
	
	СтруктураОбъекта.Отбор.Вставить("Регистратор", ЗначениеВСтруктуру(НаборЗаписей.Отбор.Регистратор.Значение));
	
	Для Каждого ТекЭлемент Из НаборЗаписей.Отбор Цикл
		Если НЕ ИспользоватьСвойство(ТекЭлемент.Имя, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОбъекта.Отбор.Вставить(ТекЭлемент.Имя, ЗначениеВСтруктуру(ТекЭлемент.Значение));
	КонецЦикла;
	
	МассивСтрок = Новый Массив();
	
	НомерСтроки = 1;
	
	Для Каждого ТекСтрока Из НаборЗаписей Цикл
		
		СтруктураСтроки = Новый Структура();
		
		СтруктураСтроки.Вставить("Регистратор", ЗначениеВСтруктуру(ТекСтрока.Регистратор));
		
		Если ИспользоватьСвойство("НомерСтроки", СписокСвойств, ИсключаяСвойства) Тогда
			СтруктураСтроки.Вставить("НомерСтроки", ?(ТекСтрока.НомерСтроки = 0, НомерСтроки, ТекСтрока.НомерСтроки));
		КонецЕсли;
		
		СтруктураСтроки.Вставить("Активность"       , ТекСтрока.Активность);
		СтруктураСтроки.Вставить("ВидРасчета"       , ЗначениеВСтруктуру(ТекСтрока.ВидРасчета));
		СтруктураСтроки.Вставить("Сторно"           , ТекСтрока.Сторно);
		СтруктураСтроки.Вставить("ПериодРегистрации", ТекСтрока.ПериодРегистрации);
		
		Если МетаОбъект.БазовыйПериод Тогда
			СтруктураСтроки.Вставить("БазовыйПериодНачало", ТекСтрока.БазовыйПериодНачало);
			СтруктураСтроки.Вставить("БазовыйПериодКонец" , ТекСтрока.БазовыйПериодКонец);
		КонецЕсли;
		
		Если МетаОбъект.ПериодДействия Тогда
			СтруктураСтроки.Вставить("ПериодДействия"      , ТекСтрока.ПериодДействия);
			СтруктураСтроки.Вставить("ПериодДействияНачало", ТекСтрока.ПериодДействияНачало);
			СтруктураСтроки.Вставить("ПериодДействияКонец" , ТекСтрока.ПериодДействияКонец);
			
			МассивПериодов = Новый Массив();
			
			Для Каждого ТекПериод Из ТекСтрока.ФактическийПериодДействия Цикл
				МассивПериодов.Добавить(Новый Структура("ДатаНачала, ДатаОкончания",
				                                        ТекПериод.ДатаНачала, ТекПериод.ДатаОкончания));
			КонецЦикла;
			СтруктураСтроки.Вставить("ФактическийПериодДействия", МассивПериодов);
		КонецЕсли;
		
		ЗаполнитьДанныеЗаписиРегистраВСтруктуре(СтруктураСтроки, ТекСтрока, СписокСвойств, ИсключаяСвойства);
		
		МассивСтрок.Добавить(СтруктураСтроки);
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	СтруктураОбъекта.Вставить("Записи", МассивСтрок);
	
	ВыполнитьОбработчикПослеВыгрузкиТипа(НаборЗаписей, СтруктураОбъекта);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // НаборЗаписейРегистраРасчетаВСтруктуру()

// Заполняет набор записей регистра расчета из структуры
//
// Параметры:
//  НаборЗаписей         - РегистрСведенийНаборЗаписей   - набор записей регистра для заполнения
//  СтруктураОбъекта     - Структура                     - данные для заполнения объекта
//     *Отбор              - Структура                     - описание отбора записей регистра
//        **_ИмяПоля_        - Произвольный                  - значение отбора
//     *Записи             - Массив из Структура           - массив записей регистра
//        **_ИмяПоля_        - Произвольный                  - значения измерений, ресурсов и реквизитов записи регистра
//  СписокСвойств        - Строка                        - список допустимых свойств
//                         Массив из Строка                (если пустой, то допустимы все свойства)
//  ИсключаяСвойства     - Строка                        - список исключаемых свойств
//                         Массив из Строка                (если пустой, то допустимы все свойства)
//
// @skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
Процедура НаборЗаписейРегистраРасчетаИзСтруктуры(НаборЗаписей,
                                                 СтруктураОбъекта,
                                                 СписокСвойств = Неопределено,
                                                 ИсключаяСвойства = Неопределено) Экспорт
	
	МетаОбъект = НаборЗаписей.Метаданные();
	
	НаборЗаписей.Отбор.Регистратор.Установить(ЗначениеИзСтруктуры(СтруктураОбъекта.Отбор.Регистратор));
	
	Для Каждого ТекПоле Из МетаОбъект.Измерения Цикл
		Если НЕ (СтруктураОбъекта.Отбор.Свойство(ТекПоле.Имя)
			     И ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства)) Тогда
			Продолжить;
		КонецЕсли;
		НаборЗаписей.Отбор[ТекПоле.Имя].Установить(ЗначениеИзСтруктуры(СтруктураОбъекта.Отбор[ТекПоле.Имя]));
	КонецЦикла;
	
	НаборЗаписей.Очистить();
	
	Для Каждого ТекЗапись Из СтруктураОбъекта.Записи Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Регистратор       = ЗначениеИзСтруктуры(ТекЗапись.Регистратор);
		НоваяЗапись.Активность        = ЗначениеИзСтруктуры(ТекЗапись.Активность);
		НоваяЗапись.ВидРасчета        = ЗначениеИзСтруктуры(ТекЗапись.ВидРасчета);
		НоваяЗапись.Сторно            = ЗначениеИзСтруктуры(ТекЗапись.Сторно);
		НоваяЗапись.ПериодРегистрации = ЗначениеИзСтруктуры(ТекЗапись.ПериодРегистрации);
		
		Если МетаОбъект.БазовыйПериод Тогда
			НоваяЗапись.БазовыйПериодНачало = ЗначениеИзСтруктуры(ТекЗапись.БазовыйПериодНачало);
			НоваяЗапись.БазовыйПериодКонец = ЗначениеИзСтруктуры(ТекЗапись.БазовыйПериодКонец);
		КонецЕсли;
		
		Если МетаОбъект.ПериодДействия Тогда
			НоваяЗапись.ПериодДействияНачало = ЗначениеИзСтруктуры(ТекЗапись.ПериодДействияНачало);
			НоваяЗапись.ПериодДействияКонец  = ЗначениеИзСтруктуры(ТекЗапись.ПериодДействияКонец);
		КонецЕсли;
		
		ЗаполнитьДанныеЗаписиРегистраИзСтруктуры(НоваяЗапись, ТекЗапись, СписокСвойств, ИсключаяСвойства);
	КонецЦикла;
	
	ВыполнитьОбработчикПослеЗагрузкиТипа(НаборЗаписей, СтруктураОбъекта);
	
КонецПроцедуры // НаборЗаписейРегистраРасчетаИзСтруктуры()

#КонецОбласти // ПреобразованияОбъектовПоВидам

#Область ПреобразованияКоллекций

// Преобразует переданную коллекцию в структуру
//
// Параметры:
//  Значение    - Произвольный    - преобразуемая коллекция
//
// Возвращаемое значение:
//   Произвольный    - результат преобразования
//
Функция КоллекцияВСтруктуру(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Массив")
		  ИЛИ ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Возврат МассивВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Структура")
		  ИЛИ ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Возврат СтруктураВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Соответствие")
		  ИЛИ ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		Возврат СоответствиеВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("СписокЗначений") Тогда
		Возврат СписокЗначенийВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("ТаблицаЗначений") Тогда
		Возврат ТаблицаЗначенийВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("ДеревоЗначений") Тогда
		Возврат ДеревоЗначенийВСтруктуру(Значение);
	КонецЕсли;
	
	Возврат ЗначениеНеопределенногоТипаВСтруктуру(Значение);
	
КонецФункции // КоллекцияВСтруктуру()

// Получает коллекцию из переданного описания
//
// Параметры:
//  СтруктураЗначения      - Структура              - описание коллекции
//
// Возвращаемое значение:
//   Произвольный     - результат преобразования
//
Функция КоллекцияИзСтруктуры(СтруктураЗначения) Экспорт
	
	ТипЗначения = СтруктураТипЗнч(СтруктураЗначения);
	
	Если ТипЗначения = Тип("Массив") Тогда
		Возврат МассивИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Структура") Тогда
		Возврат СтруктураИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Соответствие") Тогда
		Возврат СоответствиеИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("СписокЗначений") Тогда
		Возврат СписокЗначенийИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("ТаблицаЗначений") Тогда
		Возврат ТаблицаЗначенийИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("ДеревоЗначений") Тогда
		Возврат ДеревоЗначенийИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Возврат ЗначениеНеопределенногоТипаИзСтруктуры(СтруктураЗначения);
	
КонецФункции // КоллекцияИзСтруктуры()

// Функция рекурсивно преобразует структуру значений в структуру с "простыми" типами
//
// Параметры:
//        Значение        - Структура        - Значение для преобразования
//
// Возвращаемое значение:
//   Структура                        - Результат преобразования
//       *__Тип       - Строка          - тип значения (Структура, ФиксированнаяСтруктура)
//       *_элемент_   - Произвольный    - элемент структуры
//
Функция СтруктураВСтруктуру(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	ВремСтруктура = Новый Структура();
	
	Если ТипЗначения = Тип("Структура") Тогда
		ВремСтруктура.Вставить("__Тип", "Структура");
	ИначеЕсли ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		ВремСтруктура.Вставить("__Тип", "ФиксированнаяСтруктура");
	Иначе
		ТекстОшибки = СтрШаблон("Некорректный тип значения ""%1"",
		                        |ожидается ""Структура"" или ""ФиксированнаяСтруктура"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из Значение Цикл
		ВремСтруктура.Вставить(ТекЭлемент.Ключ, ЗначениеВСтруктуру(ТекЭлемент.Значение));
	КонецЦикла;
	
	Возврат ВремСтруктура;
	
КонецФункции // СтруктураВСтруктуру()

// Функция рекурсивно преобразует структуру с "простыми" типами значений в структуру значений 1С
//
// Параметры:
//   СтруктураЗначения        - Структура     - Значение для преобразования
//
// Возвращаемое значение:
//   Структура, ФиксированнаяСтруктура        - Результат преобразования
//
Функция СтруктураИзСтруктуры(СтруктураЗначения) Экспорт
	
	ТипЗначения = ТипЗнч(СтруктураЗначения);
	 
	Если НЕ ТипЗначения = Тип("Структура") Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип описания значения ""%1"", ожидается ""Структура"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВремСтруктура = Новый Структура();
	
	Тип = "Структура";
	
	Для Каждого ТекЭлемент Из СтруктураЗначения Цикл
		Если ПредставленияРавны(ТекЭлемент.Ключ, "__Тип") Тогда
			Тип = ТекЭлемент.Значение;
			Продолжить;
		КонецЕсли;
		ВремСтруктура.Вставить(ТекЭлемент.Ключ, ЗначениеИзСтруктуры(ТекЭлемент.Значение));
	КонецЦикла;
	
	Если ПредставленияРавны(Тип, "ФиксированнаяСтруктура") Тогда
		ВремСтруктура = Новый ФиксированнаяСтруктура(ВремСтруктура);
	КонецЕсли;
	
	Возврат ВремСтруктура;
	
КонецФункции // СтруктураИзСтруктуры()

// Функция рекурсивно преобразует массив значений в массив с "простыми" типами
//
// Параметры:
//        Значение        - Массив из Произвольный       - Значение для преобразования
//
// Возвращаемое значение:
//   Структура                     - Результат преобразования
//       *__Тип       - Строка       - Тип значения (Массив, ФиксированныйМассив)
//       * Элементы   - Массив       - элементы массива
//
Функция МассивВСтруктуру(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	ВремМассив = Новый Структура();
	
	Если ТипЗначения = Тип("Массив") Тогда
		ВремМассив.Вставить("__Тип", "Массив");
	ИначеЕсли ТипЗначения = Тип("ФиксированныйМассив") Тогда
		ВремМассив.Вставить("__Тип", "ФиксированныйМассив");
	Иначе
		ТекстОшибки = СтрШаблон("Некорректный тип значения ""%1"",
		                        |ожидается ""Массив"" или ""ФиксированныйМассив"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВремМассив.Вставить("Элементы", Новый Массив());
	
	Для Каждого ТекЗначение Из Значение Цикл
		ВремМассив.Элементы.Добавить(ЗначениеВСтруктуру(ТекЗначение));
	КонецЦикла;
	
	Возврат ВремМассив;
	
КонецФункции // МассивВСтруктуру()

// Функция рекурсивно преобразует массив с "простыми" типами значений в массив значений 1С
//
// Параметры:
//   СтруктураЗначения             - Массив Из Произвольный     - Значение для преобразования
//
// Возвращаемое значение:
//   Массив Из Произвольный            - Результат преобразования
//   ФиксированныйМассив из Произвольный
//
Функция МассивИзСтруктуры(СтруктураЗначения) Экспорт
	
	ВремМассив = Новый Массив();
	
	Элементы = Неопределено;
	
	Тип = Неопределено;
	ТипЗначения = ТипЗнч(СтруктураЗначения);
	
	Если ТипЗначения = Тип("Массив") Тогда
		Элементы = СтруктураЗначения;
		Тип = "Массив";
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		Если НЕ ЕстьТип(СтруктураЗначения) Тогда
			ВызватьИсключение "Не указан тип описания значения.";
		ИначеЕсли ПредставленияРавны(СтруктураЗначения.__Тип, "Массив")
		 ИЛИ ПредставленияРавны(СтруктураЗначения.__Тип, "ФиксированныйМассив") Тогда
			Элементы = СтруктураЗначения.Элементы;
			Тип = СтруктураЗначения.__Тип;
		Иначе
			ТекстОшибки = СтрШаблон("В описании значения указан некорректный тип значения ""%1"",
			                        | ожидается ""Массив"" или ""ФиксированныйМассив"".",
			                        СтруктураЗначения.__Тип);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Иначе
		ТекстОшибки = СтрШаблон("Некорректный тип описания значения ""%1"", ожидается ""Массив"" или ""Структура"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из Элементы Цикл
		ВремМассив.Добавить(ЗначениеИзСтруктуры(ТекЭлемент));
	КонецЦикла;
	
	Если ПредставленияРавны(Тип, "ФиксированныйМассив") Тогда
		ВремМассив = Новый ФиксированныйМассив(ВремМассив);
	КонецЕсли;
	 
	Возврат ВремМассив;
	
КонецФункции // МассивИзСтруктуры()

// Функция рекурсивно преобразует соответствие значений в массив структур с "простыми" типами
//
// Параметры:
//   Значение    - Соответствие из Произвольный    - Значение для преобразования
//
// Возвращаемое значение:
//   Структура                              - Результат преобразования
//     *__Тип        - Строка               - Тип значения (Соответствие, ФиксированноеСоответствие)
//     *Элементы     - Массив из Структура  - элементы соответствия
//        **Ключ       - Произвольный         - ключ элемента соответствия
//        **Значение   - Произвольный         - значение элемента соответствия
//
Функция СоответствиеВСтруктуру(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	ВремСоответствие = Новый Структура();
	
	Если ТипЗначения = Тип("Соответствие") Тогда
		ВремСоответствие.Вставить("__Тип", "Соответствие");
	ИначеЕсли ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		ВремСоответствие.Вставить("__Тип", "ФиксированноеСоответствие");
	Иначе
		ТекстОшибки = СтрШаблон("Некорректный тип значения ""%1"",
		                        |ожидается ""Соответствие"" или ""ФиксированноеСоответствие"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВремСоответствие.Вставить("Элементы", Новый Массив());
	
	Для Каждого ТекЭлемент Из Значение Цикл
		ВремСоответствие.Элементы.Добавить(Новый Структура("Ключ,
		                                                   |Значение",
		                                                   ЗначениеВСтруктуру(ТекЭлемент.Ключ),
		                                                   ЗначениеВСтруктуру(ТекЭлемент.Значение)));
	КонецЦикла;
	
	Возврат ВремСоответствие;
	
КонецФункции // СоответствиеВСтруктуру()

// Функция рекурсивно преобразует массив структур с "простыми" типами значений в соответствие значений 1С
//
// Параметры:
//   СтруктураЗначения  - Массив из Структура  - Значение для преобразования
//     *Ключ              - Произвольный         - Ключ элемента соответствия
//     *Значение          - Произвольный         - Значение элемента соответствия
//
// Возвращаемое значение:
//   Соответствие из Произвольный      - Результат преобразования
//   ФиксированноеСоответствие
//
Функция СоответствиеИзСтруктуры(СтруктураЗначения) Экспорт
	
	ВремСоответствие = Новый Соответствие();
	
	Элементы = Неопределено;
	
	Тип = Неопределено;
	ТипЗначения = ТипЗнч(СтруктураЗначения);
	
	Если ТипЗначения = Тип("Массив") Тогда
		Элементы = СтруктураЗначения;
		Тип = "Соответствие";
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		Если НЕ ЕстьТип(СтруктураЗначения) Тогда
			ВызватьИсключение "Не указан тип описания значения.";
		ИначеЕсли ПредставленияРавны(СтруктураЗначения.__Тип, "Соответствие")
		 ИЛИ ПредставленияРавны(СтруктураЗначения.__Тип, "ФиксированноеСоответствие") Тогда
			Элементы = СтруктураЗначения.Элементы;
			Тип = СтруктураЗначения.__Тип;
		Иначе
			ТекстОшибки = СтрШаблон("В описании значения указан некорректный тип значения ""%1"",
			                        | ожидается ""Соответствие"" или ""ФиксированноеСоответствие"".",
			                        СтруктураЗначения.__Тип);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Иначе
		ТекстОшибки = СтрШаблон("Некорректный тип описания значения ""%1"", ожидается ""Массив"" или ""Структура"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из Элементы Цикл
		Ключ = ЗначениеИзСтруктуры(ТекЭлемент.Ключ);
		Значение = ЗначениеИзСтруктуры(ТекЭлемент.Значение);
		ВремСоответствие.Вставить(Ключ, Значение);
	КонецЦикла;
	
	Если ПредставленияРавны(Тип, "ФиксированноеСоответствие") Тогда
		ВремСоответствие = Новый ФиксированноеСоответствие(ВремСоответствие);
	КонецЕсли;
	
	Возврат ВремСоответствие;
	
КонецФункции // СоответствиеИзСтруктуры()

// Функция рекурсивно преобразует список значений в массив структур с "простыми" типами
//
// Параметры:
//   Значение    - СписокЗначений из Произвольный    - Значение для преобразования
//
// Возвращаемое значение:
//   Структура                                   - Результат преобразования
//     *__Тип             - Строка               - Тип значения (СписокЗначений)
//     *Элементы          - Массив из Структура  - элементы списка
//        **Значение        - Произвольный         - Значение элемента списка значений
//        **Представление   - Строка               - Представление элемента списка значений
//        **Пометка         - Булево               - Пометка элемента списка значений
//
Функция СписокЗначенийВСтруктуру(Значение) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если НЕ ТипЗначения = Тип("СписокЗначений") Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип значения ""%1"", ожидается ""СписокЗначений"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВремСписок = Новый Структура();
	ВремСписок.Вставить("__Тип"   , "СписокЗначений");
	ВремСписок.Вставить("Элементы", Новый Массив());
	
	Для Каждого ТекЭлемент Из Значение Цикл
		ВремЭлемент = Новый Структура();
		ВремЭлемент.Вставить("Значение"     , ЗначениеВСтруктуру(ТекЭлемент.Значение));
		ВремЭлемент.Вставить("Представление", ТекЭлемент.Представление);
		ВремЭлемент.Вставить("Пометка"      , ТекЭлемент.Пометка);
		ВремЭлемент.Вставить("Картинка"     , ЗначениеВСтруктуру(ТекЭлемент.Картинка));
		
		ВремСписок.Элементы.Добавить(ВремЭлемент);
	КонецЦикла;
	
	Возврат ВремСписок;
	
КонецФункции // СписокЗначенийВСтруктуру()

// Функция рекурсивно преобразует массив структур с "простыми" типами значений в список значений 1С
//
// Параметры:
//   СтруктураЗначения   - Структура             - Значение для преобразования
//     *__Тип              - Строка                - Тип значения (СписокЗначений)
//     *Элементы           - Массив из Структура   - элементы списка
//        **Значение         - Произвольный          - Значение элемента списка значений
//        **Представление    - Строка                - Представление элемента списка значений
//        **Пометка          - Булево                - Пометка элемента списка значений
//
// Возвращаемое значение:
//   СписокЗначений из Произвольный    - Результат преобразования
//
Функция СписокЗначенийИзСтруктуры(СтруктураЗначения) Экспорт
	
	ТипЗначения = ТипЗнч(СтруктураЗначения);
	
	Если ТипЗначения = Тип("Массив") Тогда
		Элементы = СтруктураЗначения;
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		Если НЕ ЕстьТип(СтруктураЗначения) Тогда
			ВызватьИсключение "Не указан тип описания значения.";
		ИначеЕсли ПредставленияРавны(СтруктураЗначения.__Тип, "СписокЗначений") Тогда
			Элементы = СтруктураЗначения.Элементы;
		Иначе
			ТекстОшибки = СтрШаблон("В описании значения указан некорректный тип значения ""%1"",
			                        | ожидается ""СписокЗначений"".",
			                        СтруктураЗначения.__Тип);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Иначе
		ТекстОшибки = СтрШаблон("Некорректный тип описания значения ""%1"", ожидается ""Массив"" или ""Структура"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если Элементы.Количество() = 0 Тогда
		Возврат Новый СписокЗначений();
	КонецЕсли;
	
	Если Элементы[0].Свойство("Значение")  = Неопределено Тогда
		Возврат Новый СписокЗначений();
	КонецЕсли;
	
	ВремСписок = Новый СписокЗначений();
	Для Каждого ТекЭлемент Из Элементы Цикл
		ВремСписок.Добавить(ЗначениеИзСтруктуры(ТекЭлемент.Значение),
		                    ТекЭлемент.Представление,
		                    ТекЭлемент.Пометка,
		                    ЗначениеИзСтруктуры(ТекЭлемент.Картинка));
	КонецЦикла;
	
	Возврат ВремСписок;
	
КонецФункции // СписокЗначенийИзСтруктуры()

// Функция рекурсивно преобразует таблицу значений в массив структур с "простыми" типами
//
// Параметры:
//   Значение            - ТаблицаЗначений        - Значение для преобразования
//   СписокСвойств       - Строка                 - список допустимых свойств
//                         Массив из Строка         (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка                 - список исключаемых свойств
//                         Массив из Строка         (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Структура                              - результат преобразования
//     *__Тип          - Строка               - тип значения (ТаблицаЗначений)
//     *Колонки        - Структура            - описания колонок таблицы
//        **_ИмяКолонки_    - Структура         - описание колонки таблицы
//             ***Заголовок   - Строка            - заголовок колонки
//             ***ТипЗначения - Структура         - описание типа колонки
//             ***Ширина      - Строка            - ширина колонки по умолчанию
//     *Строки         - Массив из Структура  - строки таблицы значений
//        **_ИмяКолонки_    - Произвольный    - значение поля таблицы значений
//
Функция ТаблицаЗначенийВСтруктуру(Значение, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если НЕ ТипЗначения = Тип("ТаблицаЗначений") Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип значения ""%1"", ожидается ""ТаблицаЗначений"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВремТаб = Новый Структура();
	ВремТаб.Вставить("__Тип"  , "ТаблицаЗначений");
	ВремТаб.Вставить("Колонки", Новый Структура());
	ВремТаб.Вставить("Строки" , Новый Массив());
	
	Для Каждого ТекКолонка Из Значение.Колонки Цикл
		Если НЕ ИспользоватьСвойство(ТекКолонка.Имя, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеКолонки = Новый Структура();
		ОписаниеКолонки.Вставить("Заголовок"  , ТекКолонка.Заголовок);
		ОписаниеКолонки.Вставить("ТипЗначения", ЗначениеВСтруктуру(ТекКолонка.ТипЗначения));
		ОписаниеКолонки.Вставить("Ширина"     , ТекКолонка.Ширина);
		
		ВремТаб.Колонки.Вставить(ТекКолонка.Имя, ОписаниеКолонки);
	КонецЦикла;
	
	Для Каждого ТекСтрока Из Значение Цикл
		ВремТаб.Строки.Добавить(СтрокаЗначенийВСтруктуру(ТекСтрока, ВремТаб.Колонки));
	КонецЦикла;
	
	Возврат ВремТаб;
	
КонецФункции // ТаблицаЗначенийВСтруктуру()

// Функция рекурсивно преобразует массив структур с "простыми" типами значений в таблицу значений 1С
//
// Параметры:
//   СтруктураЗначения  - Структура           - Значение для преобразования
//     *__Тип             - Строка              - тип значения (ТаблицаЗначений)
//     *Колонки           - Структура           - описания колонок таблицы
//        **_ИмяКолонки_    - Структура           - описание колонки таблицы
//             ***Заголовок   - Строка              - заголовок колонки
//             ***ТипЗначения - Структура           - описание типа колонки
//             ***Ширина      - Строка              - ширина колонки по умолчанию
//     *Строки            - Массив из Структура - строки таблицы значений
//        **_ИмяКолонки_    - Произвольный        - значение поля таблицы значений
//   СписокСвойств     - Строка               - Список допустимых свойств
//                       Массив из Строка       (если пустой, то допустимы все свойства)
//   ИсключаяСвойства  - Строка               - Список исключаемых свойств
//                       Массив из Строка       (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   ТаблицаЗначений    - Результат преобразования
//
Функция ТаблицаЗначенийИзСтруктуры(СтруктураЗначения,
                                   СписокСвойств = Неопределено,
                                   ИсключаяСвойства = Неопределено) Экспорт
	
	ТипЗначения = ТипЗнч(СтруктураЗначения);
	
	Если ТипЗначения = Тип("Массив") Тогда
		Если СтруктураЗначения.Количество() = 0 Тогда
			Возврат Новый ТаблицаЗначений();
		КонецЕсли;
		Колонки = СтруктураЗначения[0];
		Строки = СтруктураЗначения;
	ИначеЕсли ТипЗначения = Тип("Структура") Тогда
		Если НЕ ЕстьТип(СтруктураЗначения) Тогда
			ВызватьИсключение "Не указан тип описания значения.";
		ИначеЕсли ПредставленияРавны(СтруктураЗначения.__Тип, "ТаблицаЗначений") Тогда
			Колонки = СтруктураЗначения.Колонки;
			Строки = СтруктураЗначения.Строки;
		Иначе
			ТекстОшибки = СтрШаблон("В описании значения указан некорректный тип значения ""%1"",
			                        | ожидается ""ТаблицаЗначений"".",
			                        СтруктураЗначения.__Тип);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Иначе
		ТекстОшибки = СтрШаблон("Некорректный тип описания значения ""%1"", ожидается ""Массив"" или ""Структура"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВремТаб = Новый ТаблицаЗначений();
	
	Для Каждого ТекЭлемент Из Колонки Цикл
		Если НЕ ИспользоватьСвойство(ТекЭлемент.Ключ, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(ТекЭлемент.Значение) = Тип("Структура") Тогда
			ВремТаб.Колонки.Добавить(ТекЭлемент.Ключ,
			                         ЗначениеИзСтруктуры(ТекЭлемент.Значение.ТипЗначения),
			                         ТекЭлемент.Значение.Заголовок,
			                         ТекЭлемент.Значение.Ширина);
		Иначе
			ВремТаб.Колонки.Добавить(ТекЭлемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ТипЗнч(Строки) = Тип("Массив") Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип строк описания таблицы значений ""%1"", ожидается ""Массив"".",
		                        ТипЗнч(Строки));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Для й = 0 По Строки.ВГраница() Цикл
		НоваяСтрока = ВремТаб.Добавить();
		Попытка
			СтрокаЗначенийИзСтруктуры(НоваяСтрока, Строки[й], ВремТаб.Колонки);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон("Ошибка заполнения таблицы значений, в строке %1:%2%3",
			                            й,
			                            Символы.ПС,
			                            ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
	Возврат ВремТаб;
	
КонецФункции // ТаблицаЗначенийИзСтруктуры()

// Функция рекурсивно преобразует дерево значений в структуру с "простыми" типами
//
// Параметры:
//   Значение            - ДеревоЗначений      - значение для преобразования
//   СписокСвойств       - Строка              - список допустимых свойств
//                         Массив из Строка      (если пустой, то допустимы все свойства)
//   ИсключаяСвойства    - Строка              - список исключаемых свойств
//                         Массив из Строка      (если пустой, то допустимы все свойства)
// Возвращаемое значение:
//   Структура                                 - результат преобразования
//     *__Тип             - Строка               - тип значения (ДеревоЗначений)
//     *Колонки           - Структура            - описания колонок дерева
//       **_ИмяКолонки_     - Структура            - описание колонки дерева
//           ***Заголовок   - Строка                 - заголовок колонки
//           ***ТипЗначения - Структура              - описание типа колонки
//           ***Ширина      - Строка                 - ширина колонки по умолчанию
//     *Строки            - Массив из Структура  - строки дерева значений
//       **_ИмяКолонки_     - Произвольный         - значение поля дерева значений
//
Функция ДеревоЗначенийВСтруктуру(Значение, СписокСвойств = Неопределено, ИсключаяСвойства = Неопределено) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если НЕ ТипЗначения = Тип("ДеревоЗначений") Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип значения ""%1"", ожидается ""ДеревоЗначений"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ВремДерево = Новый Структура();
	ВремДерево.Вставить("__Тип"  , "ДеревоЗначений");
	ВремДерево.Вставить("Колонки", Новый Структура());
	ВремДерево.Вставить("Строки" , Новый Массив());
	
	Для Каждого ТекКолонка Из Значение.Колонки Цикл
		Если НЕ ИспользоватьСвойство(ТекКолонка.Имя, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		Если ПредставленияРавны(ТекКолонка.Имя, "Родитель") Тогда
			ПоказатьСообщение("Имя колонки ""Родитель"" совпадает с именем свойства строки дерева значений,
			                  |колонка не может быть сохранена!");
			Продолжить;
		КонецЕсли;
		
		ОписаниеКолонки = Новый Структура();
		ОписаниеКолонки.Вставить("Заголовок"  , ТекКолонка.Заголовок);
		ОписаниеКолонки.Вставить("ТипЗначения", ЗначениеВСтруктуру(ТекКолонка.ТипЗначения));
		ОписаниеКолонки.Вставить("Ширина"     , ТекКолонка.Ширина);
		
		ВремДерево.Колонки.Вставить(ТекКолонка.Имя, ОписаниеКолонки);
	КонецЦикла;
	
	МассивКолонок = Новый Массив();
	Для Каждого ТекКолонка Из Значение.Колонки Цикл
		Если НЕ ИспользоватьСвойство(ТекКолонка.Имя, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		МассивКолонок.Добавить(ТекКолонка.Имя);
	КонецЦикла;
	
	ВремДерево.Строки = СтрокиДереваВСтруктуру(Значение.Строки, ВремДерево.Колонки);
	
	Возврат ВремДерево;
	
КонецФункции // ДеревоЗначенийВСтруктуру()

// Функция рекурсивно преобразует структуру с "простыми" типами значений в дерево значений 1С
//
// Параметры:
//   СтруктураЗначения    - Структура            - значение для преобразования
//     *__Тип               - Строка               - тип значения (ДеревоЗначений)
//     *Колонки             - Структура            - описания колонок дерева
//       **_ИмяКлонки_        - Структура            - описание колонки дерева
//           ***Заголовок       - Строка               - заголовок колонки
//           ***ТипЗначения     - Структура            - описание типа колонки
//           ***Ширина          - Строка               - ширина колонки по умолчанию
//     *Строки              - Массив из Структура  - строки дерева значений
//       **_ИмяКолонки_       - Произвольный         - значение поля дерева значений
//   СписокСвойств         - Строка              - список допустимых свойств
//                           Массив из Строка      (если пустой, то допустимы все свойства)
//   ИсключаяСвойства      - Строка              - список исключаемых свойств
//                           Массив из Строка      (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   ДеревоЗначений            - результат преобразования
//
Функция ДеревоЗначенийИзСтруктуры(СтруктураЗначения,
                                  СписокСвойств = Неопределено,
                                  ИсключаяСвойства = Неопределено) Экспорт
	
	ТипЗначения = ТипЗнч(СтруктураЗначения);
	
	Если ТипЗначения = Тип("Структура") Тогда
		Если НЕ ЕстьТип(СтруктураЗначения) Тогда
			Колонки = СтруктураЗначения.Строки[0];
			Строки = СтруктураЗначения.Строки;
		ИначеЕсли ПредставленияРавны(СтруктураЗначения.__Тип, "ДеревоЗначений") Тогда
			Колонки = СтруктураЗначения.Колонки;
			Строки = СтруктураЗначения.Строки;
		Иначе
			ТекстОшибки = СтрШаблон("В описании значения указан некорректный тип значения ""%1"",
			                        | ожидается ""ДеревоЗначений"".",
			                        СтруктураЗначения.__Тип);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
	Иначе
		ТекстОшибки = СтрШаблон("Некорректный тип описания значения ""%1"", ожидается ""Структура"".",
		                        ТипЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НЕ ТипЗнч(Строки) = Тип("Массив") Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип строк описания таблицы значений ""%1"", ожидается ""Массив"".",
		                        ТипЗнч(Строки));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НЕ СтруктураЗначения.Свойство("Колонки") И Строки.Количество() = 0 Тогда
		Возврат Новый ДеревоЗначений();
	КонецЕсли;
	
	ВремДерево = Новый ДеревоЗначений();
	
	Для Каждого ТекЭлемент Из Колонки Цикл
		Если НЕ ИспользоватьСвойство(ТекЭлемент.Ключ, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		Если ПредставленияРавны(ТекЭлемент.Ключ, "Родитель") Тогда
			ПоказатьСообщение("Имя колонки ""Родитель"" совпадает с именем свойства строки дерева значений,
			                  |колонка не может быть сохранена!");
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(ТекЭлемент.Значение) = Тип("Структура") Тогда
			ВремДерево.Колонки.Добавить(ТекЭлемент.Ключ,
			                         ЗначениеИзСтруктуры(ТекЭлемент.Значение.ТипЗначения),
			                         ТекЭлемент.Значение.Заголовок,
			                         ТекЭлемент.Значение.Ширина);
		Иначе
			ВремДерево.Колонки.Добавить(ТекЭлемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	СтрокиДереваИзСтруктуры(ВремДерево.Строки,
	                        Строки,
	                        ВремДерево.Колонки);
	
	Возврат ВремДерево;
	
КонецФункции // ДеревоЗначенийИзСтруктуры()

#КонецОбласти // ПреобразованияКоллекций

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиВыгрузкиЗагрузки

// Выполняет обработчик после сериализации объекта
//
// Параметры:
//  Значение             - Произвольный    - сериализуемый объект
//  СтруктураЗначения    - Структура       - результат сериализации
//
Процедура ВыполнитьОбработчикПослеВыгрузкиТипа(Значение, СтруктураЗначения)
	
	Обработчик = ОбработчикиПослеВыгрузкиТипов()[ВРег(СтруктураЗначения.__Тип)];
	
	Если Обработчик = Неопределено Тогда
		Обработчик = ОбработчикиПослеВыгрузкиТипов()["ПОУМОЛЧАНИЮ"];
	КонецЕсли;
	
	Если Обработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КодДополненияЗначения = СтрШаблон("Обработчик.Модуль.%1(Значение, СтруктураЗначения);",
	                                  СокрЛП(Обработчик.Процедура));
	
	Попытка
		Если БезопасныйРежимПД() Тогда
			УстановитьБезопасныйРежим(Истина);
		КонецЕсли;
		Выполнить(КодДополненияЗначения);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения обработчика ""%1"" после сериализации ""%2"" типа ""%3"": %4%5",
		                        СокрЛП(Обработчик.Процедура),
		                        СокрЛП(Значение),
		                        СтруктураЗначения.__Тип,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры // ВыполнитьОбработчикПослеВыгрузкиТипа()

// Функция - возвращает обработчик поиска ссылок на объекты при десериализации данных
//
// Параметры:
//  ПолноеИмяТипа    - Строка    - имя типа десериализуемого значения
//
// Возвращаемое значение:
//   Структура                   - обработчик поиска ссылок на объекты при десериализации
//     *ТипЗначения    - Строка    - имя типа значения целевых данных
//     *Функция        - Строка    - имя функции поиска значения
//     *Модуль         - Объект    - модуль из которого будет выполнен вызов функции поиска
//
Функция ОбработчикПоискаСсылок(ПолноеИмяТипа)
	
	Обработчик = ОбработчикиПоискаСсылок()[ВРег(ПолноеИмяТипа)];
	
	Если Обработчик = Неопределено Тогда
		Обработчик = ОбработчикиПоискаСсылок()["ПОУМОЛЧАНИЮ"];
		Если ТипЗнч(Обработчик) = Тип("Структура") Тогда
			Обработчик.Вставить("ТипЗначения", ПолноеИмяТипа);
		КонецЕсли;
	КонецЕсли;
	
	Если Обработчик = Неопределено Тогда
		Обработчик = Новый Структура();
		Обработчик.Вставить("ТипЗначения", ПолноеИмяТипа);
		Обработчик.Вставить("Функция"    , "НайтиЗначениеПоОписанию");
		Обработчик.Вставить("Модуль"     , ЭтотОбъект);
	КонецЕсли;
	
	Возврат Обработчик;
	
КонецФункции // ОбработчикПоискаСсылок()

// Функция - выполняет поиск ссылки по данным структуры десериализуемого значения
// если ссылка не найдена, возвращает "результат по умолчанию"
//
// Параметры:
//  СтруктураЗначения       - Структура      - десериализуемое значение
//  РезультатПоУмолчанию    - ЛюбаяСсылка    - значение, возвращаемое если ссылка не найдена
//
// Возвращаемое значение:
//  ЛюбаяСсылка    - найденная ссылка
//
Функция НайтиСсылку(СтруктураЗначения, РезультатПоУмолчанию = Неопределено)
	
	Результат = РезультатПоУмолчанию;
	
	Обработчик = ОбработчикПоискаСсылок(СтруктураЗначения.__Тип);
	
	Если Обработчик = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	КодПоискаСсылки =
		СтрШаблон("Результат = Обработчик.Модуль.%1(СтруктураЗначения);",
		          СокрЛП(Обработчик.Функция));
	
	Попытка
		Если БезопасныйРежимПД() Тогда
			УстановитьБезопасныйРежим(Истина);
		КонецЕсли;
		Выполнить(КодПоискаСсылки);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка поиска ссылки типа ""%1"" по описанию:%2%3",
		                        СтруктураЗначения.__Тип,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // НайтиСсылку()

// Выполняет обработчик после десериализации объекта
//
// Параметры:
//  Объект              - Произвольный    - десериализованый объект
//  СтруктураОбъекта    - Структура       - структура объекта для десериализации
//
Процедура ВыполнитьОбработчикПослеЗагрузкиТипа(Объект, СтруктураОбъекта)
	
	Обработчик = ОбработчикиПослеЗагрузкиТипов()[ВРег(СтруктураОбъекта.__Тип)];
	
	Если Обработчик = Неопределено Тогда
		Обработчик = ОбработчикиПослеЗагрузкиТипов()["ПОУМОЛЧАНИЮ"];
	КонецЕсли;
	
	Если Обработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	КодОбработчика = СтрШаблон("Обработчик.Модуль.%1(Объект, СтруктураОбъекта);",
	                           СокрЛП(Обработчик.Процедура));
	
	Попытка
		Если БезопасныйРежимПД() Тогда
			УстановитьБезопасныйРежим(Истина);
		КонецЕсли;
		Выполнить(КодОбработчика);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка выполнения обработчика ""%1""
		                        | после десериализации объекта ""%2"" типа ""%3"": %4%5",
		                        СокрЛП(Обработчик.Процедура),
		                        СтруктураОбъекта.Ссылка.Представление,
		                        СтруктураОбъекта.__Тип,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры // ВыполнитьОбработчикПослеЗагрузкиТипа()

#КонецОбласти // ОбработчикиВыгрузкиЗагрузки

#Область ПреобразованияСКДПроцедурыПреобразованияОбъектов

// Функция - заполняет и возвращает структуру описания объекта СКД
// ВариантНастроекКомпоновкиДанных
//
// Параметры:
//     Объект             - ВариантНастроекКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ВариантНастроекСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ВариантНастроекКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ВариантНастроекКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Имя"          , Объект.Имя);
	СтруктураОбъекта.Вставить("Настройки"    , ЗначениеСКДВСтруктуру(Объект.Настройки));
	СтруктураОбъекта.Вставить("Представление", Объект.Представление);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ВариантНастроекСКДВСтруктуру()

// Процедура - заполняет объект СКД ВариантНастроекКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ВариантНастроекКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура ВариантНастроекСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ВариантНастроекКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Настройки", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Представление");
	
КонецПроцедуры // ВариантНастроекСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ВложеннаяСхемаКомпоновкиДанных
//
// Параметры:
//     Объект             - ВложеннаяСхемаКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ВложеннаяСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ВложеннаяСхемаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ВложеннаяСхемаКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Заголовок", Объект.Заголовок);
	СтруктураОбъекта.Вставить("Имя"      , Объект.Имя);
	СтруктураОбъекта.Вставить("Настройки", ЗначениеСКДВСтруктуру(Объект.Настройки));
	СтруктураОбъекта.Вставить("Схема"    , ЗначениеСКДВСтруктуру(Объект.Схема));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ВложеннаяСКДВСтруктуру()

// Процедура - заполняет объект СКД ВложеннаяСхемаКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ВложеннаяСхемаКомпоновкиДанных  - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура ВложеннаяСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ВложеннаяСхемаКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Заголовок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Настройки", Истина);
	
	Если НЕ ТипЗнч(Объект.Схема) = Тип("СхемаКомпоновкиДанных") Тогда
		// @skip-warning - в СП написано, что поле имеет свойство "Только чтение",
		// но при добавлении вложенной схемы поле содержит неопределено и присваивание допускается
		Объект.Схема = Новый СхемаКомпоновкиДанных();
	КонецЕсли;
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Схема", Истина);
	
КонецПроцедуры // ВложеннаяСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ВычисляемоеПолеСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - ВычисляемоеПолеСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ВычисляемоеПолеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ВычисляемоеПолеСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ВычисляемоеПолеСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Выражение"               , Объект.Выражение);
	СтруктураОбъекта.Вставить("ВыражениеПредставления"  , Объект.ВыражениеПредставления);
	СтруктураОбъекта.Вставить("ВыраженияУпорядочивания" , КоллекцияСКДВМассив(Объект.ВыраженияУпорядочивания));
	СтруктураОбъекта.Вставить("Заголовок"               , Объект.Заголовок);
	СтруктураОбъекта.Вставить("ОграничениеИспользования", ЗначениеСКДВСтруктуру(Объект.ОграничениеИспользования));
	СтруктураОбъекта.Вставить("Оформление"              , ЗначениеСКДВСтруктуру(Объект.Оформление));
	СтруктураОбъекта.Вставить("ПараметрыРедактирования" , ЗначениеСКДВСтруктуру(Объект.ПараметрыРедактирования));
	СтруктураОбъекта.Вставить("ПутьКДанным"             , Объект.ПутьКДанным);
	СтруктураОбъекта.Вставить("ТипЗначения"             , ЗначениеВСтруктуру(Объект.ТипЗначения));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ВычисляемоеПолеСКДВСтруктуру()

// Процедура - заполняет объект СКД ВычисляемоеПолеСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ВычисляемоеПолеСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                            - данные для заполнения объекта
//
Процедура ВычисляемоеПолеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ВычисляемоеПолеСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Выражение");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ВыражениеПредставления");
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "ВыраженияУпорядочивания");
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Заголовок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ОграничениеИспользования", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Оформление", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПараметрыРедактирования", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПутьКДанным");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ОграничениеИспользования", Истина);
	
	Если СтруктураОбъекта.Свойство("ТипЗначения") Тогда
		Объект.ТипЗначения = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипЗначения);
	КонецЕсли;
	
КонецПроцедуры // ВычисляемоеПолеСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ИсточникДанныхСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - ИсточникДанныхСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ИсточникДанныхСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ИсточникДанныхСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ИсточникДанныхСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Имя"               , Объект.Имя);
	СтруктураОбъекта.Вставить("СтрокаСоединения"  , Объект.СтрокаСоединения);
	СтруктураОбъекта.Вставить("ТипИсточникаДанных", Объект.ТипИсточникаДанных);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ИсточникДанныхСКДВСтруктуру()

// Процедура - заполняет объект СКД ИсточникДанныхСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ИсточникДанныхСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                           - данные для заполнения объекта
//
Процедура ИсточникДанныхСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ИсточникДанныхСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "СтрокаСоединения");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ТипИсточникаДанных");
	
КонецПроцедуры // ИсточникДанныхСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ОписаниеМакетаСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - ОписаниеМакетаСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ОписаниеМакетаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ОписаниеМакетаСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ОписаниеМакетаСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Имя"    , Объект.Имя);
	
	Если ТипЗнч(Объект.Макет) = Тип("МакетОбластиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("Макет" , КоллекцияСКДВМассив(Объект.Макет));
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Параметры" , КоллекцияСКДВМассив(Объект.Параметры));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ОписаниеМакетаСКДВСтруктуру()

// Процедура - заполняет объект СКД ОписаниеМакетаСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ОписаниеМакетаСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                           - данные для заполнения объекта
//
Процедура ОписаниеМакетаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ОписаниеМакетаСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	
	Если СтруктураОбъекта.Свойство("Макет") Тогда
		Для Каждого ТекЭлемент Из СтруктураОбъекта.Макет Цикл
			Если НЕ ТипЗнч(Объект.Макет) = Тип("МакетОбластиКомпоновкиДанных") Тогда
				Объект.Макет = Новый МакетОбластиКомпоновкиДанных();
			КонецЕсли;
			НовыйЭлемент = Объект.Макет.Добавить(Тип(ТекЭлемент.__Тип));
			ЗначениеСКДИзСтруктуры(НовыйЭлемент, ТекЭлемент);
		КонецЦикла;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Параметры", Истина);
	
КонецПроцедуры // ОписаниеМакетаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// МакетГруппировкиСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - МакетГруппировкиСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция МакетГруппировкиСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("МакетГруппировкиСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "МакетГруппировкиСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИмяГруппировки" , Объект.ИмяГруппировки);
	СтруктураОбъекта.Вставить("Макет"          , Объект.Макет);
	СтруктураОбъекта.Вставить("ПоляГруппировки", КоллекцияСКДВМассив(Объект.ПоляГруппировки));
	СтруктураОбъекта.Вставить("ТипМакета"      , ЗначениеВСтруктуру(Объект.ТипМакета));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // МакетГруппировкиСКДВСтруктуру()

// Процедура - заполняет объект СКД МакетГруппировкиСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - МакетГруппировкиСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                             - данные для заполнения объекта
//
Процедура МакетГруппировкиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("МакетГруппировкиСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИмяГруппировки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Макет");
	
	Если СтруктураОбъекта.Свойство("ПоляГруппировки") Тогда
		Для Каждого ТекЭлемент Из СтруктураОбъекта.ПоляГруппировки Цикл
			Объект.ПоляГруппировки.Добавить(Новый ПолеКомпоновкиДанных(ТекЭлемент.Имя));
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ТипМакета") Тогда
		Объект.ТипМакета = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипМакета);
	КонецЕсли;
	
КонецПроцедуры // МакетГруппировкиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// МакетПоляСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - МакетПоляСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция МакетПоляСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("МакетПоляСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "МакетПоляСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Макет", Объект.Макет);
	СтруктураОбъекта.Вставить("Поле" , Объект.Поле);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // МакетПоляСКДВСтруктуру()

// Процедура - заполняет объект СКД МакетПоляСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - МакетПоляСхемыКомпоновкиДанных  - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура МакетПоляСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("МакетПоляСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Макет");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Поле");
	
КонецПроцедуры // МакетПоляСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// МакетПолейИтогаСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - МакетПолейИтогаСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция МакетПолейИтогаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("МакетПолейИтогаСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "МакетПолейИтогаСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИмяГруппировки1" , Объект.ИмяГруппировки1);
	СтруктураОбъекта.Вставить("ИмяГруппировки2" , Объект.ИмяГруппировки2);
	СтруктураОбъекта.Вставить("Макет"           , Объект.Макет);
	СтруктураОбъекта.Вставить("ПоляГруппировки1", КоллекцияСКДВМассив(Объект.ПоляГруппировки1));
	СтруктураОбъекта.Вставить("ПоляГруппировки2", КоллекцияСКДВМассив(Объект.ПоляГруппировки2));
	СтруктураОбъекта.Вставить("ТипМакета1"      , ЗначениеВСтруктуру(Объект.ТипМакета1));
	СтруктураОбъекта.Вставить("ТипМакета2"      , ЗначениеВСтруктуру(Объект.ТипМакета2));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // МакетПолейИтогаСКДВСтруктуру()

// Процедура - заполняет объект СКД МакетПолейИтогаСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - МакетПолейИтогаСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                            - данные для заполнения объекта
//
Процедура МакетПолейИтогаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("МакетПолейИтогаСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИмяГруппировки1");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИмяГруппировки2");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Макет");
	
	Если СтруктураОбъекта.Свойство("ПоляГруппировки1") Тогда
		Для Каждого ТекЭлемент Из СтруктураОбъекта.ПоляГруппировки1 Цикл
			Объект.ПоляГруппировки1.Добавить(Новый ПолеКомпоновкиДанных(ТекЭлемент.Имя));
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ПоляГруппировки2") Тогда
		Для Каждого ТекЭлемент Из СтруктураОбъекта.ПоляГруппировки2 Цикл
			Объект.ПоляГруппировки2.Добавить(Новый ПолеКомпоновкиДанных(ТекЭлемент.Имя));
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ТипМакета1") Тогда
		Объект.ТипМакета1 = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипМакета1);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ТипМакета2") Тогда
		Объект.ТипМакета2 = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипМакета2);
	КонецЕсли;
	
КонецПроцедуры // МакетПолейИтогаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// НаборДанныхЗапросСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - НаборДанныхЗапросСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция НаборДанныхЗапросСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "НаборДанныхЗапросСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("АвтозаполнениеДоступныхПолей", Объект.АвтозаполнениеДоступныхПолей);
	СтруктураОбъекта.Вставить("Запрос"                      , Объект.Запрос);
	СтруктураОбъекта.Вставить("Имя"                         , Объект.Имя);
	СтруктураОбъекта.Вставить("ИсточникДанных"              , Объект.ИсточникДанных);
	СтруктураОбъекта.Вставить("Поля"                        , КоллекцияСКДВМассив(Объект.Поля));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // НаборДанныхЗапросСКДВСтруктуру()

// Процедура - заполняет объект СКД НаборДанныхЗапросСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - НаборДанныхЗапросСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                              - данные для заполнения объекта
//
Процедура НаборДанныхЗапросСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "АвтозаполнениеДоступныхПолей");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Запрос");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИсточникДанных");
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Поля", Истина);
	
КонецПроцедуры // НаборДанныхЗапросСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// НаборДанныхОбъектСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - НаборДанныхОбъектСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция НаборДанныхОбъектСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "НаборДанныхОбъектСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Имя"           , Объект.Имя);
	СтруктураОбъекта.Вставить("ИмяОбъекта"    , Объект.ИмяОбъекта);
	СтруктураОбъекта.Вставить("ИсточникДанных", Объект.ИсточникДанных);
	СтруктураОбъекта.Вставить("Поля"          , КоллекцияСКДВМассив(Объект.Поля));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // НаборДанныхОбъектСКДВСтруктуру()

// Процедура - заполняет объект СКД НаборДанныхОбъектСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - НаборДанныхОбъектСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                              - данные для заполнения объекта
//
Процедура НаборДанныхОбъектСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИмяОбъекта");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИсточникДанных");
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Поля", Истина);
	
КонецПроцедуры // НаборДанныхОбъектСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// НаборДанныхОбъединениеСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - НаборДанныхОбъединениеСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция НаборДанныхОбъединениеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "НаборДанныхОбъединениеСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Имя"     , Объект.Имя);
	СтруктураОбъекта.Вставить("Поля"    , КоллекцияСКДВМассив(Объект.Поля));
	СтруктураОбъекта.Вставить("Элементы", КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // НаборДанныхОбъединениеСКДВСтруктуру()

// Процедура - заполняет объект СКД НаборДанныхОбъединениеСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - НаборДанныхОбъединениеСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                   - данные для заполнения объекта
//
Процедура НаборДанныхОбъединениеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Поля", Истина);
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы", Истина);
	
КонецПроцедуры // НаборДанныхОбъединениеСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПараметрСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - ПараметрСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПараметрСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПараметрСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ВключатьВДоступныеПоля"        , Объект.ВключатьВДоступныеПоля);
	СтруктураОбъекта.Вставить("Выражение"                     , Объект.Выражение);
	СтруктураОбъекта.Вставить("ДоступенСписокЗначений"        , Объект.ДоступенСписокЗначений);
	СтруктураОбъекта.Вставить("Заголовок"                     , Объект.Заголовок);
	СтруктураОбъекта.Вставить("ЗапрещатьНезаполненныеЗначения", Объект.ЗапрещатьНезаполненныеЗначения);
	СтруктураОбъекта.Вставить("Значение"                      , ЗначениеВСтруктуру(Объект.Значение));
	СтруктураОбъекта.Вставить("Имя"                           , Объект.Имя);
	
	СтруктураОбъекта.Вставить("Использование",
	                          ЗначениеВСтруктуру(Объект.Использование));
	
	СтруктураОбъекта.Вставить("ОграничениеИспользования"      , Объект.ОграничениеИспользования);
	СтруктураОбъекта.Вставить("ПараметрФункциональныхОпций"   , Объект.ПараметрФункциональныхОпций);
	
	СтруктураОбъекта.Вставить("ПараметрыРедактирования",
	                          ЗначениеСКДВСтруктуру(Объект.ПараметрыРедактирования));
	                          
	СтруктураОбъекта.Вставить("ТипЗначения"                   , ЗначениеВСтруктуру(Объект.ТипЗначения));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПараметрСКДВСтруктуру()

// Процедура - заполняет объект СКД ПараметрСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПараметрСхемыКомпоновкиДанных   - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура ПараметрСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ВключатьВДоступныеПоля");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Выражение");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ДоступенСписокЗначений");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Заголовок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ЗапрещатьНезаполненныеЗначения");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ОграничениеИспользования");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПараметрФункциональныхОпций");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПараметрыРедактирования", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ЗапрещатьНезаполненныеЗначения");
	
	Если СтруктураОбъекта.Свойство("Значение") Тогда
		Объект.Значение = ЗначениеИзСтруктуры(СтруктураОбъекта.Значение);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("Использование") Тогда
		Объект.Использование = ЗначениеИзСтруктуры(СтруктураОбъекта.Использование);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ТипЗначения") Тогда
		Объект.ТипЗначения = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипЗначения);
	КонецЕсли;
	
КонецПроцедуры // ПараметрСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПолеИтогаСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - ПолеИтогаСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПолеИтогаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПолеИтогаСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПолеИтогаСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Выражение"  , Объект.Выражение);
	СтруктураОбъекта.Вставить("ПутьКДанным", Объект.ПутьКДанным);
	
	МассивЭлементов = Новый Массив();
	Для Каждого ТекЭлемент Из Объект.Группировки Цикл
		// TODO: Проверить тип элемента массива группировок (вроде - Строка)
		МассивЭлементов.Добавить(СокрЛП(ТекЭлемент));
	КонецЦикла;
	СтруктураОбъекта.Вставить("Группировки", МассивЭлементов);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПолеИтогаСКДВСтруктуру()

// Процедура - заполняет объект СКД ПолеИтогаСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПолеИтогаСхемыКомпоновкиДанных  - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура ПолеИтогаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПолеИтогаСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Выражение");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПутьКДанным");
	
	Если СтруктураОбъекта.Свойство("Группировки") Тогда
		Для Каждого ТекЭлемент Из СтруктураОбъекта.Группировки Цикл
			Объект.Группировки.Добавить(ТекЭлемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ПолеИтогаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// СвязьНаборовДанныхСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - СвязьНаборовДанныхСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция СвязьНаборовДанныхСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("СвязьНаборовДанныхСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "СвязьНаборовДанныхСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ВыражениеИсточник"       , Объект.ВыражениеИсточник);
	СтруктураОбъекта.Вставить("ВыражениеПриемник"       , Объект.ВыражениеПриемник);
	СтруктураОбъекта.Вставить("НаборДанныхИсточник"     , Объект.НаборДанныхИсточник);
	СтруктураОбъекта.Вставить("НаборДанныхПриемник"     , Объект.НаборДанныхПриемник);
	СтруктураОбъекта.Вставить("НачальноеВыражение"      , Объект.НачальноеВыражение);
	СтруктураОбъекта.Вставить("Обязательная"            , Объект.Обязательная);
	СтруктураОбъекта.Вставить("Параметр"                , Объект.Параметр);
	СтруктураОбъекта.Вставить("РазрешенСписокПараметров", Объект.РазрешенСписокПараметров);
	СтруктураОбъекта.Вставить("УсловиеСвязи"            , Объект.УсловиеСвязи);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // СвязьНаборовДанныхСКДВСтруктуру()

// Процедура - заполняет объект СКД СвязьНаборовДанныхСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - СвязьНаборовДанныхСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                               - данные для заполнения объекта
//
Процедура СвязьНаборовДанныхСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("СвязьНаборовДанныхСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ВыражениеИсточник");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ВыражениеПриемник");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "НаборДанныхИсточник");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "НаборДанныхПриемник");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "НачальноеВыражение");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Обязательная");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Параметр");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "РазрешенСписокПараметров");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "УсловиеСвязи");
	
КонецПроцедуры // СвязьНаборовДанныхСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ВыражениеУпорядочиванияКомпоновкиДанных
//
// Параметры:
//     Объект             - ВыражениеУпорядочиванияКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ВыражениеУпорядочиванияСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ВыражениеУпорядочиванияКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ВыражениеУпорядочиванияКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Автоупорядочивание", Объект.Автоупорядочивание);
	СтруктураОбъекта.Вставить("Выражение"         , Объект.Выражение);
	СтруктураОбъекта.Вставить("ТипУпорядочивания",
	                          ЗначениеВСтруктуру(Объект.ТипУпорядочивания));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ВыражениеУпорядочиванияСКДВСтруктуру()

// Процедура - заполняет объект СКД ВыражениеУпорядочиванияКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ВыражениеУпорядочиванияКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                               - данные для заполнения объекта
//
Процедура ВыражениеУпорядочиванияСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ВыражениеУпорядочиванияКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Автоупорядочивание");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Выражение");
	
	Если СтруктураОбъекта.Свойство("ТипУпорядочивания") Тогда
		Объект.ТипУпорядочивания = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипУпорядочивания);
	КонецЕсли;
	
КонецПроцедуры // ВыражениеУпорядочиванияСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ОграничениеИспользованияПоляСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - ОграничениеИспользованияПоляСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ОграничениеИспользованияПоляСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ОграничениеИспользованияПоляСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ОграничениеИспользованияПоляСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Группировка", Объект.Группировка);
	СтруктураОбъекта.Вставить("Поле"       , Объект.Поле);
	СтруктураОбъекта.Вставить("Порядок"    , Объект.Порядок);
	СтруктураОбъекта.Вставить("Условие"    , Объект.Условие);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ОграничениеИспользованияПоляСКДВСтруктуру()

// Процедура - заполняет объект СКД ОграничениеИспользованияПоляСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ОграничениеИспользованияПоляСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                         - данные для заполнения объекта
//
Процедура ОграничениеИспользованияПоляСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ОграничениеИспользованияПоляСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Группировка");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Поле");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Порядок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Условие");
	
КонецПроцедуры // ОграничениеИспользованияПоляСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ОформлениеКомпоновкиДанных
//
// Параметры:
//     Объект             - ОформлениеКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ОформлениеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ОформлениеКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ОформлениеКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы", КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ОформлениеСКДВСтруктуру()

// Процедура - заполняет объект СКД ОформлениеКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ОформлениеКомпоновкиДанных   - заполняемый объект
//     СтруктураОбъекта   - Структура                    - данные для заполнения объекта
//
Процедура ОформлениеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ОформлениеКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПараметровОбъектаСКДИзСтруктуры(Объект, Объект, СтруктураОбъекта);
	
КонецПроцедуры // ОформлениеСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ЗначениеПараметраНастроекКомпоновкиДанных
//
// Параметры:
//     Объект             - ЗначениеПараметраНастроекКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ЗначениеПараметраНастроекСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ЗначениеПараметраНастроекКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Значение"     , ЗначениеВСтруктуру(Объект.Значение));
	СтруктураОбъекта.Вставить("Использование", Объект.Использование);
	СтруктураОбъекта.Вставить("Параметр"     , СокрЛП(Объект.Параметр));
	
	СтруктураОбъекта.Вставить("ЗначенияВложенныхПараметров",
	                          КоллекцияСКДВМассив(Объект.ЗначенияВложенныхПараметров));
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	
	// TODO: Проверить как работает родитель
	Возврат СтруктураОбъекта;
	
КонецФункции // ЗначениеПараметраНастроекСКДВСтруктуру()

// Процедура - заполняет объект СКД ЗначениеПараметраНастроекКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ЗначениеПараметраНастроекКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                 - данные для заполнения объекта
//
Процедура ЗначениеПараметраНастроекСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("Значение") Тогда
		Объект.Значение = ЗначениеИзСтруктуры(СтруктураОбъекта.Значение);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "ЗначенияВложенныхПараметров");
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	
	Если СтруктураОбъекта.Свойство("Параметр") Тогда
		Объект.Параметр = Новый ПараметрКомпоновкиДанных(СтруктураОбъекта.Параметр);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
КонецПроцедуры // ЗначениеПараметраНастроекСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ЗначениеПараметраКомпоновкиДанных
//
// Параметры:
//     Объект             - ЗначениеПараметраКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ЗначениеПараметраСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ЗначениеПараметраКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Значение"     , ЗначениеВСтруктуру(Объект.Значение));
	СтруктураОбъекта.Вставить("Использование", Объект.Использование);
	СтруктураОбъекта.Вставить("Параметр"     , СокрЛП(Объект.Параметр));
	
	СтруктураОбъекта.Вставить("ЗначенияВложенныхПараметров",
	                          КоллекцияСКДВМассив(Объект.ЗначенияВложенныхПараметров));
	
	// TODO: Проверить как работает родитель
	Возврат СтруктураОбъекта;
	
КонецФункции // ЗначениеПараметраСКДВСтруктуру()

// Процедура - заполняет объект СКД ЗначениеПараметраКомпоновкиДанных из структуры описания объекта
//
// Параметры:
//     Объект             - ЗначениеПараметраКомпоновкиДанных  - заполняемый объект
//     СтруктураОбъекта   - Структура                          - данные для заполнения объекта
//
Процедура ЗначениеПараметраСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("Значение") Тогда
		ВремЗначение = ЗначениеИзСтруктуры(СтруктураОбъекта.Значение);
		// Обработка случая пустого значения несериализуемого типа
		Если НЕ ВремЗначение = Неопределено ИЛИ ТипЗнч(Объект.Значение) = Тип("Неопределено") Тогда
			Объект.Значение = ВремЗначение;
		КонецЕсли;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "ЗначенияВложенныхПараметров");
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	
	Если СтруктураОбъекта.Свойство("Параметр") Тогда
		Объект.Параметр = Новый ПараметрКомпоновкиДанных(СтруктураОбъекта.Параметр);
	КонецЕсли;
	
КонецПроцедуры // ЗначениеПараметраСКДИзСтруктуры()

// Процедура - заполняет коллекцию объектов СКД ЗначениеПараметраНастроекКомпоновкиДанных,
// ЗначениеПараметраКомпоновкиДанных из структуры описания объекта
//
// Параметры:
//     ОбъектВладелец           - Произвольный  - объект верхнего уровня, содержащий заполняемые коллекции,
//                                                для проверки доступных параметров
//     Объект                   - Произвольный     - объект, содержащий заполняемую коллекцию
//     СтруктураОбъекта         - Структура     - данные для заполнения коллекции
//     ИмяКоллекцииПараметров   - Строка        - имя заполняемой коллекции
//
Процедура ЗначенияПараметровОбъектаСКДИзСтруктуры(ОбъектВладелец,
                                                  Объект,
                                                  СтруктураОбъекта,
                                                  ИмяКоллекцииПараметров = "Элементы")
	
	Если НЕ СтруктураОбъекта.Свойство(ИмяКоллекцииПараметров) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из СтруктураОбъекта[ИмяКоллекцииПараметров] Цикл
		Если ОбъектВладелец.ДоступныеПараметры = Неопределено Тогда
			НовыйЭлемент = Объект[ИмяКоллекцииПараметров].Добавить();
			ЗначениеСКДИзСтруктуры(НовыйЭлемент, ТекЭлемент);
		Иначе	
			ТекПараметр = ОбъектВладелец.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ТекЭлемент.Параметр));
			Если ТекПараметр = Неопределено Тогда
				// Обработка десериализации СКД из новой версии платформы в старой версии
				Продолжить;
			КонецЕсли;
			ВремЗначение = ЗначениеИзСтруктуры(ТекЭлемент.Значение);
			// Обработка случая пустого значения несериализуемого типа
			Если НЕ ВремЗначение = Неопределено ИЛИ ТипЗнч(ТекПараметр.Значение) = Тип("Неопределено") Тогда
				ТекПараметр.Значение = ВремЗначение;
			КонецЕсли;
			ЗначенияПараметровОбъектаСКДИзСтруктуры(ОбъектВладелец, ТекПараметр, ТекЭлемент, "ЗначенияВложенныхПараметров");
			ТекПараметр.Использование = ТекЭлемент.Использование;
			Если ТипЗнч(ТекПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
				ТекПараметр.ИдентификаторПользовательскойНастройки = ТекЭлемент.ИдентификаторПользовательскойНастройки;
				ТекПараметр.ПредставлениеПользовательскойНастройки = ТекЭлемент.ПредставлениеПользовательскойНастройки;
				ТекПараметр.РежимОтображения = ЗначениеИзСтруктуры(ТекЭлемент.РежимОтображения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗначенияПараметровОбъектаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПараметрыРедактированияКомпоновкиДанных
//
// Параметры:
//     Объект             - ПараметрыРедактированияКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПараметрыРедактированияСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрыРедактированияКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПараметрыРедактированияКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы", КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПараметрыРедактированияСКДВСтруктуру()

// Процедура - заполняет объект СКД ПараметрыРедактированияКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПараметрыРедактированияКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                               - данные для заполнения объекта
//
Процедура ПараметрыРедактированияСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрыРедактированияКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПараметровОбъектаСКДИзСтруктуры(Объект, Объект, СтруктураОбъекта);
	
КонецПроцедуры // ПараметрыРедактированияСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// СтрокаТаблицыОбластиКомпоновкиДанных
//
// Параметры:
//     Объект             - СтрокаТаблицыОбластиКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция СтрокаТаблицыОбластиСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("СтрокаТаблицыОбластиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "СтрокаТаблицыОбластиКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИдентификаторТаблицы", Объект.ИдентификаторТаблицы);
	СтруктураОбъекта.Вставить("Ячейки"              , КоллекцияСКДВМассив(Объект.Ячейки));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // СтрокаТаблицыОбластиСКДВСтруктуру()

// Процедура - заполняет объект СКД СтрокаТаблицыОбластиКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - СтрокаТаблицыОбластиКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                            - данные для заполнения объекта
//
Процедура СтрокаТаблицыОбластиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("СтрокаТаблицыОбластиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторТаблицы");
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Ячейки");
	
КонецПроцедуры // СтрокаТаблицыОбластиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ЯчейкаТаблицыОбластиКомпоновкиДанных
//
// Параметры:
//     Объект             - ЯчейкаТаблицыОбластиКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ЯчейкаТаблицыОбластиСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ЯчейкаТаблицыОбластиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ЯчейкаТаблицыОбластиКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Оформление", ЗначениеСКДВСтруктуру(Объект.Оформление));
	СтруктураОбъекта.Вставить("Элементы"  , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ЯчейкаТаблицыОбластиСКДВСтруктуру()

// Процедура - заполняет объект СКД ЯчейкаТаблицыОбластиКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ЯчейкаТаблицыОбластиКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                            - данные для заполнения объекта
//
Процедура ЯчейкаТаблицыОбластиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ЯчейкаТаблицыОбластиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Оформление", Истина);
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы", Истина);
	
КонецПроцедуры // ЯчейкаТаблицыОбластиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ОформлениеЯчейкиТаблицыОбластиКомпоновкиДанных
//
// Параметры:
//     Объект             - ОформлениеЯчейкиТаблицыОбластиКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ОформлениеЯчейкиТаблицыОбластиСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ОформлениеЯчейкиТаблицыОбластиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ОформлениеЯчейкиТаблицыОбластиКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы"  , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ОформлениеЯчейкиТаблицыОбластиСКДВСтруктуру()

// Процедура - заполняет объект СКД ОформлениеЯчейкиТаблицыОбластиКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ОформлениеЯчейкиТаблицыОбластиКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                      - данные для заполнения объекта
//
Процедура ОформлениеЯчейкиТаблицыОбластиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ОформлениеЯчейкиТаблицыОбластиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПараметровОбъектаСКДИзСтруктуры(Объект, Объект, СтруктураОбъекта);
	
КонецПроцедуры // ОформлениеЯчейкиТаблицыОбластиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ОформлениеПоляОбластиКомпоновкиДанных
//
// Параметры:
//     Объект             - ОформлениеПоляОбластиКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ОформлениеПоляОбластиСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ОформлениеПоляОбластиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ОформлениеПоляОбластиКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы"  , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ОформлениеПоляОбластиСКДВСтруктуру()

// Процедура - заполняет объект СКД ОформлениеПоляОбластиКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ОформлениеПоляОбластиКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                             - данные для заполнения объекта
//
Процедура ОформлениеПоляОбластиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ОформлениеПоляОбластиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПараметровОбъектаСКДИзСтруктуры(Объект, Объект, СтруктураОбъекта);
	
КонецПроцедуры // ОформлениеПоляОбластиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПараметрОбластиВыражениеКомпоновкиДанных
//
// Параметры:
//     Объект             - ПараметрОбластиВыражениеКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПараметрОбластиВыражениеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрОбластиВыражениеКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПараметрОбластиВыражениеКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Имя"      , Объект.Имя);
	СтруктураОбъекта.Вставить("Выражение", Объект.Выражение);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПараметрОбластиВыражениеСКДВСтруктуру()

// Процедура - заполняет объект СКД ПараметрОбластиВыражениеКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПараметрОбластиВыражениеКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                - данные для заполнения объекта
//
Процедура ПараметрОбластиВыражениеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрОбластиВыражениеКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Выражение");
	
КонецПроцедуры // ПараметрОбластиВыражениеСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПараметрОбластиРасшифровкаКомпоновкиДанных
//
// Параметры:
//     Объект             - ПараметрОбластиРасшифровкаКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПараметрОбластиРасшифровкаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрОбластиРасшифровкаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПараметрОбластиРасшифровкаКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Имя"           , Объект.Имя);
	СтруктураОбъекта.Вставить("ВыраженияПолей", КоллекцияСКДВМассив(Объект.ВыраженияПолей));
	
	СтруктураОбъекта.Вставить("ОсновноеДействие",
	                          ЗначениеВСтруктуру(Объект.ОсновноеДействие));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПараметрОбластиРасшифровкаСКДВСтруктуру()

// Процедура - заполняет объект СКД ПараметрОбластиРасшифровкаКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПараметрОбластиРасшифровкаКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                  - данные для заполнения объекта
//
Процедура ПараметрОбластиРасшифровкаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрОбластиРасшифровкаКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "ВыраженияПолей");
	
	Если СтруктураОбъекта.Свойство("ОсновноеДействие") Тогда
		Объект.ОсновноеДействие = ЗначениеИзСтруктуры(СтруктураОбъекта.ОсновноеДействие);
	КонецЕсли;
	
КонецПроцедуры // ПараметрОбластиРасшифровкаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ВыражениеПоляПараметраОбластиРасшифровкаКомпоновкиДанных
//
// Параметры:
//     Объект             - ВыражениеПоляПараметраОбластиРасшифровкаКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ВыражениеПоляПараметраРасшифровкиСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ВыражениеПоляПараметраОбластиРасшифровкаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ВыражениеПоляПараметраОбластиРасшифровкаКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Выражение", Объект.Выражение);
	СтруктураОбъекта.Вставить("Поле"     , Объект.Поле);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ВыражениеПоляПараметраРасшифровкиСКДВСтруктуру()

// Процедура - заполняет объект СКД ВыражениеПоляПараметраОбластиРасшифровкаКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ВыражениеПоляПараметраОбластиРасшифровкаКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                                - данные для заполнения объекта
//
Процедура ВыражениеПоляПараметраРасшифровкиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ВыражениеПоляПараметраОбластиРасшифровкаКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Выражение");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Поле");
	
КонецПроцедуры // ВыражениеПоляПараметраРасшифровкиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПолеОбластиКомпоновкиДанных
//
// Параметры:
//     Объект             - ПолеОбластиКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПолеОбластиСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПолеОбластиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПолеОбластиКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Значение"  , ЗначениеВСтруктуру(Объект.Значение));
	СтруктураОбъекта.Вставить("Оформление", ЗначениеСКДВСтруктуру(Объект.Оформление));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПолеОбластиСКДВСтруктуру()

// Процедура - заполняет объект СКД ПолеОбластиКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПолеОбластиКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                   - данные для заполнения объекта
//
Процедура ПолеОбластиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПолеОбластиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("Значение") Тогда
		Объект.Значение = ЗначениеИзСтруктуры(СтруктураОбъекта.Значение);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Оформление", Истина);
	
КонецПроцедуры // ПолеОбластиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПолеНабораДанныхСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - ПолеНабораДанныхСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПолеНабораДанныхПолеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПолеНабораДанныхСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ВыражениеПредставления"     , Объект.ВыражениеПредставления);
	СтруктураОбъекта.Вставить("ВыраженияУпорядочивания"    , КоллекцияСКДВМассив(Объект.ВыраженияУпорядочивания));
	СтруктураОбъекта.Вставить("Заголовок"                  , Объект.Заголовок);
	СтруктураОбъекта.Вставить("НаборДанныхПроверкиИерархии", Объект.НаборДанныхПроверкиИерархии);
	
	СтруктураОбъекта.Вставить("ОграничениеИспользования",
	                          ЗначениеСКДВСтруктуру(Объект.ОграничениеИспользования));
	СтруктураОбъекта.Вставить("ОграничениеИспользованияРеквизитов",
	                          ЗначениеСКДВСтруктуру(Объект.ОграничениеИспользованияРеквизитов));
	                          
	СтруктураОбъекта.Вставить("Оформление", ЗначениеСКДВСтруктуру(Объект.Оформление));
	СтруктураОбъекта.Вставить("ПараметрНабораДанныхПроверкиИерархии", Объект.ПараметрНабораДанныхПроверкиИерархии);
	
	СтруктураОбъекта.Вставить("ПараметрыРедактирования",
	                          ЗначениеСКДВСтруктуру(Объект.ПараметрыРедактирования));
	                          
	СтруктураОбъекта.Вставить("Поле"       , Объект.Поле);
	СтруктураОбъекта.Вставить("ПутьКДанным", Объект.ПутьКДанным);
	СтруктураОбъекта.Вставить("Роль"       , ЗначениеСКДВСтруктуру(Объект.Роль));
	СтруктураОбъекта.Вставить("ТипЗначения", ЗначениеВСтруктуру(Объект.ТипЗначения));
	 
	Возврат СтруктураОбъекта;
	
КонецФункции // ПолеНабораДанныхПолеСКДВСтруктуру()

// Процедура - заполняет объект СКД ПолеНабораДанныхСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПолеНабораДанныхСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                             - данные для заполнения объекта
//
Процедура ПолеНабораДанныхПолеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПолеНабораДанныхСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ВыражениеПредставления");
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "ВыраженияУпорядочивания");
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Заголовок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "НаборДанныхПроверкиИерархии");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ОграничениеИспользования", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ОграничениеИспользованияРеквизитов", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Оформление", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПараметрНабораДанныхПроверкиИерархии");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПараметрыРедактирования", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Поле");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПутьКДанным");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Роль", Истина);
	
	Если СтруктураОбъекта.Свойство("ТипЗначения") Тогда
		Объект.ТипЗначения = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипЗначения);
	КонецЕсли;
	
КонецПроцедуры // ПолеНабораДанныхПолеСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПапкаПолейНабораДанныхСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - ПапкаПолейНабораДанныхСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПолеНабораДанныхПапкаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПапкаПолейНабораДанныхСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Заголовок", Объект.Заголовок);
	
	СтруктураОбъекта.Вставить("ОграничениеИспользования",
	                          ЗначениеСКДВСтруктуру(Объект.ОграничениеИспользования));
	
	СтруктураОбъекта.Вставить("ПутьКДанным", Объект.ПутьКДанным);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПолеНабораДанныхПапкаСКДВСтруктуру()

// Процедура - заполняет объект СКД ПапкаПолейНабораДанныхСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПапкаПолейНабораДанныхСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                   - данные для заполнения объекта
//
Процедура ПолеНабораДанныхПапкаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Заголовок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ОграничениеИспользования", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПутьКДанным");
	
КонецПроцедуры // ПолеНабораДанныхПапкаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ВложенныйНаборДанныхСхемыКомпоновкиДанных
//
// Параметры:
//     Объект             - ВложенныйНаборДанныхСхемыКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПолеНабораДанныхВложенныйНаборСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ВложенныйНаборДанныхСхемыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ВложенныйНаборДанныхСхемыКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Заголовок"  , Объект.Заголовок);
	СтруктураОбъекта.Вставить("Поле"       , Объект.Поле);
	СтруктураОбъекта.Вставить("ПутьКДанным", Объект.ПутьКДанным);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПолеНабораДанныхВложенныйНаборСКДВСтруктуру()

// Процедура - заполняет объект СКД ВложенныйНаборДанныхСхемыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ВложенныйНаборДанныхСхемыКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                 - данные для заполнения объекта
//
Процедура ПолеНабораДанныхВложенныйНаборСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ВложенныйНаборДанныхСхемыКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Заголовок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Поле");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПутьКДанным");
	
КонецПроцедуры // ПолеНабораДанныхВложенныйНаборСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ВыбранныеПоляКомпоновкиДанных
//
// Параметры:
//     Объект             - ВыбранныеПоляКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ВыбранныеПоляСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ВыбранныеПоляКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ВыбранныеПоляКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	                          
	СтруктураОбъекта.Вставить("Элементы"    , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ВыбранныеПоляСКДВСтруктуру()

// Процедура - заполняет объект СКД ВыбранныеПоляКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ВыбранныеПоляКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                     - данные для заполнения объекта
//
Процедура ВыбранныеПоляСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ВыбранныеПоляКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы", Истина);
	
КонецПроцедуры // ВыбранныеПоляСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ГруппаВыбранныхПолейКомпоновкиДанных
//
// Параметры:
//     Объект             - ГруппаВыбранныхПолейКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ГруппаВыбранныхПолейСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ГруппаВыбранныхПолейКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Заголовок"       , Объект.Заголовок);
	СтруктураОбъекта.Вставить("Использование"   , Объект.Использование);
	СтруктураОбъекта.Вставить("Поле"            , ЗначениеСКДВСтруктуру(Объект.Поле));
	СтруктураОбъекта.Вставить("Расположение"    , ЗначениеВСтруктуру(Объект.Расположение));
	СтруктураОбъекта.Вставить("Элементы"        , КоллекцияСКДВМассив(Объект.Элементы));
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	// TODO: проверить родителя
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ГруппаВыбранныхПолейСКДВСтруктуру()

// Процедура - заполняет объект СКД ГруппаВыбранныхПолейКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ГруппаВыбранныхПолейКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                            - данные для заполнения объекта
//
Процедура ГруппаВыбранныхПолейСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Заголовок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	
	Если СтруктураОбъекта.Свойство("Поле") И ЗначениеЗаполнено(СтруктураОбъекта.Поле) Тогда
		Объект.Поле = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.Поле.Имя);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("Расположение") Тогда
		Объект.Расположение = ЗначениеИзСтруктуры(СтруктураОбъекта.Расположение);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	// TODO: проверить родителя
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы", Истина);
	
КонецПроцедуры // ГруппаВыбранныхПолейСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// АвтоВыбранноеПолеКомпоновкиДанных
//
// Параметры:
//     Объект             - АвтоВыбранноеПолеКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция АвтоВыбранноеПолеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "АвтоВыбранноеПолеКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Использование", Объект.Использование);
	// TODO: проверить родителя
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ВыбранноеПолеСКДВСтруктуру()

// Процедура - заполняет объект СКД АвтоВыбранноеПолеКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - АвтоВыбранноеПолеКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                         - данные для заполнения объекта
//
Процедура АвтоВыбранноеПолеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	// TODO: проверить родителя
	
КонецПроцедуры // АвтоВыбранноеПолеСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ВыбранноеПолеКомпоновкиДанных
//
// Параметры:
//     Объект             - ВыбранноеПолеКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ВыбранноеПолеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ВыбранноеПолеКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Заголовок"       , Объект.Заголовок);
	СтруктураОбъекта.Вставить("Использование"   , Объект.Использование);
	СтруктураОбъекта.Вставить("Поле"            , ЗначениеСКДВСтруктуру(Объект.Поле));
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	// TODO: проверить родителя
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ВыбранноеПолеСКДВСтруктуру()

// Процедура - заполняет объект СКД ВыбранноеПолеКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ВыбранноеПолеКомпоновкиДанных         - заполняемый объект
//     СтруктураОбъекта   - Структура                             - данные для заполнения объекта
//
Процедура ВыбранноеПолеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Заголовок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	
	Если СтруктураОбъекта.Свойство("Поле") Тогда
		Объект.Поле = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.Поле.Имя);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	// TODO: проверить родителя
	
КонецПроцедуры // ВыбранноеПолеСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// РольПоляНабораДанныхКомпоновкиДанных
//
// Параметры:
//     Объект             - РольПоляНабораДанныхКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция РольПоляНабораДанныхСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("РольПоляНабораДанныхКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "РольПоляНабораДанныхКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ВыражениеВидаСчета"      , Объект.ВыражениеВидаСчета);
	СтруктураОбъекта.Вставить("ГруппаОстатка"           , Объект.ГруппаОстатка);
	СтруктураОбъекта.Вставить("ИгнорироватьЗначенияNULL", Объект.ИгнорироватьЗначенияNULL);
	СтруктураОбъекта.Вставить("Измерение"               , Объект.Измерение);
	СтруктураОбъекта.Вставить("НомерПериода"            , Объект.НомерПериода);
	СтруктураОбъекта.Вставить("Обязательное"            , Объект.Обязательное);
	СтруктураОбъекта.Вставить("Остаток"                 , Объект.Остаток);
	СтруктураОбъекта.Вставить("ПолеСчета"               , Объект.ПолеСчета);
	СтруктураОбъекта.Вставить("РеквизитИзмерения"       , Объект.РеквизитИзмерения);
	СтруктураОбъекта.Вставить("РодительскоеИзмерение"   , Объект.РодительскоеИзмерение);
	СтруктураОбъекта.Вставить("Счет"                    , Объект.Счет);
	СтруктураОбъекта.Вставить("ТипБухгалтерскогоОстатка",
	                          ЗначениеВСтруктуру(Объект.ТипБухгалтерскогоОстатка));
	СтруктураОбъекта.Вставить("ТипОстатка"    , ЗначениеВСтруктуру(Объект.ТипОстатка));
	СтруктураОбъекта.Вставить("ТипПериода"    , ЗначениеВСтруктуру(Объект.ТипПериода));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // РольПоляНабораДанныхСКДВСтруктуру()

// Процедура - заполняет объект СКД РольПоляНабораДанныхКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - РольПоляНабораДанныхКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                            - данные для заполнения объекта
//
Процедура РольПоляНабораДанныхСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("РольПоляНабораДанныхКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ВыражениеВидаСчета");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ГруппаОстатка");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИгнорироватьЗначенияNULL");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Измерение");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "НомерПериода");
	// @skip-error - в СП свойство указано как "Только чтение", но на самом деле свойство записывается
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Обязательное");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Остаток");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПолеСчета");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "РеквизитИзмерения");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "РодительскоеИзмерение");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Счет");
	
	Если СтруктураОбъекта.Свойство("ТипБухгалтерскогоОстатка") Тогда
		Объект.ТипБухгалтерскогоОстатка = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипБухгалтерскогоОстатка);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ТипОстатка") Тогда
		Объект.ТипОстатка = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипОстатка);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ТипПериода") Тогда
		Объект.ТипПериода = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипПериода);
	КонецЕсли;
	
КонецПроцедуры // РольПоляНабораДанныхСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ГруппаЭлементовОтбораКомпоновкиДанных
//
// Параметры:
//     Объект             - ГруппаЭлементовОтбораКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ГруппаЭлементовОтбораСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ГруппаЭлементовОтбораКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("Использование"   , Объект.Использование);
	СтруктураОбъекта.Вставить("Представление"   , Объект.Представление);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	СтруктураОбъекта.Вставить("Применение",
	                          ЗначениеВСтруктуру(Объект.Применение));
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	// TODO: проверить родителя
	СтруктураОбъекта.Вставить("ТипГруппы",
	                          ЗначениеВСтруктуру(Объект.ТипГруппы));
	
	СтруктураОбъекта.Вставить("Элементы"    , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ГруппаЭлементовОтбораСКДВСтруктуру()

// Процедура - заполняет объект СКД ГруппаЭлементовОтбораКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ГруппаЭлементовОтбораКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                             - данные для заполнения объекта
//
Процедура ГруппаЭлементовОтбораСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Представление");
	
	Если СтруктураОбъекта.Свойство("Применение") Тогда
		Объект.Применение = ЗначениеИзСтруктуры(СтруктураОбъекта.Применение);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ТипГруппы") Тогда
		Объект.ТипГруппы = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипГруппы);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы", Истина);
	
КонецПроцедуры // ГруппаЭлементовОтбораСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ЭлементОтбораКомпоновкиДанных
//
// Параметры:
//     Объект             - ЭлементОтбораКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ЭлементОтбораСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ЭлементОтбораКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("Использование"   , Объект.Использование);
	СтруктураОбъекта.Вставить("ЛевоеЗначение"   , ЗначениеВСтруктуру(Объект.ЛевоеЗначение));
	СтруктураОбъекта.Вставить("ПравоеЗначение"  , ЗначениеВСтруктуру(Объект.ПравоеЗначение));
	СтруктураОбъекта.Вставить("ВидСравнения"    , ЗначениеВСтруктуру(Объект.ВидСравнения));
	СтруктураОбъекта.Вставить("Представление"   , Объект.Представление);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	СтруктураОбъекта.Вставить("Применение",
	                          ЗначениеВСтруктуру(Объект.Применение));
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	// TODO: проверить родителя
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ЭлементОтбораСКДВСтруктуру()

// Процедура - заполняет объект СКД ЭлементОтбораКомпоновкиДанных из структуры описания объекта
//
// Параметры:
//     Объект             - ЭлементОтбораКомпоновкиДанных   - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура ЭлементОтбораСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Представление");
	
	Если СтруктураОбъекта.Свойство("ЛевоеЗначение") Тогда
		Объект.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.ЛевоеЗначение.Имя);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ПравоеЗначение") Тогда
		Объект.ПравоеЗначение = ЗначениеИзСтруктуры(СтруктураОбъекта.ПравоеЗначение);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ВидСравнения") Тогда
		Объект.ВидСравнения = ЗначениеИзСтруктуры(СтруктураОбъекта.ВидСравнения);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("Применение") Тогда
		Объект.Применение = ЗначениеИзСтруктуры(СтруктураОбъекта.Применение);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
КонецПроцедуры // ЭлементОтбораСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ОтборКомпоновкиДанных
//
// Параметры:
//     Объект             - ОтборКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ОтборСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ОтборКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ОтборКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	
	СтруктураОбъекта.Вставить("Элементы"    , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ОтборСКДВСтруктуру()

// Процедура - заполняет объект СКД ОтборКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ОтборКомпоновкиДанных   - заполняемый объект
//     СтруктураОбъекта   - Структура               - данные для заполнения объекта
//
Процедура ОтборСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ОтборКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы", Истина);
	
КонецПроцедуры // ОтборСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД:
//           ЗначенияПараметровВыводаКомпоновкиДанных,
//           ЗначенияПараметровВыводаТаблицыКомпоновкиДанных,
//           ЗначенияПараметровВыводаДиаграммыКомпоновкиДанных
//
// Параметры:
//   Объект    - ЗначенияПараметровВыводаКомпоновкиДанных           - сериализуемый объект
//               ЗначенияПараметровВыводаТаблицыКомпоновкиДанных
//               ЗначенияПараметровВыводаДиаграммыКомпоновкиДанных
//
// Возвращаемое значение:
//   Структура          - структура описания объекта
//
Функция ЗначенияПараметровВыводаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если ТипЗнч(Объект) = Тип("ЗначенияПараметровВыводаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "ЗначенияПараметровВыводаКомпоновкиДанных");
	ИначеЕсли ТипЗнч(Объект) = Тип("ЗначенияПараметровВыводаТаблицыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "ЗначенияПараметровВыводаТаблицыКомпоновкиДанных");
	ИначеЕсли ТипЗнч(Объект) = Тип("ЗначенияПараметровВыводаДиаграммыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "ЗначенияПараметровВыводаДиаграммыКомпоновкиДанных");
	Иначе
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Элементы"    , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ЗначенияПараметровВыводаСКДВСтруктуру()

// Процедура - заполняет объект СКД:
//             ЗначенияПараметровВыводаКомпоновкиДанных,
//             ЗначенияПараметровВыводаТаблицыКомпоновкиДанных,
//             ЗначенияПараметровВыводаДиаграммыКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//   Объект    - ЗначенияПараметровВыводаКомпоновкиДанных           - заполняемый объект
//               ЗначенияПараметровВыводаТаблицыКомпоновкиДанных
//               ЗначенияПараметровВыводаДиаграммыКомпоновкиДанных
//   СтруктураОбъекта   - Структура                                - данные для заполнения объекта
//
Процедура ЗначенияПараметровВыводаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ (ТипЗнч(Объект) = Тип("ЗначенияПараметровВыводаКомпоновкиДанных")
	     ИЛИ ТипЗнч(Объект) = Тип("ЗначенияПараметровВыводаТаблицыКомпоновкиДанных")
	     ИЛИ ТипЗнч(Объект) = Тип("ЗначенияПараметровВыводаДиаграммыКомпоновкиДанных")) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПараметровОбъектаСКДИзСтруктуры(Объект, Объект, СтруктураОбъекта);
	
КонецПроцедуры // ЗначенияПараметровВыводаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ЗначенияПараметровДанныхКомпоновкиДанных
//
// Параметры:
//     Объект             - ЗначенияПараметровДанныхКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ЗначенияПараметровДанныхСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ЗначенияПараметровДанныхКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ЗначенияПараметровДанныхКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы"    , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ЗначенияПараметровДанныхСКДВСтруктуру()

// Процедура - заполняет объект СКД ЗначенияПараметровДанныхКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ЗначенияПараметровДанныхКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                - данные для заполнения объекта
//
Процедура ЗначенияПараметровДанныхСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ЗначенияПараметровДанныхКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПараметровОбъектаСКДИзСтруктуры(Объект, Объект, СтруктураОбъекта);
	
КонецПроцедуры // ЗначенияПараметровДанныхСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПользовательскоеПолеВыражениеКомпоновкиДанных
//
// Параметры:
//     Объект             - ПользовательскоеПолеВыражениеКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПользовательскоеПолеВыражениеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПользовательскоеПолеВыражениеКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Заголовок"    , Объект.Заголовок);
	СтруктураОбъекта.Вставить("Использование", Объект.Использование);
	СтруктураОбъекта.Вставить("ПутьКДанным"  , Объект.ПутьКДанным);
	
	СтруктураОбъекта.Вставить("ВыражениеДетальныхЗаписей", Объект.ПолучитьВыражениеДетальныхЗаписей());
	СтруктураОбъекта.Вставить("ВыражениеИтоговыхЗаписей" , Объект.ПолучитьВыражениеИтоговыхЗаписей());
	СтруктураОбъекта.Вставить("ПредставлениеВыраженияДетальныхЗаписей",
	                          Объект.ПолучитьПредставлениеВыраженияДетальныхЗаписей());
	СтруктураОбъекта.Вставить("ПредставлениеВыраженияИтоговыхЗаписей" ,
	                          Объект.ПолучитьПредставлениеВыраженияИтоговыхЗаписей());
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПользовательскоеПолеВыражениеСКДВСтруктуру()

// Процедура - заполняет объект СКД ПользовательскоеПолеВыражениеКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПользовательскоеПолеВыражениеКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                     - данные для заполнения объекта
//
Процедура ПользовательскоеПолеВыражениеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Заголовок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	
	ВыражениеДетальныхЗаписей = "";
	Если СтруктураОбъекта.Свойство("ВыражениеДетальныхЗаписей") Тогда
		ВыражениеДетальныхЗаписей = СтруктураОбъекта.ВыражениеДетальныхЗаписей;
	КонецЕсли;
	
	ВыражениеИтоговыхЗаписей = "";
	Если СтруктураОбъекта.Свойство("ВыражениеИтоговыхЗаписей") Тогда
		ВыражениеИтоговыхЗаписей = СтруктураОбъекта.ВыражениеИтоговыхЗаписей;
	КонецЕсли;
	
	Объект.УстановитьВыражения(ВыражениеДетальныхЗаписей, ВыражениеИтоговыхЗаписей);
	
	ПредставлениеВыраженияДетальныхЗаписей = "";
	Если СтруктураОбъекта.Свойство("ПредставлениеВыраженияДетальныхЗаписей") Тогда
		ПредставлениеВыраженияДетальныхЗаписей = СтруктураОбъекта.ПредставлениеВыраженияДетальныхЗаписей;
	КонецЕсли;
	
	ПредставлениеВыраженияИтоговыхЗаписей = "";
	Если СтруктураОбъекта.Свойство("ПредставлениеВыраженияИтоговыхЗаписей") Тогда
		ПредставлениеВыраженияИтоговыхЗаписей = СтруктураОбъекта.ПредставлениеВыраженияИтоговыхЗаписей;
	КонецЕсли;
	
	Объект.УстановитьПредставлениеВыражений(ПредставлениеВыраженияДетальныхЗаписей,
	                                        ПредставлениеВыраженияИтоговыхЗаписей);
	
КонецПроцедуры // ПользовательскоеПолеВыражениеСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПользовательскоеПолеВыборКомпоновкиДанных
//
// Параметры:
//     Объект             - ПользовательскоеПолеВыборКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПользовательскоеПолеВыборСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПользовательскоеПолеВыборКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Заголовок"    , Объект.Заголовок);
	СтруктураОбъекта.Вставить("Использование", Объект.Использование);
	СтруктураОбъекта.Вставить("ПутьКДанным"  , Объект.ПутьКДанным);
	
	СтруктураОбъекта.Вставить("Варианты"     , ЗначениеСКДВСтруктуру(Объект.Варианты));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПользовательскоеПолеВыборСКДВСтруктуру()

// Процедура - заполняет объект СКД ПользовательскоеПолеВыборКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПользовательскоеПолеВыборКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                 - данные для заполнения объекта
//
Процедура ПользовательскоеПолеВыборСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Заголовок");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Варианты", Истина);
	
КонецПроцедуры // ПользовательскоеПолеВыборСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПользовательскиеПоляКомпоновкиДанных
//
// Параметры:
//     Объект             - ПользовательскиеПоляКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПользовательскиеПоляСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПользовательскиеПоляКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПользовательскиеПоляКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы"    , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПользовательскиеПоляСКДВСтруктуру()

// Процедура - заполняет объект СКД ПользовательскиеПоляКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПользовательскиеПоляКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                            - данные для заполнения объекта
//
Процедура ПользовательскиеПоляСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПользовательскиеПоляКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы", Истина);
	
КонецПроцедуры // ПользовательскиеПоляСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// СвязиПараметровВыбораКомпоновкиДанных
//
// Параметры:
//     Объект             - СвязиПараметровВыбораКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция СвязиПараметровВыбораСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("СвязиПараметровВыбораКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "СвязиПараметровВыбораКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы", КоллекцияСКДВМассив(Объект));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // СвязиПараметровВыбораСКДВСтруктуру()

// Процедура - заполняет объект СКД СвязиПараметровВыбораКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - СвязиПараметровВыбораКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                             - данные для заполнения объекта
//
Процедура СвязиПараметровВыбораСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("СвязиПараметровВыбораКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияСКДИзМассива(Объект, СтруктураОбъекта.Элементы, Истина);
	
КонецПроцедуры // СвязиПараметровВыбораСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// СвязьПараметраВыбораКомпоновкиДанных
//
// Параметры:
//     Объект             - СвязьПараметраВыбораКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
// @skip-check bsl-legacy-check-dynamic-feature-access
Функция СвязьПараметраВыбораСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("СвязьПараметраВыбораКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "СвязьПараметраВыбораКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИзменениеЗначения", ЗначениеВСтруктуру(Объект.ИзменениеЗначения));
	СтруктураОбъекта.Вставить("Имя"              , Объект.Имя);
	СтруктураОбъекта.Вставить("Поле"             , ЗначениеСКДВСтруктуру(Объект.Поле));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // СвязьПараметраВыбораСКДВСтруктуру()

// Процедура - заполняет объект СКД СвязьПараметраВыбораКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - СвязьПараметраВыбораКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                            - данные для заполнения объекта
//
Процедура СвязьПараметраВыбораСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("СвязьПараметраВыбораКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ИзменениеЗначения") Тогда
		// @skip-warning - в СП написано, что поле имеет свойство "Только чтение",
		// но при добавлении связи поле содержит неопределено и присваивание допускается
		Объект.ИзменениеЗначения = ЗначениеИзСтруктуры(СтруктураОбъекта.ИзменениеЗначения);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Поле", Истина);
	
КонецПроцедуры // СвязьПараметраВыбораСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПараметрыВыбораЗначенияКомпоновкиДанных
//
// Параметры:
//     Объект             - ПараметрыВыбораКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПараметрыВыбораСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрыВыбораКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПараметрыВыбораКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы", КоллекцияСКДВМассив(Объект));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПараметрыВыбораСКДВСтруктуру()

// Процедура - заполняет объект СКД ПараметрыВыбораКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПараметрыВыбораКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура ПараметрыВыбораСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрыВыбораКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияСКДИзМассива(Объект, СтруктураОбъекта.Элементы, Истина);
	
КонецПроцедуры // ПараметрыВыбораСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПараметрВыбораКомпоновкиДанных
//
// Параметры:
//     Объект             - ПараметрВыбораКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПараметрВыбораСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрВыбораКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПараметрВыбораКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Имя"     , Объект.Имя);
	СтруктураОбъекта.Вставить("Значение", ЗначениеВСтруктуру(Объект.Значение));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПараметрВыбораСКДВСтруктуру()

// Процедура - заполняет объект СКД ПараметрВыбораКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПараметрВыбораКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                      - данные для заполнения объекта
//
Процедура ПараметрВыбораСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПараметрВыбораКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Значение", Истина);
	
КонецПроцедуры // ПараметрВыбораСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// СвязьПоТипуКомпоновкиДанных
//
// Параметры:
//     Объект             - СвязьПоТипуКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция СвязьПоТипуСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("СвязьПоТипуКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "СвязьПоТипуКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ЭлементСвязи", Объект.ЭлементСвязи);
	СтруктураОбъекта.Вставить("Поле"        , ЗначениеСКДВСтруктуру(Объект.Поле));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // СвязьПоТипуСКДВСтруктуру()

// Процедура - заполняет объект СКД СвязьПоТипуКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - СвязьПоТипуКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                   - данные для заполнения объекта
//
Процедура СвязьПоТипуСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("СвязьПоТипуКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ЭлементСвязи");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Поле", Истина);
	
КонецПроцедуры // СвязьПоТипуСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ВариантПользовательскогоПоляВыборКомпоновкиДанных
//
// Параметры:
//     Объект             - ВариантПользовательскогоПоляВыборКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ВариантПользовательскогоПоляВыбораСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ВариантПользовательскогоПоляВыборКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ВариантПользовательскогоПоляВыборКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Значение"     , ЗначениеВСтруктуру(Объект.Значение));
	СтруктураОбъекта.Вставить("Использование", Объект.Использование);
	СтруктураОбъекта.Вставить("Представление", Объект.Представление);
	СтруктураОбъекта.Вставить("Отбор"        , ЗначениеСКДВСтруктуру(Объект.Отбор));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ВариантПользовательскогоПоляВыбораСКДВСтруктуру()

// Процедура - заполняет объект СКД ВариантПользовательскогоПоляВыборКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ВариантПользовательскогоПоляВыборКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                         - данные для заполнения объекта
//
Процедура ВариантПользовательскогоПоляВыбораСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ВариантПользовательскогоПоляВыборКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	
	Если СтруктураОбъекта.Свойство("Значение") Тогда
		Объект.Значение = ЗначениеИзСтруктуры(СтруктураОбъекта.Значение);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Представление");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Отбор", Истина);
	
КонецПроцедуры // ВариантПользовательскогоПоляВыбораСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ВариантыПользовательскогоПоляВыборКомпоновкиДанных
//
// Параметры:
//     Объект             - ВариантыПользовательскогоПоляВыборКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ВариантыПользовательскогоПоляВыбораСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ВариантыПользовательскогоПоляВыборКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы"    , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ВариантыПользовательскогоПоляВыбораСКДВСтруктуру()

// Процедура - заполняет объект СКД ВариантыПользовательскогоПоляВыборКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ВариантыПользовательскогоПоляВыборКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                          - данные для заполнения объекта
//
Процедура ВариантыПользовательскогоПоляВыбораСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы");
	
КонецПроцедуры // ВариантыПользовательскогоПоляВыбораСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// АвтоЭлементПорядкаКомпоновкиДанных
//
// Параметры:
//     Объект             - АвтоЭлементПорядкаКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция АвтоЭлементПорядкаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("АвтоЭлементПорядкаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "АвтоЭлементПорядкаКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Использование"   , Объект.Использование);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // АвтоЭлементПорядкаСКДВСтруктуру()

// Процедура - заполняет объект СКД АвтоЭлементПорядкаКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - АвтоЭлементПорядкаКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                          - данные для заполнения объекта
//
Процедура АвтоЭлементПорядкаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("АвтоЭлементПорядкаКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	
КонецПроцедуры // АвтоЭлементПорядкаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ЭлементПорядкаКомпоновкиДанных
//
// Параметры:
//     Объект             - ЭлементПорядкаКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ЭлементПорядкаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ЭлементПорядкаКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Использование"   , Объект.Использование);
	СтруктураОбъекта.Вставить("Поле"            , ЗначениеСКДВСтруктуру(Объект.Поле));
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	СтруктураОбъекта.Вставить("ТипУпорядочивания",
	                          ЗначениеВСтруктуру(Объект.ТипУпорядочивания));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ЭлементПорядкаСКДВСтруктуру()

// Процедура - заполняет объекты СКД ЭлементПорядкаКомпоновкиДанных из структуры описания объекта
//
// Параметры:
//     Объект             - ЭлементПорядкаКомпоновкиДанных   - заполняемый объект
//     СтруктураОбъекта   - Структура                        - данные для заполнения объекта
//
Процедура ЭлементПорядкаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	
	Если СтруктураОбъекта.Свойство("Поле") Тогда
		Объект.Поле = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.Поле.Имя);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ТипУпорядочивания") Тогда
		Объект.ТипУпорядочивания =  ЗначениеИзСтруктуры(СтруктураОбъекта.ТипУпорядочивания);
	КонецЕсли;
	
КонецПроцедуры // ЭлементПорядкаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПорядокКомпоновкиДанных
//
// Параметры:
//     Объект             - ПорядокКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПорядокСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПорядокКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПорядокКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	
	СтруктураОбъекта.Вставить("Элементы"    , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПорядокСКДВСтруктуру()

// Процедура - заполняет объект СКД ПорядокКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПорядокКомпоновкиДанных   - заполняемый объект
//     СтруктураОбъекта   - Структура                 - данные для заполнения объекта
//
Процедура ПорядокСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПорядокКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы", Истина);
	
КонецПроцедуры // ПорядокСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// НастройкиВложенногоОбъектаКомпоновкиДанных
//
// Параметры:
//     Объект             - НастройкиВложенногоОбъектаКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция НастройкиВложенногоОбъектаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "НастройкиВложенногоОбъектаКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Идентификатор"       , Объект.Идентификатор);
	СтруктураОбъекта.Вставить("ИдентификаторОбъекта", Объект.ИдентификаторОбъекта);
	СтруктураОбъекта.Вставить("Имя"                 , Объект.Имя);
	СтруктураОбъекта.Вставить("Использование"       , Объект.Использование);
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	// TODO: проверить родителя
	СтруктураОбъекта.Вставить("Настройки", ЗначениеСКДВСтруктуру(Объект.Настройки));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // НастройкиВложенногоОбъектаСКДВСтруктуру()

// Процедура - заполняет объект СКД НастройкиВложенногоОбъектаКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - НастройкиВложенногоОбъектаКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                                  - данные для заполнения объекта
//
Процедура НастройкиВложенногоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	
	Если СтруктураОбъекта.Свойство("ИдентификаторОбъекта") Тогда
		Объект.УстановитьИдентификатор(СтруктураОбъекта.ИдентификаторОбъекта);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Настройки", Истина);
	
КонецПроцедуры // НастройкиВложенногоОбъектаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ГруппировкаКомпоновкиДанных
//
// Параметры:
//   Объект    - ГруппировкаКомпоновкиДанных            - заполняемый объект
//               ГруппировкаТаблицыКомпоновкиДанных
//               ГруппировкаДиаграммыКомпоновкиДанных
//
// Возвращаемое значение:
//   Структура    - структура описания объекта
//
Функция ГруппировкаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	ТипЗначения = ТипЗнч(Объект);
	
	Если ТипЗначения = Тип("ГруппировкаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "ГруппировкаКомпоновкиДанных");
	ИначеЕсли ТипЗначения = Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "ГруппировкаТаблицыКомпоновкиДанных");
	ИначеЕсли ТипЗначения = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "ГруппировкаДиаграммыКомпоновкиДанных");
	Иначе
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Идентификатор"   , Объект.Идентификатор);
	СтруктураОбъекта.Вставить("Имя"             , Объект.Имя);
	СтруктураОбъекта.Вставить("Использование"   , Объект.Использование);
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	
	СтруктураОбъекта.Вставить("Выбор"             , ЗначениеСКДВСтруктуру(Объект.Выбор));
	СтруктураОбъекта.Вставить("Отбор"             , ЗначениеСКДВСтруктуру(Объект.Отбор));
	СтруктураОбъекта.Вставить("ПараметрыВывода"   , ЗначениеСКДВСтруктуру(Объект.ПараметрыВывода));
	СтруктураОбъекта.Вставить("ПоляГруппировки"   , ЗначениеСКДВСтруктуру(Объект.ПоляГруппировки));
	СтруктураОбъекта.Вставить("Порядок"           , ЗначениеСКДВСтруктуру(Объект.Порядок));
	СтруктураОбъекта.Вставить("УсловноеОформление", ЗначениеСКДВСтруктуру(Объект.УсловноеОформление));
	СтруктураОбъекта.Вставить("РежимОтображения"  , ЗначениеВСтруктуру(Объект.РежимОтображения));
	
	// TODO: проверить родителя
	СтруктураОбъекта.Вставить("Состояние", ЗначениеВСтруктуру(Объект.Состояние));
	СтруктураОбъекта.Вставить("Структура", КоллекцияСКДВМассив(Объект.Структура));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ГруппировкаСКДВСтруктуру()

// Процедура - заполняет объект СКД ГруппировкаКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//   Объект    - ГруппировкаКомпоновкиДанных             - заполняемый объект
//               ГруппировкаТаблицыКомпоновкиДанных,
//               ГруппировкаДиаграммыКомпоновкиДанных
//
//   СтруктураОбъекта    - Структура    - данные для заполнения объекта
//
Процедура ГруппировкаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	ТипЗначения = ТипЗнч(Объект);
	
	Если НЕ (ТипЗначения = Тип("ГруппировкаКомпоновкиДанных")
	     ИЛИ ТипЗначения = Тип("ГруппировкаТаблицыКомпоновкиДанных")
	     ИЛИ ТипЗначения = Тип("ГруппировкаДиаграммыКомпоновкиДанных")) Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Выбор", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Отбор", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПараметрыВывода", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПоляГруппировки", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Порядок", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "УсловноеОформление", Истина);
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("Состояние") Тогда
		Объект.Состояние = ЗначениеИзСтруктуры(СтруктураОбъекта.Состояние);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Структура", Истина);
	
КонецПроцедуры // ГруппировкаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ТаблицаКомпоновкиДанных
//
// Параметры:
//     Объект             - ТаблицаКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ТаблицаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ТаблицаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ТаблицаКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Идентификатор"   , Объект.Идентификатор);
	СтруктураОбъекта.Вставить("Имя"             , Объект.Имя);
	СтруктураОбъекта.Вставить("Использование"   , Объект.Использование);
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	
	СтруктураОбъекта.Вставить("Выбор"             , ЗначениеСКДВСтруктуру(Объект.Выбор));
	СтруктураОбъекта.Вставить("ПараметрыВывода"   , ЗначениеСКДВСтруктуру(Объект.ПараметрыВывода));
	СтруктураОбъекта.Вставить("УсловноеОформление", ЗначениеСКДВСтруктуру(Объект.УсловноеОформление));
	СтруктураОбъекта.Вставить("РежимОтображения"  , ЗначениеВСтруктуру(Объект.РежимОтображения));
	// TODO: проверить родителя
	                          
	СтруктураОбъекта.Вставить("Колонки", КоллекцияСКДВМассив(Объект.Колонки));
	СтруктураОбъекта.Вставить("Строки" , КоллекцияСКДВМассив(Объект.Строки));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ТаблицаСКДВСтруктуру()

// Процедура - заполняет объект СКД ТаблицаКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ТаблицаКомпоновкиДанных   - заполняемый объект
//     СтруктураОбъекта   - Структура                 - данные для заполнения объекта
//
Процедура ТаблицаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ТаблицаКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Выбор", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПараметрыВывода", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "УсловноеОформление", Истина);
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Колонки");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Строки");
	
КонецПроцедуры // ТаблицаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ДиаграммаКомпоновкиДанных
//
// Параметры:
//     Объект             - ДиаграммаКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ДиаграммаСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ДиаграммаКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ДиаграммаКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Идентификатор"   , Объект.Идентификатор);
	СтруктураОбъекта.Вставить("Имя"             , Объект.Имя);
	СтруктураОбъекта.Вставить("Использование"   , Объект.Использование);
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	                          
	СтруктураОбъекта.Вставить("Выбор"             , ЗначениеСКДВСтруктуру(Объект.Выбор));
	СтруктураОбъекта.Вставить("ПараметрыВывода"   , ЗначениеСКДВСтруктуру(Объект.ПараметрыВывода));
	СтруктураОбъекта.Вставить("УсловноеОформление", ЗначениеСКДВСтруктуру(Объект.УсловноеОформление));
	СтруктураОбъекта.Вставить("РежимОтображения"  , ЗначениеВСтруктуру(Объект.РежимОтображения));
	
	// TODO: проверить родителя
	                          
	СтруктураОбъекта.Вставить("Серии" , КоллекцияСКДВМассив(Объект.Серии));
	СтруктураОбъекта.Вставить("Точки" , КоллекцияСКДВМассив(Объект.Точки));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ДиаграммаСКДВСтруктуру()

// Процедура - заполняет объект СКД ДиаграммаКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ДиаграммаКомпоновкиДанных   - заполняемый объект
//     СтруктураОбъекта   - Структура                   - данные для заполнения объекта
//
Процедура ДиаграммаСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ДиаграммаКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Имя");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Выбор", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПараметрыВывода", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "УсловноеОформление", Истина);
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Серии");
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Точки");
	
КонецПроцедуры // ДиаграммаСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// АвтоПолеГруппировкиКомпоновкиДанных
//
// Параметры:
//     Объект             - АвтоПолеГруппировкиКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция АвтоПолеГруппировкиСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("АвтоПолеГруппировкиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "АвтоПолеГруппировкиКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Использование", Объект.Использование);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // АвтоПолеГруппировкиСКДВСтруктуру()

// Процедура - заполняет объект СКД АвтоПолеГруппировкиКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - АвтоПолеГруппировкиКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                           - данные для заполнения объекта
//
Процедура АвтоПолеГруппировкиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("АвтоПолеГруппировкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	
КонецПроцедуры // АвтоПолеГруппировкиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПолеГруппировкиКомпоновкиДанных
//
// Параметры:
//     Объект             - ПолеГруппировкиКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПолеГруппировкиСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПолеГруппировкиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПолеГруппировкиКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Использование" , Объект.Использование);
	СтруктураОбъекта.Вставить("НачалоПериода" , ЗначениеВСтруктуру(Объект.НачалоПериода));
	СтруктураОбъекта.Вставить("КонецПериода"  , ЗначениеВСтруктуру(Объект.КонецПериода));
	СтруктураОбъекта.Вставить("Поле"          , ЗначениеВСтруктуру(Объект.Поле));
	СтруктураОбъекта.Вставить("ТипГруппировки", ЗначениеВСтруктуру(Объект.ТипГруппировки));
	СтруктураОбъекта.Вставить("ТипДополнения" , ЗначениеВСтруктуру(Объект.ТипДополнения));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПолеГруппировкиСКДВСтруктуру()

// Процедура - заполняет объекты СКД ПолеГруппировкиКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПолеГруппировкиКомпоновкиДанных   - заполняемый объект
//     СтруктураОбъекта   - Структура                         - данные для заполнения объекта
//
Процедура ПолеГруппировкиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПолеГруппировкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	
	Если СтруктураОбъекта.Свойство("НачалоПериода") И ЗначениеЗаполнено(СтруктураОбъекта.НачалоПериода) Тогда
		Если ТипЗнч(СтруктураОбъекта.НачалоПериода) = Тип("Структура") Тогда
			Если ЭтоСистемноеПеречисление(СтруктураОбъекта.НачалоПериода) Тогда
				Объект.НачалоПериода = ЗначениеСистемногоПеречисленияИзСтруктуры(СтруктураОбъекта.НачалоПериода);
			ИначеЕсли СтруктураОбъекта.НачалоПериода.__Тип = "ПолеКомпоновкиДанных" Тогда
				Объект.НачалоПериода = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.НачалоПериода.Имя);
			Иначе
				ПоказатьСообщение(СтрШаблон("Неизвестный тип поля ""НачалоПериода"": %1", СтруктураОбъекта.НачалоПериода.__Тип));
			КонецЕсли;
		ИначеЕсли ТипЗнч(СтруктураОбъекта.НачалоПериода) = Тип("Строка") Тогда
			Объект.НачалоПериода = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.НачалоПериода);
		ИначеЕсли ТипЗнч(СтруктураОбъекта.НачалоПериода) = Тип("Дата") Тогда
			Объект.НачалоПериода = СтруктураОбъекта.НачалоПериода;
		Иначе
			ПоказатьСообщение(СтрШаблон("Неизвестный тип поля ""НачалоПериода"": %1", СтруктураОбъекта.НачалоПериода));
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("КонецПериода") И ЗначениеЗаполнено(СтруктураОбъекта.КонецПериода) Тогда
		Если ТипЗнч(СтруктураОбъекта.КонецПериода) = Тип("Структура") Тогда
			Если ЭтоСистемноеПеречисление(СтруктураОбъекта.КонецПериода) Тогда
				Объект.КонецПериода = ЗначениеСистемногоПеречисленияИзСтруктуры(СтруктураОбъекта.КонецПериода);
			ИначеЕсли СтруктураОбъекта.КонецПериода.__Тип = "ПолеКомпоновкиДанных" Тогда
				Объект.КонецПериода = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.КонецПериода.Имя);
			Иначе
				ПоказатьСообщение(СтрШаблон("Неизвестный тип поля ""НачалоПериода"": %1", СтруктураОбъекта.НачалоПериода.__Тип));
			КонецЕсли;
		ИначеЕсли ТипЗнч(СтруктураОбъекта.КонецПериода) = Тип("Строка") Тогда
			Объект.КонецПериода = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.КонецПериода);
		ИначеЕсли ТипЗнч(СтруктураОбъекта.КонецПериода) = Тип("Дата") Тогда
			Объект.КонецПериода = СтруктураОбъекта.КонецПериода;
		Иначе
			ПоказатьСообщение(СтрШаблон("Неизвестный тип поля ""КонецПериода"": %1", СтруктураОбъекта.КонецПериода));
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("Поле") Тогда
		Объект.Поле = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.Поле.Имя);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ТипГруппировки") Тогда
		Объект.ТипГруппировки = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипГруппировки);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ТипДополнения") Тогда
		Объект.ТипДополнения = ЗначениеИзСтруктуры(СтруктураОбъекта.ТипДополнения);
	КонецЕсли;
	
КонецПроцедуры // ПолеГруппировкиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПоляГруппировкиКомпоновкиДанных
//
// Параметры:
//     Объект             - ПоляГруппировкиКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПоляГруппировкиСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПоляГруппировкиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПоляГруппировкиКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы" , КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПоляГруппировкиСКДВСтруктуру()

// Процедура - заполняет объект СКД ПоляГруппировкиКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ПоляГруппировкиКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура ПоляГруппировкиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПоляГруппировкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы", Истина);
	
КонецПроцедуры // ПоляГруппировкиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ЗначенияПараметровВыводаГруппировкиКомпоновкиДанных, ЗначенияПараметровВыводаГруппировкиТаблицыКомпоновкиДанных,
// ЗначенияПараметровВыводаГруппировкиДиаграммыКомпоновкиДанных
//
// Параметры:
//   Объект          - ЗначенияПараметровВыводаГруппировкиКомпоновкиДанных           - заполняемый объект
//                     ЗначенияПараметровВыводаГруппировкиТаблицыКомпоновкиДанных
//                     ЗначенияПараметровВыводаГруппировкиДиаграммыКомпоновкиДанных
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ЗначенияПараметровВыводаГруппировкиСКДВСтруктуру(Объект)
	
	ТипЗначения = ТипЗнч(Объект);
	
	СтруктураОбъекта = Новый Структура();
	
	Если ТипЗначения = Тип("ЗначенияПараметровВыводаГруппировкиКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "ЗначенияПараметровВыводаГруппировкиКомпоновкиДанных");
	ИначеЕсли ТипЗначения = Тип("ЗначенияПараметровВыводаГруппировкиТаблицыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "ЗначенияПараметровВыводаГруппировкиТаблицыКомпоновкиДанных");
	ИначеЕсли ТипЗначения = Тип("ЗначенияПараметровВыводаГруппировкиДиаграммыКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "ЗначенияПараметровВыводаГруппировкиДиаграммыКомпоновкиДанных");
	Иначе
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("Элементы", КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ЗначенияПараметровВыводаГруппировкиСКДВСтруктуру()

// Процедура - заполняет объекты СКД ЗначенияПараметровВыводаГруппировкиКомпоновкиДанных,
// ЗначенияПараметровВыводаГруппировкиТаблицыКомпоновкиДанных,
// ЗначенияПараметровВыводаГруппировкиДиаграммыКомпоновкиДанных из структуры описания объекта
//
// Параметры:
//   Объект            - ЗначенияПараметровВыводаГруппировкиКомпоновкиДанных           - заполняемый объект
//                       ЗначенияПараметровВыводаГруппировкиТаблицыКомпоновкиДанных
//                       ЗначенияПараметровВыводаГруппировкиДиаграммыКомпоновкиДанных
//   СтруктураОбъекта  - Структура                                                     - данные для заполнения объекта
//
Процедура ЗначенияПараметровВыводаГруппировкиСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	ТипЗначения = ТипЗнч(Объект);
	
	Если НЕ (ТипЗначения = Тип("ЗначенияПараметровВыводаГруппировкиКомпоновкиДанных")
	 ИЛИ ТипЗначения = Тип("ЗначенияПараметровВыводаГруппировкиТаблицыКомпоновкиДанных")
	 ИЛИ ТипЗначения = Тип("ЗначенияПараметровВыводаГруппировкиДиаграммыКомпоновкиДанных")) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПараметровОбъектаСКДИзСтруктуры(Объект, Объект, СтруктураОбъекта);
	
КонецПроцедуры // ЗначенияПараметровВыводаГруппировкиСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ЭлементУсловногоОформленияКомпоновкиДанных
//
// Параметры:
//     Объект             - ЭлементУсловногоОформленияКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ЭлементУсловногоОформленияСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ЭлементУсловногоОформленияКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ЭлементУсловногоОформленияКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Использование", Объект.Использование);
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	
	СтруктураОбъекта.Вставить("ИспользоватьВГруппировке",
	                          ЗначениеВСтруктуру(Объект.ИспользоватьВГруппировке));
	СтруктураОбъекта.Вставить("ИспользоватьВЗаголовке",
	                          ЗначениеВСтруктуру(Объект.ИспользоватьВЗаголовке));
	СтруктураОбъекта.Вставить("ИспользоватьВЗаголовкеПолей",
	                          ЗначениеВСтруктуру(Объект.ИспользоватьВЗаголовкеПолей));
	СтруктураОбъекта.Вставить("ИспользоватьВИерархическойГруппировке",
	                          ЗначениеВСтруктуру(Объект.ИспользоватьВИерархическойГруппировке));
	СтруктураОбъекта.Вставить("ИспользоватьВОбщемИтоге",
	                          ЗначениеВСтруктуру(Объект.ИспользоватьВОбщемИтоге));
	СтруктураОбъекта.Вставить("ИспользоватьВОтборе",
	                          ЗначениеВСтруктуру(Объект.ИспользоватьВОтборе));
	СтруктураОбъекта.Вставить("ИспользоватьВПараметрах",
	                          ЗначениеВСтруктуру(Объект.ИспользоватьВПараметрах));
	
	СтруктураОбъекта.Вставить("Отбор"     , ЗначениеСКДВСтруктуру(Объект.Отбор));
	СтруктураОбъекта.Вставить("Оформление", ЗначениеСКДВСтруктуру(Объект.Оформление));
	СтруктураОбъекта.Вставить("Поля"      , ЗначениеСКДВСтруктуру(Объект.Поля));
 
	СтруктураОбъекта.Вставить("Представление", Объект.Представление);
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ЭлементУсловногоОформленияСКДВСтруктуру()

// Процедура - заполняет объект СКД ЭлементУсловногоОформленияКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ЭлементУсловногоОформленияКомпоновкиДанных  - заполняемый объект
//     СтруктураОбъекта   - Структура                                   - данные для заполнения объекта
//
Процедура ЭлементУсловногоОформленияСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ЭлементУсловногоОформленияКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Представление");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Отбор", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Оформление", Истина);
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Поля", Истина);
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ИспользоватьВГруппировке") Тогда
		Объект.ИспользоватьВГруппировке = ЗначениеИзСтруктуры(СтруктураОбъекта.ИспользоватьВГруппировке);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ИспользоватьВЗаголовке") Тогда
		Объект.ИспользоватьВЗаголовке = ЗначениеИзСтруктуры(СтруктураОбъекта.ИспользоватьВЗаголовке);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ИспользоватьВЗаголовкеПолей") Тогда
		Объект.ИспользоватьВЗаголовкеПолей = ЗначениеИзСтруктуры(СтруктураОбъекта.ИспользоватьВЗаголовкеПолей);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ИспользоватьВИерархическойГруппировке") Тогда
		Объект.ИспользоватьВИерархическойГруппировке =
			ЗначениеИзСтруктуры(СтруктураОбъекта.ИспользоватьВИерархическойГруппировке);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ИспользоватьВОбщемИтоге") Тогда
		Объект.ИспользоватьВОбщемИтоге = ЗначениеИзСтруктуры(СтруктураОбъекта.ИспользоватьВОбщемИтоге);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ИспользоватьВОтборе") Тогда
		Объект.ИспользоватьВОтборе = ЗначениеИзСтруктуры(СтруктураОбъекта.ИспользоватьВОтборе);
	КонецЕсли;
	
	Если СтруктураОбъекта.Свойство("ИспользоватьВПараметрах") Тогда
		Объект.ИспользоватьВПараметрах = ЗначениеИзСтруктуры(СтруктураОбъекта.ИспользоватьВПараметрах);
	КонецЕсли;
	
КонецПроцедуры // ЭлементУсловногоОформленияСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// УсловноеОформлениеКомпоновкиДанных
//
// Параметры:
//     Объект             - УсловноеОформлениеКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция УсловноеОформлениеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("УсловноеОформлениеКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "УсловноеОформлениеКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("ИдентификаторПользовательскойНастройки",
	                          Объект.ИдентификаторПользовательскойНастройки);
	СтруктураОбъекта.Вставить("ПредставлениеПользовательскойНастройки",
	                          Объект.ПредставлениеПользовательскойНастройки);
	СтруктураОбъекта.Вставить("РежимОтображения",
	                          ЗначениеВСтруктуру(Объект.РежимОтображения));
	
	СтруктураОбъекта.Вставить("Элементы", КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // УсловноеОформлениеСКДВСтруктуру()

// Процедура - заполняет объект СКД УсловноеОформлениеКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - УсловноеОформлениеКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                          - данные для заполнения объекта
//
Процедура УсловноеОформлениеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("УсловноеОформлениеКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ИдентификаторПользовательскойНастройки");
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "ПредставлениеПользовательскойНастройки");
	
	Если СтруктураОбъекта.Свойство("РежимОтображения") Тогда
		Объект.РежимОтображения = ЗначениеИзСтруктуры(СтруктураОбъекта.РежимОтображения);
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы");
	
КонецПроцедуры // УсловноеОформлениеСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ОформляемоеПолеКомпоновкиДанных
//
// Параметры:
//     Объект             - ОформляемоеПолеКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ОформляемоеПолеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ОформляемоеПолеКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ОформляемоеПолеКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Использование", Объект.Использование);
	СтруктураОбъекта.Вставить("Поле"         , ЗначениеСКДВСтруктуру(Объект.Поле));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ОформляемоеПолеСКДВСтруктуру()

// Процедура - заполняет объект СКД ОформляемоеПолеКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ОформляемоеПолеКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура ОформляемоеПолеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ОформляемоеПолеКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, "Использование");
	
	Если СтруктураОбъекта.Свойство("Поле") Тогда
		Объект.Поле = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.Поле.Имя);
	КонецЕсли;
	
КонецПроцедуры // ОформляемоеПолеСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ОформляемыеПоляКомпоновкиДанных
//
// Параметры:
//     Объект             - ОформляемыеПоляКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ОформляемыеПоляСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ОформляемыеПоляКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ОформляемыеПоляКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Элементы", КоллекцияСКДВМассив(Объект.Элементы));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ОформляемыеПоляСКДВСтруктуру()

// Процедура - заполняет объект СКД ОформляемыеПоляКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ОформляемыеПоляКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура ОформляемыеПоляСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ОформляемыеПоляКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, "Элементы");
	
КонецПроцедуры // ОформляемыеПоляСКДИзСтруктуры()

// Функция - заполняет и возвращает структуру описания объекта СКД
// ПолеКомпоновкиДанных
//
// Параметры:
//     Объект             - ОформляемыеПоляКомпоновкиДанных     - заполняемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ПолеСКДВСтруктуру(Объект)
	
	СтруктураОбъекта = Новый Структура();
	
	Если НЕ ТипЗнч(Объект) = Тип("ПолеКомпоновкиДанных") Тогда
		СтруктураОбъекта.Вставить("__Тип", "Неопределено");
		Возврат СтруктураОбъекта;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить("__Тип", "ПолеКомпоновкиДанных");
	
	СтруктураОбъекта.Вставить("Имя", СокрЛП(Объект));
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ПолеСКДВСтруктуру()

// Процедура - заполняет объект СКД ПолеКомпоновкиДанных
// из структуры описания объекта
//
// Параметры:
//     Объект             - ОформляемыеПоляКомпоновкиДанных - заполняемый объект
//     СтруктураОбъекта   - Структура                       - данные для заполнения объекта
//
Процедура ПолеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если НЕ ТипЗнч(Объект) = Тип("ПолеКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Новый ПолеКомпоновкиДанных(СтруктураОбъекта.Имя);
	
КонецПроцедуры // ПолеСКДИзСтруктуры()

#КонецОбласти // ПреобразованияСКДПроцедурыПреобразованияОбъектов

#Область ПреобразованияСКДСлужебные

// Функция - заполняет и возвращает структуру описания объекта СКД
//
// Параметры:
//     Объект             - Произвольный     - преобразуемый объект
//
// Возвращаемое значение:
//     Структура          - структура описания объекта
//
Функция ЗначениеСКДВСтруктуру(Объект)
	
	Если Объект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Объект);
	
	// TODO: Обработка нештатной ситуации, когда в конфигурации отсутствует тип значения
	// видимо ошибка переноса отчета из другой конфигурации
	Если ПолучитьТипСтрокой(ТипЗначения) = "ПредопределенноеЗначениеКомпоновкиДанных" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПрефиксИмениМетодаПреобразования = ТипыЗначенийСКД().Получить(ТипЗначения);
	
	Если ПрефиксИмениМетодаПреобразования = Неопределено Тогда
		ПоказатьСообщение(СтрШаблон("Неизвестный тип %1 объекта СКД: %2", ТипЗначения, Объект));
		Возврат Неопределено;
	КонецЕсли;
	
	Если БезопасныйРежимПД() Тогда
		УстановитьБезопасныйРежим(Истина);
	КонецЕсли;
	
	Возврат Вычислить(СтрШаблон("%1ВСтруктуру(Объект)", ПрефиксИмениМетодаПреобразования));
	
КонецФункции // ЗначениеСКДВСтруктуру()

// Процедура - заполняет объект СКД из структуры описания объекта
//
// Параметры:
//     Объект             - Произвольный          - заполняемый объект СКД
//     СтруктураОбъекта   - Структура             - данные для заполнения объекта
//
Процедура ЗначениеСКДИзСтруктуры(Объект, СтруктураОбъекта)
	
	Если ЕстьТип(СтруктураОбъекта) Тогда
		ТипЗначения = Тип(СтруктураОбъекта.__Тип);
	Иначе
		ТипЗначения = ТипЗнч(Объект);
	КонецЕсли;
	
	ПрефиксИмениМетодаПреобразования = ТипыЗначенийСКД().Получить(ТипЗначения);
	
	Если ПрефиксИмениМетодаПреобразования = Неопределено Тогда
		ПоказатьСообщение(СтрШаблон("Неизвестный тип %1 объекта СКД: %2", ТипЗначения, Объект));
		Возврат;
	КонецЕсли;
	
	Если БезопасныйРежимПД() Тогда
		УстановитьБезопасныйРежим(Истина);
	КонецЕсли;
	
	Выполнить(СтрШаблон("%1ИзСтруктуры(Объект, СтруктураОбъекта)", ПрефиксИмениМетодаПреобразования));
	
КонецПроцедуры // ЗначениеСКДИзСтруктуры()
 
// Функция - заполняет массив элементами по данным коллекции СКД
//
// Параметры:
//     Коллекция    - Произвольный    - заполняемый объект
//
// Возвращаемое значение:
//     Массив из Структура     - массив элементов-описаний объектов
//
Функция КоллекцияСКДВМассив(Коллекция)
	
	МассивЭлементов = Новый Массив();
	Для Каждого ТекЭлемент Из Коллекция Цикл
		МассивЭлементов.Добавить(ЗначениеСКДВСтруктуру(ТекЭлемент));
	КонецЦикла;
	
	Возврат МассивЭлементов;
	
КонецФункции // КоллекцияСКДВМассив()

// Процедура - заполняет коллекцию СКД из массива описаний объектов
//
// Параметры:
//     Коллекция              - Произвольный         - заполняемая коллекция
//     МассивКоллекции        - Массив из Структура  - данные для заполнения коллекции
//     УстановитьТипЭлемента  - Булево               - Истина - при добавлении элемента в коллекцию,
//                                                     будет указан тип элемента
//
// @skip-check bsl-legacy-check-dynamic-feature-access
Процедура КоллекцияСКДИзМассива(Коллекция, МассивКоллекции, Знач УстановитьТипЭлемента = Ложь)
	
	Для Каждого ТекЭлемент Из МассивКоллекции Цикл
		УстановитьТипЭлемента = УстановитьТипЭлемента
		                      И НЕ (ТипЗнч(Коллекция) = Тип("КоллекцияЭлементовСтруктурыТаблицыКомпоновкиДанных")
		                        ИЛИ ТипЗнч(Коллекция) = Тип("КоллекцияЭлементовСтруктурыДиаграммыКомпоновкиДанных")
		                        ИЛИ ТипЗнч(Коллекция) = Тип("КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных"));
		
		Если УстановитьТипЭлемента Тогда
			НовыйЭлемент = Коллекция.Добавить(Тип(ТекЭлемент.__Тип));
		Иначе
			НовыйЭлемент = Коллекция.Добавить();
		КонецЕсли;
		ЗначениеСКДИзСтруктуры(НовыйЭлемент, ТекЭлемент);
	КонецЦикла;
	
КонецПроцедуры // КоллекцияСКДИзМассива()

// Процедура - заполняет указанный элемент объекта СКД из структуры описания объекта
//
// Параметры:
//     Объект                 - Произвольный        - заполняемый объект
//     СтруктураОбъекта       - Структура           - данные для заполнения объекта
//     Свойство               - Строка              - имя заполняемого свойства
//     ЗначениеСКД            - Булево              - Истина - значение будет приобразовано в объект СКД
//
Процедура СвойствоОбъектаСКДИзСтруктуры(Объект, СтруктураОбъекта, Свойство, ЗначениеСКД = Ложь)
	
	Если СтруктураОбъекта.Свойство(Свойство) Тогда
		Если ЗначениеСКД Тогда
			ЗначениеСКДИзСтруктуры(Объект[Свойство], СтруктураОбъекта[Свойство]);
		Иначе
			Объект[Свойство] = СтруктураОбъекта[Свойство];
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // СвойствоОбъектаСКДИзСтруктуры()

// Процедура - заполняет указанный элемент-коллекцию объекта СКД из структуры описания объекта
//
// Параметры:
//   Объект                 - Произвольный     - заполняемый объект
//   СтруктураОбъекта       - Структура        - данные для заполнения объекта
//   Свойство               - Строка           - имя заполняемого свойства-коллекции
//   УстановитьТипЭлемента  - Булево           - Истина - при добавлении элемента в коллекцию,
//                                               будет указан тип элемента
//
Процедура СвойствоОбъектаСКДИзМассива(Объект, СтруктураОбъекта, Свойство, УстановитьТипЭлемента = Ложь)
	
	Если СтруктураОбъекта.Свойство(Свойство) Тогда
		КоллекцияСКДИзМассива(Объект[Свойство], СтруктураОбъекта[Свойство], УстановитьТипЭлемента);
	КонецЕсли;
	
КонецПроцедуры // СвойствоОбъектаСКДИзМассива()

#КонецОбласти // ПреобразованияСКДСлужебные

#Область ПреобразованияОбъектовСлужебные

// Функция определяет тип значения, сохраненного в массив или структуру
// для преобразования в значение 1С
//
// Параметры:
//   СтруктураЗначения    - Структура                - Проверяемое значения
//                          Массив из Произвольный
//
// Возвращаемое значение:
//   Тип    - тип 1С
//
Функция СтруктураТипЗнч(СтруктураЗначения)
	
	Если ТипЗнч(СтруктураЗначения) = Тип("Массив") Тогда
		Если СтруктураЗначения.Количество() = 0 Тогда
			Возврат Тип("Массив");
		КонецЕсли;
		Если ТипЗнч(СтруктураЗначения[0]) = Тип("Структура") Тогда
			ЭтоСоответствие = (СтруктураЗначения[0].Свойство("Ключ")
				             И СтруктураЗначения[0].Свойство("Значение"));
			ЭтоСписок = (СтруктураЗначения[0].Свойство("Представление")
				       И СтруктураЗначения[0].Свойство("Значение")
				       И СтруктураЗначения[0].Свойство("Пометка"));
			Если ЭтоСоответствие Тогда
				Возврат Тип("Соответствие");
			ИначеЕсли ЭтоСписок Тогда
				Возврат Тип("СписокЗначений");
			Иначе
				Возврат Тип("ТаблицаЗначений");
			КонецЕсли;
		КонецЕсли;
		Возврат Тип("Массив");
	ИначеЕсли ТипЗнч(СтруктураЗначения) = Тип("Структура") Тогда
		Если ЕстьТип(СтруктураЗначения) Тогда
			Возврат Тип(СтруктураЗначения.__Тип);
		ИначеЕсли ЭтоОписаниеТипов(СтруктураЗначения) Тогда
			Если ТипЗнч(СтруктураЗначения.Типы) = Тип("Массив") Тогда
				Возврат Тип("ОписаниеТипов");
			КонецЕсли;
		ИначеЕсли СтруктураЗначения.Свойство("Строки") Тогда
			Если ТипЗнч(СтруктураЗначения.Строки) = Тип("Массив") Тогда
				Возврат Тип("ДеревоЗначений");
			КонецЕсли;
		КонецЕсли;
	
		Возврат Тип("Структура");
	Иначе
		Возврат ТипЗнч(СтруктураЗначения);
	КонецЕсли;
	
КонецФункции // СтруктураТипЗнч()

// Функция - возвращает тип объекта, указанный в описании объекта
//
// Параметры:
//   СтруктураОбъекта    - Структура    - структура описания объекта
//
// Возвращаемое значение:
//   Строка    - тип объекта, указанный в описании объекта
//
Функция ТипОбъектаВОписании(СтруктураОбъекта)
	
	ТипОбъекта = "NULL";
	Если ЕстьСсылка(СтруктураОбъекта) И СтруктураОбъекта.Ссылка.Свойство("Тип") Тогда 
		ТипОбъекта = СтруктураОбъекта.Ссылка.Тип;
	ИначеЕсли ЕстьСсылка(СтруктураОбъекта) И ЕстьТип(СтруктураОбъекта.Ссылка) Тогда 
		ТипОбъекта = СтруктураОбъекта.Ссылка.__Тип;
	ИначеЕсли ЕстьТип(СтруктураОбъекта) Тогда 
		ТипОбъекта = СтруктураОбъекта.__Тип;
	Иначе
		ТекстОшибки = "Структура не содержит указания типа значения
		              | или не является представлением ссылочного объекта. Поля %1 объекта:";
	
		Если ЕстьСсылка(СтруктураОбъекта) Тогда
			ВремСтруктура = СтруктураОбъекта.Ссылка;
			ТекстОшибки = СтрШаблон(ТекстОшибки, "ссылки");
		Иначе
			ВремСтруктура = СтруктураОбъекта;
			ТекстОшибки = СтрШаблон(ТекстОшибки, "структуры");
		КонецЕсли;
		ДополнитьТекстПолямиСтруктуры(ТекстОшибки, ВремСтруктура);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат ТипОбъекта;
	
КонецФункции // ТипОбъектаВОписании()

// Проверяет использование свойства (по имени) в соответствии со списками используемых и исключаемых свойств
//
// Параметры:
//  ИмяСвойства         - Строка                    - Имя проверяемого свойства
//  СписокСвойств       - Строка                    - список допустимых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                    - список исключаемых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Булево             - Истина - свойство используется; Ложь - свойство не используется
//
Функция ИспользоватьСвойство(Знач ИмяСвойства, Знач СписокСвойств = Неопределено, Знач ИсключаяСвойства = Неопределено)
	
	Если ТипЗнч(СписокСвойств) = Тип("Строка") Тогда
		СписокСвойств = СтрРазделить(СписокСвойств, ",", Ложь);
	КонецЕсли;
	Если НЕ ТипЗнч(СписокСвойств) = Тип("Массив") Тогда
		СписокСвойств = Новый Массив();
	КонецЕсли;
	
	Если ТипЗнч(ИсключаяСвойства) = Тип("Строка") Тогда
		ИсключаяСвойства = СтрРазделить(ИсключаяСвойства, ",", Ложь);
	КонецЕсли;
	Если НЕ ТипЗнч(ИсключаяСвойства) = Тип("Массив") Тогда
		ИсключаяСвойства = Новый Массив();
	КонецЕсли;
	
	Если СписокСвойств.Количество() = 0 И ИсключаяСвойства.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ ИсключаяСвойства.Найти(ИмяСвойства) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (НЕ СписокСвойств.Найти(ИмяСвойства) = Неопределено) ИЛИ СписокСвойств.Количество() = 0;
	
КонецФункции // ИспользоватьСвойство()

// Преобразует переданную дату в структуру если установлен флаг "РасширенноеПредставлениеДаты"
//
// Параметры:
//  Значение    - Дата    - Преобразуемое значение
//
// Возвращаемое значение:
//   Структура                           - результат преобразования
//     *__Тип            - Строка          - тип значения
//     *Значение         - Произвольный    - значение
//     *Представление    - Строка          - представление значения
//
Функция ДатаВСтруктуру(Значение)
	
	Если Не ТипЗнч(Значение) = Тип("Дата") Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип параметра ""Значение"" ""%1"", ожидается тип ""Дата"".",
		                        ТипЗнч(Значение));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если РасширенноеПредставлениеДаты() Тогда
		СтруктураЗначения = Новый Структура();
		СтруктураЗначения.Вставить("__Тип"        , "Дата");
		СтруктураЗначения.Вставить("Значение"     , Значение);
		СтруктураЗначения.Вставить("Представление", Формат(Значение, "dd.MM.yyyy HH:mm:ss"));
	Иначе
		СтруктураЗначения = Значение;
	КонецЕсли;
	
	Возврат СтруктураЗначения;
	
КонецФункции // ДатаВСтруктуру()

// Получает значение даты из переданного описания
//
// Параметры:
//  СтруктураЗначения      - Структура    - Описание значение
//
// Возвращаемое значение:
//   Дата     - результат преобразования
//
Функция ДатаИзСтруктуры(СтруктураЗначения)
	
	ТипЗначения = ТипЗнч(СтруктураЗначения);
	Если ТипЗначения = Тип("Дата") Тогда
		Возврат СтруктураЗначения;
	КонецЕсли;
	
	Если НЕ ТипЗнч(СтруктураЗначения) = Тип("Структура") Тогда
		ТекстОшибки = СтрШаблон("Некорректный тип параметра ""СтруктураЗначения"" ""%1"",
		                        |ожидается тип ""Дата"" или ""Структура"".",
		                        ТипЗнч(СтруктураЗначения));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НЕ ЕстьТип(СтруктураЗначения) Тогда
		ТекстОшибки = "Параметр ""СтруктураЗначения"" не содержит поля ""__Тип"". Поля: ";
		ДополнитьТекстПолямиСтруктуры(ТекстОшибки, СтруктураЗначения);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если НЕ СтруктураЗначения.__Тип = "Дата" Тогда
		ТекстОшибки = СтрШаблон("В параметре ""СтруктураЗначения"" передан некорректный тип для преобразования ""%1""
		                        |Ожидается тип ""Дата"".",
		                        СтруктураЗначения.__Тип);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат СтруктураЗначения.Значение;
	
КонецФункции // ДатаИзСтруктуры()

// Преобразует переданное значение для которого не предусмотрено функции преобразования в структуру
//
// Параметры:
//  Значение    - Произвольный    - Преобразуемое значение
//
// Возвращаемое значение:
//   Структура                           - результат преобразования
//     *__Тип            - Строка          - тип значения
//     *Значение         - Произвольный    - значение
//     *Представление    - Строка          - представление значения
//
Функция ЗначениеНеопределенногоТипаВСтруктуру(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	СтруктураЗначения = Новый Структура();
	СтруктураЗначения.Вставить("__Тип"        , ПолучитьТипСтрокой(ТипЗначения));
	СтруктураЗначения.Вставить("Значение"     , Значение);
	СтруктураЗначения.Вставить("Представление", СокрЛП(Значение));
	
	Возврат СтруктураЗначения;
	
КонецФункции // ЗначениеНеопределенногоТипаВСтруктуру()

// Получает значение системного перечисления из переданного описания
//
// Параметры:
//  СтруктураЗначения      - Структура    - Описание значение
//
// Возвращаемое значение:
//   Произвольный     - результат преобразования
//
Функция ЗначениеНеопределенногоТипаИзСтруктуры(СтруктураЗначения)
	
	Если СтруктураЗначения.Свойство("Значение") Тогда
		Возврат СтруктураЗначения.Значение;
	КонецЕсли;
	
	Возврат СтруктураЗначения;
	
КонецФункции // ЗначениеНеопределенногоТипаИзСтруктуры()

// Преобразует переданный элемент стиля (Картинка, Цвет, Шрифт, Рамка, Линия) в структуру
//
// Параметры:
//  Значение    - Картинка, Цвет, Шрифт, Рамка, Линия    - преобразуемый элемент стиля
//
// Возвращаемое значение:
//   Структура    - результат преобразования
//
Функция ЭлементСтиляВСтруктуру(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Картинка") Тогда
		Возврат КартинкаВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Цвет") Тогда
		Возврат ЦветВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Шрифт") Тогда
		Возврат ШрифтВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Рамка") Тогда
		Возврат РамкаВСтруктуру(Значение);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Линия") Тогда
		Возврат ЛинияВСтруктуру(Значение);
	КонецЕсли;
	
	Возврат ЗначениеНеопределенногоТипаВСтруктуру(Значение);
	
КонецФункции // ЭлементСтиляВСтруктуру()

// Получает элемент стиля (Картинка, Цвет, Шрифт, Рамка, Линия) из переданного описания
//
// Параметры:
//  СтруктураЗначения      - Структура      - описание элемета стиля
//
// Возвращаемое значение:
//   Картинка, Цвет, Шрифт, Рамка, Линия     - результат преобразования
//
Функция ЭлементСтиляИзСтруктуры(СтруктураЗначения)
	
	ТипЗначения = СтруктураТипЗнч(СтруктураЗначения);
	
	Если ТипЗначения = Тип("Картинка") Тогда
		Возврат КартинкаИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Цвет") Тогда
		Возврат ЦветИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Шрифт") Тогда
		Возврат ШрифтИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Рамка") Тогда
		Возврат РамкаИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Если ТипЗначения = Тип("Линия") Тогда
		Возврат ЛинияИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Возврат ЗначениеНеопределенногоТипаИзСтруктуры(СтруктураЗначения);
	
КонецФункции // ЭлементСтиляИзСтруктуры()

// Преобразует переданную картинку в структуру
//
// Параметры:
//  Значение    - Картинка    - преобразуемая картинка
//
// Возвращаемое значение:
//   Структура    - результат преобразования
//
Функция КартинкаВСтруктуру(Значение)
	
	Если НЕ ТипЗнч(Значение) = Тип("Картинка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураЗначения = Новый Структура();
	СтруктураЗначения.Вставить("__Тип", "Картинка");
	СтруктураЗначения.Вставить("Вид"    , ЗначениеВСтруктуру(Значение.Вид));
	
	Если Значение.Вид = ВидКартинки.ИзБиблиотеки Тогда
		ИмяКартинки = Картинки().Библиотека.Получить(Значение);
		СтруктураЗначения.Вставить("Имя", ИмяКартинки);
	ИначеЕсли Значение.Вид = ВидКартинки.Абсолютная Тогда
		СтруктураЗначения.Вставить("Данные",  Значение.ПолучитьДвоичныеДанные());
	КонецЕсли;
	
	Возврат СтруктураЗначения;
	
КонецФункции // КартинкаВСтруктуру()

// Получает картинку из переданного описания
//
// Параметры:
//  СтруктураЗначения    - Структура    - описание картинки
//
// Возвращаемое значение:
//   Картинка    - результат преобразования
//
Функция КартинкаИзСтруктуры(СтруктураЗначения)
	
	Если НЕ ВРег(СтруктураЗначения.__Тип) = "КАРТИНКА" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Вид = ЗначениеИзСтруктуры(СтруктураЗначения.Вид);
	
	Если СтруктураЗначения.Свойство("Имя") И ЗначениеЗаполнено(СтруктураЗначения.Имя) Тогда
		Значение = БиблиотекаКартинок[СтруктураЗначения.Имя];
	ИначеЕсли Вид = ВидКартинки.Абсолютная Тогда
		Значение = Новый Картинка(СтруктураЗначения.Данные);
	Иначе
		Значение = Новый Картинка();
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // КартинкаИзСтруктуры()

// Преобразует переданный цвет в структуру
//
// Параметры:
//  Значение    - Цвет    - преобразуемый цвет
//
// Возвращаемое значение:
//   Структура    - результат преобразования
//
Функция ЦветВСтруктуру(Значение)
	
	Если НЕ ТипЗнч(Значение) = Тип("Цвет") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураЗначения = Новый Структура();
	СтруктураЗначения.Вставить("__Тип", "Цвет");
	СтруктураЗначения.Вставить("Вид"  , ЗначениеВСтруктуру(Значение.Вид));
	
	Если Значение.Вид = ВидЦвета.WebЦвет Тогда
		ИмяЦвета = Цвета().WebЦвета.Получить(Значение);
	ИначеЕсли Значение.Вид = ВидЦвета.WindowsЦвет Тогда
		ИмяЦвета = Цвета().WindowsЦвета.Получить(Значение);
	ИначеЕсли Значение.Вид = ВидЦвета.ЭлементСтиля Тогда
		ИмяЦвета = Цвета().ЭлементыСтиля.Получить(Значение);
	Иначе
		ИмяЦвета = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяЦвета) Тогда
		СтруктураЗначения.Вставить("Имя", ИмяЦвета);
	Иначе
		Абсолютный = Значение.ПолучитьАбсолютный();
		СтруктураЗначения.Вставить("Зеленый", Абсолютный.Зеленый);
		СтруктураЗначения.Вставить("Красный", Абсолютный.Красный);
		СтруктураЗначения.Вставить("Синий"  , Абсолютный.Синий);
	КонецЕсли;
	
	Возврат СтруктураЗначения;
	
КонецФункции // ЦветВСтруктуру()

// Получает цвет из переданного описания
//
// Параметры:
//  СтруктураЗначения    - Структура    - описание цвета
//
// Возвращаемое значение:
//   Цвет    - результат преобразования
//
Функция ЦветИзСтруктуры(СтруктураЗначения)
	
	Если НЕ ВРег(СтруктураЗначения.__Тип) = "ЦВЕТ" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Вид = ЗначениеИзСтруктуры(СтруктураЗначения.Вид);
	
	Если СтруктураЗначения.Свойство("Имя") И ЗначениеЗаполнено(СтруктураЗначения.Имя) Тогда
		Если Вид = ВидЦвета.WebЦвет Тогда
			Значение = WebЦвета[СтруктураЗначения.Имя];
		ИначеЕсли Вид = ВидЦвета.WindowsЦвет Тогда
			Значение = WindowsЦвета[СтруктураЗначения.Имя];
		ИначеЕсли Вид = ВидЦвета.ЭлементСтиля Тогда
			Значение = ЦветаСтиля[СтруктураЗначения.Имя];
		КонецЕсли;
	Иначе
		//@skip-check new-color
		Значение = Новый Цвет(СтруктураЗначения.Красный,
		                      СтруктураЗначения.Зеленый,
		                      СтруктураЗначения.Синий);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // ЦветИзСтруктуры()

// Преобразует переданный шрифт в структуру
//
// Параметры:
//  Значение    - Шрифт    - преобразуемый шрифт
//
// Возвращаемое значение:
//   Структура    - результат преобразования
//
Функция ШрифтВСтруктуру(Значение)
	
	Если НЕ ТипЗнч(Значение) = Тип("Шрифт") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураЗначения = Новый Структура();
	СтруктураЗначения.Вставить("__Тип", "Шрифт");
	СтруктураЗначения.Вставить("Вид"  , ЗначениеВСтруктуру(Значение.Вид));
	
	Если Значение.Вид = ВидШрифта.WindowsШрифт Тогда
		ИмяШрифта = Шрифты().WindowsШрифты.Получить(Значение);
	ИначеЕсли Значение.Вид = ВидШрифта.ЭлементСтиля Тогда
		ИмяШрифта = Шрифты().ЭлементыСтиля.Получить(Значение);
	Иначе
		ИмяШрифта = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяШрифта) Тогда
		СтруктураЗначения.Вставить("Имя", ИмяШрифта);
	Иначе
		Абсолютный = Значение.ПолучитьАбсолютный();
		СтруктураЗначения.Вставить("Шрифт"        , Абсолютный.Имя);
		СтруктураЗначения.Вставить("Размер"       , Абсолютный.Размер);
		СтруктураЗначения.Вставить("Полужирный"   , Абсолютный.Полужирный);
		СтруктураЗначения.Вставить("Наклонный"    , Абсолютный.Наклонный);
		СтруктураЗначения.Вставить("Подчеркивание", Абсолютный.Подчеркивание);
		СтруктураЗначения.Вставить("Зачеркивание" , Абсолютный.Зачеркивание);
		СтруктураЗначения.Вставить("Масштаб"      , Абсолютный.Масштаб);
	КонецЕсли;
	
	Возврат СтруктураЗначения;
	
КонецФункции // ШрифтВСтруктуру()

// Получает шрифт из переданного описания
//
// Параметры:
//  СтруктураЗначения    - Структура    - описание шрифта
//
// Возвращаемое значение:
//   Шрифт    - результат преобразования
//
Функция ШрифтИзСтруктуры(СтруктураЗначения)
	
	Если НЕ ВРег(СтруктураЗначения.__Тип) = "ШРИФТ" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Вид = ЗначениеИзСтруктуры(СтруктураЗначения.Вид);
	
	Если СтруктураЗначения.Свойство("Имя") И ЗначениеЗаполнено(СтруктураЗначения.Имя) Тогда
		Если Вид = ВидШрифта.WindowsШрифт Тогда
			Значение = WindowsШрифты[СтруктураЗначения.Имя];
		ИначеЕсли Вид = ВидШрифта.ЭлементСтиля Тогда
			Значение = ШрифтыСтиля[СтруктураЗначения.Имя];
		КонецЕсли;
	Иначе
		//@skip-check new-font
		Значение = Новый Шрифт(СтруктураЗначения.Шрифт,
		                       СтруктураЗначения.Размер,
		                       СтруктураЗначения.Полужирный,
		                       СтруктураЗначения.Наклонный,
		                       СтруктураЗначения.Подчеркивание,
		                       СтруктураЗначения.Зачеркивание,
		                       СтруктураЗначения.Масштаб);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // ШрифтИзСтруктуры()

// Преобразует переданную рамку в структуру
//
// Параметры:
//  Значение    - Рамка    - преобразуемая рамка
//
// Возвращаемое значение:
//   Структура    - результат преобразования
//
Функция РамкаВСтруктуру(Значение)
	
	Если НЕ ТипЗнч(Значение) = Тип("Рамка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураЗначения = Новый Структура();
	СтруктураЗначения.Вставить("__Тип", "Рамка");
	СтруктураЗначения.Вставить("Вид"  , ЗначениеВСтруктуру(Значение.Вид));
	
	Если Значение.Вид = ВидРамки.ЭлементСтиля Тогда
		ИмяРамки = Рамки().ЭлементыСтиля.Получить(Значение);
	Иначе
		ИмяРамки = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяРамки) Тогда
		СтруктураЗначения.Вставить("Имя", ИмяРамки);
	Иначе
		СтруктураЗначения.Вставить("ТипРамки", ЗначениеВСтруктуру(Значение.ТипРамки));
		СтруктураЗначения.Вставить("Толщина" , Значение.Толщина);
	КонецЕсли;
	
	Возврат СтруктураЗначения;
	
КонецФункции // РамкаВСтруктуру()

// Получает рамку из переданного описания
//
// Параметры:
//  СтруктураЗначения    - Структура    - описание рамки
//
// Возвращаемое значение:
//   Рамка    - результат преобразования
//
Функция РамкаИзСтруктуры(СтруктураЗначения)
	
	Если НЕ ВРег(СтруктураЗначения.__Тип) = "РАМКА" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Вид = ЗначениеИзСтруктуры(СтруктураЗначения.Вид);
	
	Если СтруктураЗначения.Свойство("Имя") И ЗначениеЗаполнено(СтруктураЗначения.Имя) Тогда
		Если Вид = ВидРамки.ЭлементСтиля Тогда
			Значение = РамкиСтиля[СтруктураЗначения.Имя];
		КонецЕсли;
	Иначе
		Значение = Новый Рамка(ЗначениеИзСтруктуры(СтруктураЗначения.ТипРамки),
		                       СтруктураЗначения.Толщина);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // РамкаИзСтруктуры()

// Преобразует переданную линию в структуру
//
// Параметры:
//  Значение    - Линия    - преобразуемая линия
//
// Возвращаемое значение:
//   Структура    - результат преобразования
//
Функция ЛинияВСтруктуру(Значение)
	
	Если НЕ ТипЗнч(Значение) = Тип("Линия") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураЗначения = Новый Структура();
	СтруктураЗначения.Вставить("__Тип"   , "Линия");
	СтруктураЗначения.Вставить("Отступ"  , Значение.Отступ);
	СтруктураЗначения.Вставить("ТипЛинии", ЗначениеВСтруктуру(Значение.ТипЛинии));
	СтруктураЗначения.Вставить("Толщина" , Значение.Толщина);
	
	Возврат СтруктураЗначения;
	
КонецФункции // ЛинияВСтруктуру()

// Получает линию из переданного описания
//
// Параметры:
//  СтруктураЗначения    - Структура    - описание линии
//
// Возвращаемое значение:
//   Линия    - результат преобразования
//
Функция ЛинияИзСтруктуры(СтруктураЗначения)
	
	Если НЕ ВРег(СтруктураЗначения.__Тип) = "ЛИНИЯ" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипЛинии = ЗначениеИзСтруктуры(СтруктураЗначения.ТипЛинии);
	
	Если ТипЛинии = Тип("ТипЛинииЯчейкиТабличногоДокумента") Тогда
		Значение = Новый Линия(ТипЛинии, СтруктураЗначения.Толщина, СтруктураЗначения.Отступ);
	Иначе
		Значение = Новый Линия(ТипЛинии, СтруктураЗначения.Толщина);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // ЛинияИзСтруктуры()

// Преобразует переданное значение системного перечисления в структуру
//
// Параметры:
//  Значение    - Произвольный    - преобразуемое значение системного перечисления
//
// Возвращаемое значение:
//   Структура    - результат преобразования
//
Функция ЗначениеСистемногоПеречисленияВСтруктуру(Значение)
	
	ТипЗначения = ТипЗнч(Значение);
	
	ЗначенияПеречисления = СистемныеПеречисления().Получить(ТипЗначения);
	
	Если ЗначенияПеречисления = Неопределено Тогда
		Возврат ЗначениеНеопределенногоТипаВСтруктуру(Значение);
	КонецЕсли;
	
	СтруктураЗначения = Новый Структура();
	СтруктураЗначения.Вставить("__Тип", ПолучитьТипСтрокой(ТипЗначения));
	СтруктураЗначения.Вставить("Значение", ЗначенияПеречисления.Получить(Значение));
	
	Возврат СтруктураЗначения;
	
КонецФункции // ЗначениеСистемногоПеречисленияВСтруктуру()

// Получает системное перечисление из переданного описания
//
// Параметры:
//  СтруктураЗначения    - Структура    - описание системного перечисления
//
// Возвращаемое значение:
//   Произвольный    - результат преобразования (системное перечисление)
//
Функция ЗначениеСистемногоПеречисленияИзСтруктуры(СтруктураЗначения)
	
	ТипЗначения = Тип(СтруктураЗначения.__Тип);
	ЗначенияПеречисления = СистемныеПеречисления().Получить(ТипЗначения);
	Если ЗначенияПеречисления = Неопределено Тогда
		Возврат ЗначениеНеопределенногоТипаИзСтруктуры(СтруктураЗначения);
	КонецЕсли;
	
	Возврат Вычислить(СтрШаблон("%1.%2", СтруктураЗначения.__Тип, СтруктураЗначения.Значение));
	
КонецФункции // ЗначениеСистемногоПеречисленияИзСтруктуры()

// Функция, возвращает признак использования реквизита иерархического объекта
//
// Параметры:
//     Объект         - СправочникОбъект, СправочникСсылка                         - проверяемый объект 
//                      ПланВидовХарактеристикОбъект, ПланВидовХарактеристикСсылка
//     МетаСвойство   - ОбъектМетаданныхРеквизит                                   - проверяемый реквизит
//     МетаОбъект     - ОбъектМетаданных                                           - метаданные проверяемого объекта
//
// Возвращаемое значение:
//     Булево         - Истина - реквизит используется для объекта,
//                      Ложь - в противном случае
//
Функция СвойствоИерархическогоОбъектаИспользуется(Объект, МетаСвойство, МетаОбъект = Неопределено)
	
	Если МетаОбъект = Неопределено Тогда
		МетаОбъект = Объект.Метаданные();
	КонецЕсли;
	
	Если НЕ МетаОбъект.Иерархический Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрНачинаетсяС(МетаОбъект.ПолноеИмя(), "Справочник.")
	   И МетаОбъект.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов
	 ИЛИ СтрНачинаетсяС(МетаОбъект.ПолноеИмя(), "ПланВидовХарактеристик.") Тогда
		
		СвойствоИспользуется = 
			(Объект.ЭтоГруппа
				 И МетаСвойство.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента)
			ИЛИ (НЕ Объект.ЭтоГруппа
				 И МетаСвойство.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы);
				
		Если СвойствоИспользуется Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // СвойствоИерархическогоОбъектаИспользуется()

// Проверяет использование свойства объекта и добавляет в структуру
//
// Параметры:
//  СтруктураОбъекта    - Структура                   - заполняемая структура объекта
//  Объект              - Произвольный                - преобразуемый объект
//  ИмяСвойства         - Строка                      - имя добавляемого свойства
//  СписокСвойств       - Строка                      - список допустимых свойств
//                        Массив из Строка              (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                      - список исключаемых свойств
//                        Массив из Строка              (если пустой, то допустимы все свойства)
//
Процедура СвойствоОбъектаВСтруктуру(СтруктураОбъекта,
                                    Объект,
                                    ИмяСвойства,
                                    СписокСвойств = Неопределено,
                                    ИсключаяСвойства = Неопределено)
	
	Если НЕ ИспользоватьСвойство(ИмяСвойства, СписокСвойств, ИсключаяСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОбъекта.Вставить(ИмяСвойства, ЗначениеВСтруктуру(Объект[ИмяСвойства]));
	
КонецПроцедуры // СвойствоОбъектаВСтруктуру()

// Проверяет использование свойства объекта и заполняет значение свойства из структуры
//
// Параметры:
//  Объект              - Произвольный              - Заполняемый объект
//  СтруктураОбъекта    - Структура                 - Структура объекта
//  ИмяСвойства         - Строка                    - Имя проверяемого свойства
//  СписокСвойств       - Строка                    - список допустимых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                    - список исключаемых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//
Процедура СвойствоОбъектаИзСтруктуры(Объект,
                                     СтруктураОбъекта,
                                     ИмяСвойства,
                                     СписокСвойств = Неопределено,
                                     ИсключаяСвойства = Неопределено)
	
	Если НЕ СтруктураОбъекта.Свойство(ИмяСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ИспользоватьСвойство(ИмяСвойства, СписокСвойств, ИсключаяСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Объект[ИмяСвойства] = ЗначениеИзСтруктуры(СтруктураОбъекта[ИмяСвойства]);
	Исключение
		ТекстОшибки = СтрШаблон("Ошибка получения значения свойства ""%1"" объекта ""%2"":%3%4",
		                        ИмяСвойства,
		                        СокрЛП(Объект),
		                        Символы.ПС,
		                        ТекстОшибки);
		ЗаписьЖурналаРегистрации("Преобразование данных.Значение свойства",
		                         УровеньЖурналаРегистрации.Предупреждение,
		                         Объект.Ссылка,
		                         Объект.Метаданные(),
		                         ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры // СвойствоОбъектаИзСтруктуры()

// Добавляет данные табличной части объекта в структуру
//
// Параметры:
//  СтруктураОбъекта   - Структура                 - заполняемая структура объекта
//  Объект             - Произвольный              - преобразуемый объект
//  ИмяТЧ              - Строка                    - имя преобразуемой табличной части
//  СписокСвойств       - Строка                   - список допустимых свойств
//                        Массив из Строка           (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                   - список исключаемых свойств
//                        Массив из Строка           (если пустой, то допустимы все свойства)
//
Процедура ТЧОбъектаВСтруктуру(СтруктураОбъекта,
                              Объект,
                              ИмяТЧ,
                              СписокСвойств = Неопределено,
                              ИсключаяСвойства = Неопределено)
	
	Если НЕ ИспользоватьСвойство(ИмяТЧ, СписокСвойств, ИсключаяСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	МетаОбъект = Объект.Метаданные();
	
	МетаТЧ = МетаОбъект.ТабличныеЧасти.Найти(ИмяТЧ);
	
	Если МетаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = Новый Массив();
	Для Каждого ТекРеквизит Из МетаТЧ.Реквизиты Цикл
		ПутьКДанным = СтрШаблон("%1.%2", ИмяТЧ, ТекРеквизит.Имя);
		Если НЕ ИспользоватьСвойство(ПутьКДанным, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		Реквизиты.Добавить(ТекРеквизит.Имя);
	КонецЦикла;
	
	МассивСтрок = Новый Массив();
	Для Каждого ТекСтрока Из Объект[ИмяТЧ] Цикл
		
		СтруктураСтроки = СтрокаЗначенийВСтруктуру(ТекСтрока, Реквизиты);
		СтруктураСтроки.Вставить("НомерСтроки", ТекСтрока.НомерСтроки);
		
		МассивСтрок.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	ОписаниеВидаОбъекта = ОписаниеВидаОбъектов(МетаОбъект);
	
	ОписаниеТЧ = Новый Структура();
	ОписаниеТЧ.Вставить("__Тип" , СтрШаблон("%1ТабличнаяЧасть.%2.%3",
	                                        ОписаниеВидаОбъекта.Имя,
	                                        МетаОбъект.Имя,
	                                        ИмяТЧ));
	ОписаниеТЧ.Вставить("Строки", МассивСтрок);
	
	СтруктураОбъекта.Вставить(ИмяТЧ, ОписаниеТЧ);
	
КонецПроцедуры // ТЧОбъектаВСтруктуру()

// Заполняет табличную часть объекта из структуры
//
// Параметры:
//  Объект                - Произвольный              - заполняемый объект
//  СтруктураОбъекта      - Структура                 - структура данных объекта
//  ИмяТЧ                 - Строка                    - имя преобразуемой табличной части
//  СписокСвойств       - Строка                      - список допустимых свойств
//                        Массив из Строка              (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                      - список исключаемых свойств
//                        Массив из Строка              (если пустой, то допустимы все свойства)
//
Процедура ТЧОбъектаИзСтруктуры(Объект,
                               СтруктураОбъекта,
                               ИмяТЧ,
                               СписокСвойств = Неопределено,
                               ИсключаяСвойства = Неопределено)
	
	Если СтруктураОбъекта.Свойство("__ТЧ") Тогда
		ТЧОбъектаИзСтруктуры_Стар(Объект,
		                          СтруктураОбъекта,
		                          ИмяТЧ,
		                          СписокСвойств = Неопределено,
		                          ИсключаяСвойства = Неопределено);
		Возврат;
	КонецЕсли;
	
	Если НЕ СтруктураОбъекта.Свойство(ИмяТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ИспользоватьСвойство(ИмяТЧ, СписокСвойств, ИсключаяСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	МетаОбъект = Объект.Метаданные();
	
	МетаТЧ = МетаОбъект.ТабличныеЧасти.Найти(ИмяТЧ);
	
	Если МетаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = Новый Массив();
	Для Каждого ТекРеквизит Из МетаТЧ.Реквизиты Цикл
		ПутьКДанным = СтрШаблон("%1.%2", ИмяТЧ, ТекРеквизит.Имя);
		Если НЕ ИспользоватьСвойство(ПутьКДанным, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		Реквизиты.Добавить(ТекРеквизит.Имя);
	КонецЦикла;
	
	Объект[ИмяТЧ].Очистить();
	
	МассивСтрок = СтруктураОбъекта[ИмяТЧ].Строки;
	
	Для й = 0 По МассивСтрок.ВГраница() Цикл
		
		ТекСтрока   = МассивСтрок[й];
		НоваяСтрока = Объект[ИмяТЧ].Добавить();
		
		Попытка
			СтрокаЗначенийИзСтруктуры(НоваяСтрока, ТекСтрока, Реквизиты);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон("Ошибка заполнения табличной части ""%1"", в строке %2:%3%4",
		                                 ИмяТЧ,
		                                 й,
		                                 Символы.ПС,
		                                 ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // ТЧОбъектаИзСтруктуры()

// Заполняет табличную часть объекта из структуры
//
// Параметры:
//  Объект                - Произвольный              - заполняемый объект
//  СтруктураОбъекта      - Структура                 - структура данных объекта
//  ИмяТЧ                 - Строка                    - имя преобразуемой табличной части
//  СписокСвойств       - Строка                      - список допустимых свойств
//                        Массив из Строка              (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                      - список исключаемых свойств
//                        Массив из Строка              (если пустой, то допустимы все свойства)
//
Процедура ТЧОбъектаИзСтруктуры_Стар(Объект,
                                    СтруктураОбъекта,
                                    ИмяТЧ,
                                    СписокСвойств = Неопределено,
                                    ИсключаяСвойства = Неопределено)
	
	Если НЕ СтруктураОбъекта.Свойство("__ТЧ") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ СтруктураОбъекта.__ТЧ.Свойство(ИмяТЧ) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ИспользоватьСвойство("__ТЧ." + ИмяТЧ, СписокСвойств, ИсключаяСвойства) Тогда
		Возврат;
	КонецЕсли;
	
	МетаОбъект = Объект.Метаданные();
	
	МетаТЧ = МетаОбъект.ТабличныеЧасти.Найти(ИмяТЧ);
	
	Если МетаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект[ИмяТЧ].Очистить();
	
	МассивСтрок = СтруктураОбъекта.__ТЧ[ИмяТЧ].Элементы;
	
	Для й = 0 По МассивСтрок.ВГраница() Цикл
		
		ТекСтрока   = МассивСтрок[й];
		НоваяСтрока = Объект[ИмяТЧ].Добавить();
		
		Для Каждого ТекРеквизит Из МетаТЧ.Реквизиты Цикл
			
			Если НЕ ТекСтрока.Свойство(ТекРеквизит.Имя) Тогда
				Продолжить;
			КонецЕсли;
			
			ПутьКДанным = СтрШаблон("%1.%2", ИмяТЧ, ТекРеквизит.Имя);
			Если НЕ ИспользоватьСвойство(ПутьКДанным, СписокСвойств, ИсключаяСвойства) Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				НоваяСтрока[ТекРеквизит.Имя] = ЗначениеИзСтруктуры(ТекСтрока[ТекРеквизит.Имя]);
			Исключение
				ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ВызватьИсключение СтрШаблон("Ошибка получения значения свойства ""%1"" табличной части ""%2"", в строке %3:%4%5",
				                                 ТекРеквизит.Имя,
				                                 ИмяТЧ,
				                                 й,
				                                 Символы.ПС,
				                                 ТекстОшибки);
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ТЧОбъектаИзСтруктуры_Стар()

// Добавляет данные записи регистра (значения измерений, ресурсов, реквизитов) в структуру
//
// Параметры:
//  СтруктураЗаписи    - Структура           - заполняемая структура записи регистра
//  Запись             - Произвольный        - исходная запись регистра
//  СписокСвойств      - Строка              - список допустимых свойств
//                       Массив из Строка      (если пустой, то допустимы все свойства)
//  ИсключаяСвойства   - Строка              - список исключаемых свойств
//                       Массив из Строка      (если пустой, то допустимы все свойства)
//
Процедура ЗаполнитьДанныеЗаписиРегистраВСтруктуре(СтруктураЗаписи, Запись, СписокСвойств, ИсключаяСвойства)
	
	МетаОбъект = Метаданные.НайтиПоТипу(ТипЗнч(Запись));
	
	Для Каждого ТекПоле Из МетаОбъект.Измерения Цикл
		Если НЕ ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураЗаписи.Вставить(ТекПоле.Имя, ЗначениеВСтруктуру(Запись[ТекПоле.Имя]));
	КонецЦикла;
	
	Для Каждого ТекПоле Из МетаОбъект.Ресурсы Цикл
		Если НЕ ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураЗаписи.Вставить(ТекПоле.Имя, ЗначениеВСтруктуру(Запись[ТекПоле.Имя]));
	КонецЦикла;
	
	Для Каждого ТекПоле Из МетаОбъект.Реквизиты Цикл
		Если НЕ ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураЗаписи.Вставить(ТекПоле.Имя, ЗначениеВСтруктуру(Запись[ТекПоле.Имя]));
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДанныеЗаписиРегистраВСтруктуре()

// Заполняет данные записи регистра (значения измерений, ресурсов, реквизитов) из структуры
//
// Параметры:
//  Запись              - Произвольный        - заполняемая запись регистра
//  СтруктураЗаписи     - Структура           - структура данных объекта
//  СписокСвойств       - Строка              - список допустимых свойств
//                        Массив из Строка      (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка              - список исключаемых свойств
//                        Массив из Строка      (если пустой, то допустимы все свойства)
//
Процедура ЗаполнитьДанныеЗаписиРегистраИзСтруктуры(Запись, СтруктураЗаписи, СписокСвойств, ИсключаяСвойства)
	
	МетаОбъект = Метаданные.НайтиПоТипу(ТипЗнч(Запись));
	
	Для Каждого ТекПоле Из МетаОбъект.Измерения Цикл
		Если НЕ (СтруктураЗаписи.Свойство(ТекПоле.Имя)
		   И ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства)) Тогда
			Продолжить;
		КонецЕсли;
		Запись[ТекПоле.Имя] = ЗначениеИзСтруктуры(СтруктураЗаписи[ТекПоле.Имя]);
	КонецЦикла;
	
	Для Каждого ТекПоле Из МетаОбъект.Ресурсы Цикл
		Если НЕ (СтруктураЗаписи.Свойство(ТекПоле.Имя)
		   И ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства)) Тогда
			Продолжить;
		КонецЕсли;
		Запись[ТекПоле.Имя] = ЗначениеИзСтруктуры(СтруктураЗаписи[ТекПоле.Имя]);
	КонецЦикла;
	
	Для Каждого ТекПоле Из МетаОбъект.Реквизиты Цикл
		Если НЕ (СтруктураЗаписи.Свойство(ТекПоле.Имя)
		   И ИспользоватьСвойство(ТекПоле.Имя, СписокСвойств, ИсключаяСвойства)) Тогда
			Продолжить;
		КонецЕсли;
		Запись[ТекПоле.Имя] = ЗначениеИзСтруктуры(СтруктураЗаписи[ТекПоле.Имя]);
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДанныеЗаписиРегистраИзСтруктуры()

// Преобразует значения субконто записи регистра бухгалтерии в структуру
//
// Параметры:
//  Запись              - РегистрБухгалтерииЗапись    - Преобразуемая запись регистра бухгалтерии
//  ДтКт                - Строка                      - признак Дт/Кт - "Дт", "Кт", "" 
//  СписокСвойств       - Строка                      - список допустимых свойств
//                        Массив из Строка              (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                      - список исключаемых свойств
//                        Массив из Строка              (если пустой, то допустимы все свойства)
//
// Возвращаемое значение:
//   Массив из Структура                                    - результат преобразования
//     *НомерСтроки      - Число                            - Номер субконто
//     *ВидСубконто      - ПланВидовХарактеристикСсылка     - Вид субконто
//     *Значение         - Произвольный                     - Значение субконто
//
Функция ЗначенияСубконтоЗаписиВСтруктуру(Запись,
                                         ДтКт,
                                         СписокСвойств = Неопределено,
                                         ИсключаяСвойства = Неопределено)
	
	ВидыСубконто = Запись["Счет" + ДтКт].ВидыСубконто;
	ЗначенияСубконто = Запись["Субконто" + ДтКт];
	
	МассивСубконто = Новый Массив();
	й = 1;
	Для Каждого ТекСтрокаВида Из ВидыСубконто Цикл
		ПутьКДанным = СтрШаблон("Субконто%1%2", ДтКт, Формат(й, "ЧДЦ=; ЧГ="));
		Если НЕ ИспользоватьСвойство(ПутьКДанным, СписокСвойств, ИсключаяСвойства) Тогда
			й = й + 1;
			Продолжить;
		КонецЕсли;
		ОписаниеСубконто = Новый Структура();
		ОписаниеСубконто.Вставить("НомерСтроки", й);
		ОписаниеСубконто.Вставить("ВидСубконто", ЗначениеВСтруктуру(ТекСтрокаВида.ВидСубконто));
		ОписаниеСубконто.Вставить("Значение"   , ЗначениеВСтруктуру(ЗначенияСубконто[ТекСтрокаВида.ВидСубконто]));
		МассивСубконто.Добавить(ОписаниеСубконто);
		й = й + 1;
	КонецЦикла;
	
	Возврат МассивСубконто;
	
КонецФункции // ЗначенияСубконтоВСтруктуру()

// Заполняет значения субконто записи регистра бухгалтерии из структуры
//
// Параметры:
//  Запись              - РегистрБухгалтерииЗапись  - Заполняемая запись регистра бухгалтерии
//  СтруктураЗаписи     - Структура                 - Структура данных записи регистра бухгалтерии 
//  ДтКт                - Строка                    - признак Дт/Кт - "Дт", "Кт", "" 
//  СписокСвойств       - Строка                    - список допустимых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                    - список исключаемых свойств
//                        Массив из Строка            (если пустой, то допустимы все свойства)
//
Процедура ЗначенияСубконтоЗаписиИзСтруктуры(Запись,
                                            СтруктураЗаписи,
                                            ДтКт,
                                            СписокСвойств = Неопределено,
                                            ИсключаяСвойства = Неопределено)
	
	ИмяСубконто = СтрШаблон("Субконто%1", ДтКт);
	ВидыСубконто = Запись["Счет" + ДтКт].ВидыСубконто;
	ЗначенияСубконто = Запись[ИмяСубконто];
	
	МассивСубконто = СтруктураЗаписи[ИмяСубконто];
	
	й = 1;
	Для Каждого ТекСтрока Из МассивСубконто Цикл
		
		ИмяСвойства = СтрШаблон("%1%2", ИмяСубконто, Формат(й, "ЧДЦ=; ЧГ="));
		Если НЕ ИспользоватьСвойство(ИмяСвойства, СписокСвойств, ИсключаяСвойства) Тогда
			й = й + 1;
			Продолжить;
		КонецЕсли;
		
		ВидСубконто = ЗначениеИзСтруктуры(ТекСтрока.ВидСубконто);
		
		Если НЕ ЗначениеЗаполнено(ВидСубконто) Тогда
			й = й + 1;
			Продолжить;
		КонецЕсли;
		
		СтрокаВида = ВидыСубконто.Найти(ВидСубконто, "ВидСубконто");
		
		Если СтрокаВида = Неопределено Тогда
			й = й + 1;
			Продолжить;
		КонецЕсли;
		
		ЗначенияСубконто[ВидСубконто] = ЗначениеИзСтруктуры(ТекСтрока.Значение);
		
		й = й + 1;
		
	КонецЦикла;
	
КонецПроцедуры // ЗначенияСубконтоИзСтруктуры()

// Заполняет значение измерения записи регистра бухгалтерии из структуры
// с учетом признаков учета счета
//
// Параметры:
//  Запись               - РегистрБухгалтерииЗапись    - заполняемая запись регистра бухгалтерии
//  СтруктураЗаписи      - Структура                   - структура данных записи регистра бухгалтерии 
//  ОписаниеПоля         - ОбъектМетаданных            - описание метаданных измерения регистра 
//  ДтКт                 - Строка                      - признак Дт/Кт - "Дт", "Кт", "" 
//  СписокСвойств       - Строка                       - список допустимых свойств
//                        Массив из Строка               (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                       - список исключаемых свойств
//                        Массив из Строка               (если пустой, то допустимы все свойства)
//
Процедура ЗаполнитьИзмерениеРегистраБухгалтерии(Запись,
                                                СтруктураЗаписи,
                                                ОписаниеПоля,
                                                ДтКт,
                                                СписокСвойств = Неопределено,
                                                ИсключаяСвойства = Неопределено)
	
	Если НЕ (СтруктураЗаписи.Свойство(ОписаниеПоля.Имя + ДтКт)
			 И ИспользоватьСвойство(ОписаниеПоля.Имя, СписокСвойств, ИсключаяСвойства)) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнятьЗначение = Истина;
	
	Если НЕ ОписаниеПоля.ПризнакУчета = Неопределено Тогда
		Если НЕ Запись["Счет" + ДтКт][ОписаниеПоля.ПризнакУчета.Имя] Тогда
			ЗаполнятьЗначение = Ложь;
			Запись[ОписаниеПоля.Имя + ДтКт] = NULL;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнятьЗначение Тогда
		Запись[ОписаниеПоля.Имя + ДтКт] = ЗначениеИзСтруктуры(СтруктураЗаписи[ОписаниеПоля.Имя + ДтКт]);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьИзмерениеРегистраБухгалтерии()

// Заполняет значение ресурса записи регистра бухгалтерии из структуры
// с учетом признаков учета счета
//
// Параметры:
//  Запись              - РегистрБухгалтерииЗапись      - заполняемая запись регистра бухгалтерии
//  СтруктураЗаписи     - Структура                     - структура данных записи регистра бухгалтерии 
//  ОписаниеПоля        - ОбъектМетаданных              - описание метаданных ресурса регистра 
//  ДтКт                - Строка                        - признак Дт/Кт - "Дт", "Кт", "" 
//  СписокСвойств       - Строка                        - список допустимых свойств
//                        Массив из Строка                (если пустой, то допустимы все свойства)
//  ИсключаяСвойства    - Строка                        - список исключаемых свойств
//                        Массив из Строка                (если пустой, то допустимы все свойства)
//
Процедура ЗаполнитьРесурсРегистраБухгалтерии(Запись,
                                             СтруктураЗаписи,
                                             ОписаниеПоля,
                                             ДтКт,
                                             СписокСвойств,
                                             ИсключаяСвойства)
	
	Если НЕ (СтруктураЗаписи.Свойство(ОписаниеПоля.Имя + ДтКт)
			 И ИспользоватьСвойство(ОписаниеПоля.Имя, СписокСвойств, ИсключаяСвойства)) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнятьЗначение = Истина;
	
	Если НЕ ОписаниеПоля.ПризнакУчета = Неопределено Тогда
		Если НЕ Запись["Счет" + ДтКт][ОписаниеПоля.ПризнакУчета.Имя] Тогда
			ЗаполнятьЗначение = Ложь;
			Запись[ОписаниеПоля.Имя + ДтКт] = NULL;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнятьЗначение Тогда
		Запись[ОписаниеПоля.Имя + ДтКт] = ЗначениеИзСтруктуры(СтруктураЗаписи[ОписаниеПоля.Имя + ДтКт]);
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьРесурсРегистраБухгалтерии()

// Функция рекурсивно преобразует строку таблицы/дерева значений в структуру с "простыми" типами
//
// Параметры:
//    СтрокаЗначений    - СтрокаТаблицыЗначений          - Строка для преобразования
//                        СтрокаДереваЗначений
//    СписокСвойств     - Массив из Строка, Структура    - Список заполняемых полей строки
//
// Возвращаемое значение:
//   Структура                                    - Результат преобразования
//      *_ИмяКолонки_         - Произвольный        - Значение поля строки таблицы/дерева
//
Функция СтрокаЗначенийВСтруктуру(СтрокаЗначений, СписокСвойств)
	
	ВремСтрока = Новый Структура();
	
	Для Каждого ТекСвойство Из СписокСвойств Цикл
		Если ТипЗнч(ТекСвойство) = Тип("КлючИЗначение") Тогда
			ВремСтрока.Вставить(ТекСвойство.Ключ, ЗначениеВСтруктуру(СтрокаЗначений[ТекСвойство.Ключ]));
		Иначе
			ВремСтрока.Вставить(ТекСвойство, ЗначениеВСтруктуру(СтрокаЗначений[ТекСвойство]));
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВремСтрока;
	
КонецФункции // СтрокаЗначенийВСтруктуру()

// Процедура рекурсивно заполняет строку таблицы/дерева значений данными из структуры с "простыми" типами значений
//
// Параметры:
//   СтрокаЗначений      - СтрокаТаблицыЗначений  - Строка для преобразования
//                         СтрокаДереваЗначений
//   СтруктураЗначений   - Структура              - Значение для преобразования
//      *_ИмяКолонки_      - Произвольный           - Значение поля строки таблицы/дерева
//   СписокСвойств      - Массив из Строка        - Список заполняемых полей строки
//                        Структура
//
Процедура СтрокаЗначенийИзСтруктуры(СтрокаЗначений, СтруктураЗначений, СписокСвойств = Неопределено)
	
	Если СписокСвойств = Неопределено Тогда
		СписокСвойств = Новый Массив();
		Для Каждого ТекЭлемент Из СтруктураЗначений Цикл
			СписокСвойств.Добавить(ТекЭлемент.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ТекСвойство Из СписокСвойств Цикл
		Если ТипЗнч(ТекСвойство) = Тип("КлючИЗначение") Тогда
			ИмяКолонки = ТекСвойство.Ключ;
		ИначеЕсли ТипЗнч(ТекСвойство) = Тип("КолонкаТаблицыЗначений")
		      ИЛИ ТипЗнч(ТекСвойство) = Тип("КолонкаДереваЗначений") Тогда
			ИмяКолонки = ТекСвойство.Имя;
		Иначе
			ИмяКолонки = ТекСвойство;
		КонецЕсли;
		Попытка
			СтрокаЗначений[ИмяКолонки] = ЗначениеИзСтруктуры(СтруктураЗначений[ИмяКолонки]);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон("Ошибка получения значения свойства ""%1"":%2%3",
			                            ИмяКолонки,
			                            Символы.ПС,
			                            ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры // СтрокаЗначенийИзСтруктуры()

// Функция рекурсивно преобразует строки дерева значений в массив структур с "простыми" типами
//
// Параметры:
//   СтрокиДерева    - КоллекцияСтрокДереваЗначений      - Строки для преобразования
//   СписокСвойств   - Массив из Строка                  - Список заполняемых полей строки
//
// Возвращаемое значение:
//   Массив из Структура                      - Результат преобразования
//     *_ИмяКолонки_      - Произвольный        - Значение поля строки дерева
//
Функция СтрокиДереваВСтруктуру(СтрокиДерева, СписокСвойств)
	
	ВремСтроки = Новый Массив();
	
	Для Каждого ТекСтрока Из СтрокиДерева Цикл
		ВремСтрока = СтрокаЗначенийВСтруктуру(ТекСтрока, СписокСвойств);
		ВремСтрока.Вставить("Строки", СтрокиДереваВСтруктуру(ТекСтрока.Строки, СписокСвойств));
		ВремСтроки.Добавить(ВремСТрока);
	КонецЦикла;
	
	Возврат ВремСтроки;
	
КонецФункции // СтрокиДереваВСтруктуру()

// Процедура рекурсивно заполняет строки дерева значений данными из массива структур с "простыми" типами значений
//
// Параметры:
//   СтрокиДерева        - КоллекцияСтрокДереваЗначений  - Строка для преобразования
//   СтруктураСтрок      - Массив из Структура             - Значение для преобразования
//     *_ИмяКолонки_       - Произвольный                  - Значение поля строки дерева
//   СписокСвойств       - Массив из Строка              - Список заполняемых полей строк
//
Процедура СтрокиДереваИзСтруктуры(СтрокиДерева, СтруктураСтрок, СписокСвойств = Неопределено)
	
	Уровень = 0;
	Родитель = СтрокиДерева.Родитель;
	Пока НЕ Родитель = Неопределено Цикл
		Уровень = Уровень + 1;
		Родитель = Родитель.Родитель;
	КонецЦикла;
	
	Для й = 0 По СтруктураСтрок.ВГраница() Цикл
		НоваяСтрока = СтрокиДерева.Добавить();
		Попытка
			СтрокаЗначенийИзСтруктуры(НоваяСтрока, СтруктураСтрок[й], СписокСвойств);
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон("Ошибка заполнения дерева значений, на уровне %1 в строке %2:%3%4",
			                            Уровень,
			                            й,
			                            Символы.ПС,
			                            ТекстОшибки);
		КонецПопытки;
		СтрокиДереваИзСтруктуры(НоваяСтрока.Строки, СтруктураСтрок[й].Строки, СписокСвойств);
	КонецЦикла;
	
КонецПроцедуры // СтрокиДереваИзСтруктуры()

#КонецОбласти // ПреобразованияОбъектовСлужебные

#Область КэшированиеЗначений

// Функция - заполняет и возвращает кэш системных перечислений
//
// Возвращаемое значение:
//   Структура  - кэш системных перечислений
//
Функция СистемныеПеречисления()
	
	Если НЕ СистемныеПеречисления = Неопределено Тогда
		Возврат СистемныеПеречисления;
	КонецЕсли;
	
	СистемныеПеречисления = Новый Соответствие();
	
	МакетПеречислений = ПолучитьМакет("Перечисления");
	
	СписокПеречислений = ПрочитатьОписаниеОбъектаИзJSON(МакетПеречислений.ПолучитьТекст());
	
	Для Каждого ТекПеречисление Из СписокПеречислений Цикл
		
		Попытка
			ТекТип = Тип(ТекПеречисление.Ключ);
		Исключение
			Продолжить;
		КонецПопытки;
		
		ЗначенияПеречисления = Новый Соответствие();
		Для Каждого ТекЗначение Из ТекПеречисление.Значение Цикл
			ПолноеЗначение = СтрШаблон("%1.%2", ТекПеречисление.Ключ, ТекЗначение);
			Попытка
				ЗначениеПеречисления = Вычислить(ПолноеЗначение);
			Исключение
				Продолжить;
			КонецПопытки;
			ЗначенияПеречисления.Вставить(ЗначениеПеречисления, ТекЗначение);
		КонецЦикла;
		СистемныеПеречисления.Вставить(ТекТип, ЗначенияПеречисления);
	КонецЦикла;
	
	Возврат СистемныеПеречисления;
	
КонецФункции // СистемныеПеречисления()

// Функция - заполняет и возвращает кэш типов СКД
//
// Возвращаемое значение:
//   Структура  - кэш типов СКД
//
Функция ТипыЗначенийСКД()
	
	Если НЕ ТипыЗначенийСКД = Неопределено Тогда
		Возврат ТипыЗначенийСКД;
	КонецЕсли;
	
	ТипыЗначенийСКД = Новый Соответствие();
	
	МакетТиповСКД = ПолучитьМакет("ТипыЗначенийСКД");
	
	СписокТиповСКД = ПрочитатьОписаниеОбъектаИзJSON(МакетТиповСКД.ПолучитьТекст());
	
	Для Каждого ТекТипСКД Из СписокТиповСКД Цикл
		
		Попытка
			ТекТип = Тип(ТекТипСКД.Ключ);
		Исключение
			Продолжить;
		КонецПопытки;
		
		ТипыЗначенийСКД.Вставить(ТекТип, ТекТипСКД.Значение);
	КонецЦикла;
	
	Возврат ТипыЗначенийСКД;
	
КонецФункции // ТипыЗначенийСКД()

// Функция - заполняет и возвращает кэш предопределенных цветов
//
// Возвращаемое значение:
//   Структура  - кэш предопределенных цветов
//
Функция Цвета()
	
	Если НЕ КэшЦветов = Неопределено Тогда
		Возврат КэшЦветов;
	КонецЕсли;
	
	КэшЦветов = Новый Структура();
	
	МакетЦветов = ПолучитьМакет("Цвета");
	
	СписокВидовЦветов = ПрочитатьОписаниеОбъектаИзJSON(МакетЦветов.ПолучитьТекст());
	
	Для Каждого ТекВидЦвета Из СписокВидовЦветов Цикл
		
		СписокЦветов = Новый Соответствие();
		Для Каждого ТекЦвет Из ТекВидЦвета.Значение Цикл
			Если ТекВидЦвета.Ключ = "WebЦвета" Тогда
				СписокЦветов.Вставить(WebЦвета[ТекЦвет], ТекЦвет);
			ИначеЕсли ТекВидЦвета.Ключ = "WindowsЦвета" Тогда
				СписокЦветов.Вставить(WindowsЦвета[ТекЦвет], ТекЦвет);
			ИначеЕсли ТекВидЦвета.Ключ = "ЭлементыСтиля" Тогда
				СписокЦветов.Вставить(ЦветаСтиля[ТекЦвет], ТекЦвет);
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		Если ТекВидЦвета.Ключ = "ЭлементыСтиля" Тогда
			Для Каждого ТекЭлемент Из Метаданные.ЭлементыСтиля Цикл
				Если НЕ ТекЭлемент.Вид = Метаданные.СвойстваОбъектов.ВидЭлементаСтиля.Цвет Тогда
					Продолжить;
				КонецЕсли;
				СписокЦветов.Вставить(ЦветаСтиля[ТекЭлемент.Имя], ТекЭлемент.Имя);
			КонецЦикла;
		КонецЕсли;
		КэшЦветов.Вставить(ТекВидЦвета.Ключ, СписокЦветов);
	КонецЦикла;
	
	Возврат КэшЦветов;
	
КонецФункции // Цвета()

// Функция - заполняет и возвращает кэш предопределенных шрифтов
//
// Возвращаемое значение:
//   Структура  - кэш предопределенных шрифтов
//
Функция Шрифты()
	
	Если НЕ КэшШрифтов = Неопределено Тогда
		Возврат КэшШрифтов;
	КонецЕсли;
	
	КэшШрифтов = Новый Структура();
	
	МакетШрифтов = ПолучитьМакет("Шрифты");
	
	СписокВидовШрифтов = ПрочитатьОписаниеОбъектаИзJSON(МакетШрифтов.ПолучитьТекст());
	
	Для Каждого ТекВидШрифта Из СписокВидовШрифтов Цикл
		
		СписокШрифтов = Новый Соответствие();
		Для Каждого ТекШрифт Из ТекВидШрифта.Значение Цикл
			Если ТекВидШрифта.Ключ = "WindowsШрифты" Тогда
				СписокШрифтов.Вставить(WindowsШрифты[ТекШрифт], ТекШрифт);
			ИначеЕсли ТекВидШрифта.Ключ = "ЭлементыСтиля" Тогда
				СписокШрифтов.Вставить(ШрифтыСтиля[ТекШрифт], ТекШрифт);
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		Если ТекВидШрифта.Ключ = "ЭлементыСтиля" Тогда
			Для Каждого ТекЭлемент Из Метаданные.ЭлементыСтиля Цикл
				Если НЕ ТекЭлемент.Вид = Метаданные.СвойстваОбъектов.ВидЭлементаСтиля.Шрифт Тогда
					Продолжить;
				КонецЕсли;
				СписокШрифтов.Вставить(ШрифтыСтиля[ТекЭлемент.Имя], ТекЭлемент.Имя);
			КонецЦикла;
		КонецЕсли;
		КэшШрифтов.Вставить(ТекВидШрифта.Ключ, СписокШрифтов);
	КонецЦикла;
	
	Возврат КэшШрифтов;
	
КонецФункции // Шрифты()

// Функция - заполняет и возвращает кэш предопределенных рамок элементов
//
// Возвращаемое значение:
//   Структура  - кэш предопределенных рамок элементов
//
Функция Рамки()
	
	Если НЕ КэшРамок = Неопределено Тогда
		Возврат КэшРамок;
	КонецЕсли;
	
	КэшРамок = Новый Структура();
	
	МакетРамок = ПолучитьМакет("Рамки");
	
	СписокВидовРамок = ПрочитатьОписаниеОбъектаИзJSON(МакетРамок.ПолучитьТекст());
	
	Для Каждого ТекВидРамки Из СписокВидовРамок Цикл
		
		СписокРамок = Новый Соответствие();
		Для Каждого ТекРамка Из ТекВидРамки.Значение Цикл
			Если ТекВидРамки.Ключ = "ЭлементыСтиля" Тогда
				СписокРамок.Вставить(РамкиСтиля[ТекРамка], ТекРамка);
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		Если ТекВидРамки.Ключ = "ЭлементыСтиля" Тогда
			Для Каждого ТекЭлемент Из Метаданные.ЭлементыСтиля Цикл
				Если НЕ ТекЭлемент.Вид = Метаданные.СвойстваОбъектов.ВидЭлементаСтиля.Рамка Тогда
					Продолжить;
				КонецЕсли;
				СписокРамок.Вставить(РамкиСтиля[ТекЭлемент.Имя], ТекЭлемент.Имя);
			КонецЦикла;
		КонецЕсли;
		КэшРамок.Вставить(ТекВидРамки.Ключ, СписокРамок);
	КонецЦикла;
	
	Возврат КэшРамок;
	
КонецФункции // Рамки()

// Функция - заполняет и возвращает кэш предопределенных картинок
//
// Возвращаемое значение:
//   Структура  - кэш предопределенных картинок
//
Функция Картинки()
	
	Если НЕ КэшКартинок = Неопределено Тогда
		Возврат КэшКартинок;
	КонецЕсли;
	
	КэшКартинок = Новый Структура();
	
	МакетКартинок = ПолучитьМакет("Картинки");
	
	СписокВидовКартинок = ПрочитатьОписаниеОбъектаИзJSON(МакетКартинок.ПолучитьТекст());
	
	Для Каждого ТекВидКартинки Из СписокВидовКартинок Цикл
		
		СписокКартинок = Новый Соответствие();
		Для Каждого ТекКартинка Из ТекВидКартинки.Значение Цикл
			Если ТекВидКартинки.Ключ = "Библиотека" Тогда
				СписокКартинок.Вставить(БиблиотекаКартинок[ТекКартинка], ТекКартинка);
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		Если ТекВидКартинки.Ключ = "Библиотека" Тогда
			Для Каждого ТекЭлемент Из Метаданные.ОбщиеКартинки Цикл
				СписокКартинок.Вставить(БиблиотекаКартинок[ТекЭлемент.Имя], ТекЭлемент.Имя);
			КонецЦикла;
		КонецЕсли;
		КэшКартинок.Вставить(ТекВидКартинки.Ключ, СписокКартинок);
	КонецЦикла;
	
	Возврат КэшКартинок;
	
КонецФункции // Картинки()
	
Функция ПроверитьПолучитьСтрокуТипа(СтрокаТипа)
	
	СоответствиеСтрокТипам = Новый Соответствие();
	СоответствиеСтрокТипам.Вставить("ИнформационнаяЛиния", "ИнформационнаяЛинияДиаграммы");
	СоответствиеСтрокТипам.Вставить("ИнформационныйИнтервал", "ИнформационныйИнтервалДиаграммы");
	
	НоваяСтрокаТипа = СоответствиеСтрокТипам.Получить(СтрокаТипа);
	
	Если ЗначениеЗаполнено(НоваяСтрокаТипа) Тогда
		Возврат НоваяСтрокаТипа;
	КонецЕсли;
	
	Возврат СтрокаТипа;
	
КонецФункции // ПроверитьПолучитьСтрокуТипа()

// Функция - возвращает кэш описаний типов
//
// Возвращаемое значение:
//   Соответствие из Структура    - кэш описаний типов
//
Функция КэшОписанийТипов()
	
	Если НЕ ТипЗнч(КэшОписанийТипов) = Тип("Соответствие") ИЛИ КэшОписанийТипов.Количество() = 0 Тогда
		
		КэшОписанийТипов = Новый Соответствие();
		 
		МакетОписанияТипов = ПолучитьМакет("ОписаниеТипов");
		
		ОписаниеТиповМакет = ПрочитатьОписаниеОбъектаИзJSON(МакетОписанияТипов.ПолучитьТекст());
		
		Для Каждого ТекОписание Из ОписаниеТиповМакет Цикл
			
			КэшОписанийТипов.Вставить(ТекОписание.Ключ, ТекОписание.Значение);
			КэшОписанийТипов[ТекОписание.Ключ].Вставить("Имя", ТекОписание.Ключ);
			
			Для Каждого ТекИмя Из ТекОписание.Значение.ИменаКоллекции Цикл
				КэшОписанийТипов.Вставить(ТекИмя, ТекОписание.Значение);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат КэшОписанийТипов;
	
КонецФункции // КэшОписанийТипов()

// Функция - возвращает кэш объектов метаданных, которые могут содержать предопределенные значения
//
// Возвращаемое значение:
//   Соответствие из Структура    - кэш объектов метаданных, которые могут содержать предопределенные значения
//
Функция КэшМетаданных()
	
	Если ТипЗнч(КэшМетаданных) = Тип("Соответствие") Тогда
		Возврат КэшМетаданных;
	КонецЕсли;
	
	КоллекцииМетаданных = СтрРазделить("Справочники,
	                                   |Документы,
	                                   |Перечисления,
	                                   |ПланыВидовХарактеристик,
	                                   |ПланыСчетов,
	                                   |ПланыОбмена,
	                                   |ПланыВидовРасчета,
	                                   |БизнесПроцессы,
	                                   |Задачи,
	                                   |РегистрыСведений,
	                                   |РегистрыНакопления,
	                                   |РегистрыБухгалтерии,
	                                   |РегистрыРасчета",
	                                   ",");
	
	КэшМетаданных = Новый Соответствие();
	
	Для Каждого ТекКоллекция Из КоллекцииМетаданных Цикл
		Для Каждого ТекМета Из Метаданные[СокрЛП(ТекКоллекция)] Цикл
			Описание = Новый Структура();
			Описание.Вставить("Коллекция", СокрЛП(ТекКоллекция));
			Описание.Вставить("ПолноеИмя", ТекМета.ПолноеИмя());
			Описание.Вставить("Имя"      , ТекМета.Имя);
			
			КэшМетаданных.Вставить(Описание.ПолноеИмя, Описание);
			
			Если Лев(Описание.Коллекция, 8) = "Регистры" Тогда
				ТипЗначения = Тип(СтрЗаменить(Описание.ПолноеИмя, ".", "Запись."));
				КэшМетаданных.Вставить(ТипЗначения, Описание);
				ТипЗначения = Тип(СтрЗаменить(Описание.ПолноеИмя, ".", "НаборЗаписей."));
				КэшМетаданных.Вставить(ТипЗначения, Описание);
			ИначеЕсли Описание.Коллекция = "Перечисления" Тогда
				ТипЗначения = Тип(СтрЗаменить(Описание.ПолноеИмя, ".", "Ссылка."));
				КэшМетаданных.Вставить(ТипЗначения, Описание);
			Иначе
				ТипЗначения = Тип(СтрЗаменить(Описание.ПолноеИмя, ".", "Объект."));
				КэшМетаданных.Вставить(ТипЗначения, Описание);
				ТипЗначения = Тип(СтрЗаменить(Описание.ПолноеИмя, ".", "Ссылка."));
				КэшМетаданных.Вставить(ТипЗначения, Описание);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат КэшМетаданных;
	
КонецФункции // КэшМетаданных()

#КонецОбласти // КэшированиеЗначений

#Область ПрочиеСлужебныеПроцедурыИФункции

// Процедура - выодит сообщение пользователю
//
// Параметры:
//     ТекстСообщения     - Строка - Текст сообщения
//     ВызыватьИсключение - Булево - Истина - будет вызвано исключение
//
Процедура ПоказатьСообщение(ТекстСообщения, ВызыватьИсключение = Ложь)
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
	Если ВызыватьИсключение Тогда
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры // ПоказатьСообщение()

// Функция - рекурсивно копирует переданную структуру
//
// Параметры:
//   СтруктураИсточник    - Структура    - исходная структура
//
// Возвращаемое значение:
//   Структура    - копия переданной структуры
//
Функция СкопироватьСтруктуру(СтруктураИсточник)
	
	СтруктураРезультат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		ТипЗначения = ТипЗнч(КлючИЗначение.Значение);
		Если ТипЗначения = Тип("Структура")
			Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
			Значение = СкопироватьСтруктуру(КлючИЗначение.Значение);
		ИначеЕсли ТипЗначения = Тип("Массив")
			Или ТипЗначения = Тип("ФиксированныйМассив") Тогда
			Значение = СкопироватьМассив(КлючИЗначение.Значение);
		Иначе
			Значение = КлючИЗначение.Значение;
		КонецЕсли;
		СтруктураРезультат.Вставить(КлючИЗначение.Ключ, Значение);
	КонецЦикла;
	
	Возврат СтруктураРезультат;
	
КонецФункции // СкопироватьСтруктуру()

// Функция - рекурсивно копирует переданный массив
//
// Параметры:
//   МассивИсточник    - Массив    - исходный массив
//
// Возвращаемое значение:
//   Массив    - копия переданного массива
//
Функция СкопироватьМассив(МассивИсточник)
	
	МассивРезультат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		ТипЗначения = ТипЗнч(Элемент);
		Если ТипЗначения = Тип("Структура")
			Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
			Значение = СкопироватьСтруктуру(Элемент);
		ИначеЕсли ТипЗначения = Тип("Массив")
			Или ТипЗначения = Тип("ФиксированныйМассив") Тогда
			Значение = СкопироватьМассив(Элемент);
		Иначе
			Значение = Элемент;
		КонецЕсли;
		МассивРезультат.Добавить(Значение);
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции // СкопироватьМассив()

// Процедура - дополняет текст полями структуры
//
// Параметры:
//     Текст             - Строка    - дополняемый текст
//     ПарамСтруктура    - Структура - структура, поля которой добавляются
//     ДобавлятьЗначения - Булево    - Истина - к тексту полей будут добавлены значения
//
Процедура ДополнитьТекстПолямиСтруктуры(Текст, ПарамСтруктура, ДобавлятьЗначения = Ложь)
	
	Для Каждого ТекЭлемент Из ПарамСтруктура Цикл
		Текст = СтрШаблон("%1%2%3", Текст, Символы.ПС, ТекЭлемент.Ключ);
		Если ДобавлятьЗначения Тогда
			Текст = СтрШаблон("%1 : %2", Текст, ТекЭлемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ДополнитьТекстПолямиСтруктуры()

// Функция сравнивает значения как строки
//
// Параметры: 
//     ЛевоеЗначение     - Произвольный   - левое значение для сравнения
//     ПравоеЗначение    - Произвольный   - правое значение для сравнения
//     УчитыватьРегистр  - Булево         - Истина - проверка выполняется с учетом регистра,
//                                          Ложь - без учета регистра
//
// Возвращаемое значение:
//     Булево   - Истина - строковые представления равны,
//                Ложь - в противном случае
//
Функция ПредставленияРавны(Знач ЛевоеЗначение, Знач ПравоеЗначение, Знач УчитыватьРегистр = Ложь)
	
	ЛевоеЗначение = СокрЛП(ЛевоеЗначение);
	ПравоеЗначение = СокрЛП(ПравоеЗначение);
	
	Если НЕ УчитыватьРегистр Тогда
		ЛевоеЗначение = ВРег(ЛевоеЗначение);
		ПравоеЗначение = ВРег(ПравоеЗначение);
	КонецЕсли;
	
	Возврат (ЛевоеЗначение = ПравоеЗначение);
	
КонецФункции // ПредставленияРавны()

// Функция проверяет наличие в структуре служебного поля "__Тип"
//
// Параметры: 
//     Структура     - Структура   - проверяемая структура
//
// Возвращаемое значение:
//     Булево   - Истина - в структуре есть поле "__Тип"
//
Функция ЕстьТип(Знач Структура)
	
	Если НЕ (ТипЗнч(Структура) = Тип("Структура")
	 ИЛИ ТипЗнч(Структура) = Тип("ФиксированнаяСтруктура")) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Структура.Свойство("__Тип");
	
КонецФункции // ЕстьТип()

// Функция проверяет наличие в структуре поля "Ссылка"
//
// Параметры: 
//     Структура     - Структура   - проверяемая структура
//
// Возвращаемое значение:
//     Булево   - Истина - в структуре есть поле "Ссылка"
//
Функция ЕстьСсылка(Знач Структура)
	
	Если НЕ (ТипЗнч(Структура) = Тип("Структура")
	 ИЛИ ТипЗнч(Структура) = Тип("ФиксированнаяСтруктура"))Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Структура.Свойство("Ссылка");
	
КонецФункции // ЕстьСсылка()

// Функция - возвращает флаг, что текущая конфигурация на текущей платформы совместима с указанным релизом 8.3
//
// Параметры:
//     ПроверяемыйРелиз    - Число    - номер проверяемого релиза платформы 8.3
//
// Возвращаемое значение:
//   Булево    - Истина - конфигурация на текущей платформы совместима с указанным релизом 8.3
//               Ложь - в противном случае
//
Функция Совместимость8_3(ПроверяемыйРелиз)
	
	Если НЕ ТипЗнч(Совместимость8_3) = Тип("Соответствие") Тогда
		Совместимость8_3 = Новый Соответствие();
	КонецЕсли;
	
	Если НЕ Совместимость8_3.Получить(ПроверяемыйРелиз) = Неопределено Тогда
		Возврат Совместимость8_3[ПроверяемыйРелиз];
	КонецЕсли;
	
	ПроверяемаяВерсия = 3;
	
	Совместимость8_3.Вставить(ПроверяемыйРелиз, Истина);
	
	СИ = Новый СистемнаяИнформация();
	
	Попытка
		ЧастиВерсии = СтрРазделить(СИ.ВерсияПриложения, ".");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Для й = 0 По ЧастиВерсии.ВГраница() Цикл
		ЧастиВерсии[й] = Число(ЧастиВерсии[й]);
	КонецЦикла;
	
	Если Число(ЧастиВерсии[1]) < ПроверяемаяВерсия Тогда
		Совместимость8_3.Вставить(ПроверяемыйРелиз, Ложь);
	КонецЕсли;
	
	Если Число(ЧастиВерсии[2]) < ПроверяемыйРелиз Тогда
		Совместимость8_3.Вставить(ПроверяемыйРелиз, Ложь);
	КонецЕсли;
	
	РежимыСовместимости = РежимыСовместимости8_3(СтрШаблон("8.3.%1", ПроверяемыйРелиз));
	
	Если РежимыСовместимости.Получить(Метаданные.РежимСовместимости) = Неопределено Тогда
		Совместимость8_3.Вставить(ПроверяемыйРелиз, Ложь);
	КонецЕсли;
	
	Возврат Совместимость8_3[ПроверяемыйРелиз];
	
КонецФункции // Совместимость8_3()

// Функция - коллекцию режимов совместимости, "совместимых" с указанным режимом совместимости
//
// Параметры:
//     НачинаяСВерсии8_3   - Строка     - минимальный режим совместимости, для которого
//                                        заполняется набор "совместимых" режимов совместимости
//
// Возвращаемое значение:
//   ФиксированноеСоответствие из Строка   - коллекция режимов совместимости
//
Функция РежимыСовместимости8_3(НачинаяСВерсии8_3)
	
	ПозицияНомераРелиза = 2;
	
	СИ = Новый СистемнаяИнформация();
	ЧастиВерсииПриложения = СтрРазделить(СИ.ВерсияПриложения, ".");
	РелизПриложения = СтрШаблон("%1.%2.%3",
	                            ЧастиВерсииПриложения[0],
	                            ЧастиВерсииПриложения[1],
	                            ЧастиВерсииПриложения[ПозицияНомераРелиза]);
	
	ЧастиВерсии = СтрРазделить(НачинаяСВерсии8_3, ".");
	РелизНачинаяСВерсии8_3 = Число(ЧастиВерсии[ПозицияНомераРелиза]);
	
	РежимыСовместимости = Новый Соответствие();
	
	Если ЧастиВерсииПриложения[1] = "3"  Тогда
		
		Для й = РелизНачинаяСВерсии8_3 По Число(ЧастиВерсииПриложения[ПозицияНомераРелиза]) - 1 Цикл
			РежимыСовместимости.Вставить(Метаданные.СвойстваОбъектов.РежимСовместимости["Версия8_3_" + Формат(й, "ЧРГ=; ЧГ=")],
			                             "8.3." + Формат(й, "ЧРГ=; ЧГ="));
		КонецЦикла;
		
		РежимыСовместимости.Вставить(Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать, РелизПриложения);
		
	КонецЕсли;
	
	Возврат Новый ФиксированноеСоответствие(РежимыСовместимости);
	
КонецФункции // РежимыСовместимости8_3()

#КонецОбласти // ПрочиеСлужебныеПроцедурыИФункции

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область Инициализация

Если НЕ Совместимость8_3(17) Тогда
	ВызватьИсключение "Требуется режим совместимости 8.3.17 или старше";
КонецЕсли;

#КонецОбласти // Инициализация
